HloModule jit__einsum, is_scheduled=true, entry_computation_layout={(c128[4,60,960]{2,1,0}, c128[4,60,960]{2,1,0})->c128[4,960,960]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="a487327bea2ec00f11f176692b0fdaef"}

ENTRY %main.4_spmd (param.2: c128[4,60,960], param.1.0: c128[4,60,960]) -> c128[4,960,960] {
  %param.1.0 = c128[4,60,960]{2,1,0} parameter(1), sharding={devices=[4,1,1]<=[4]}, metadata={op_name="operands[1]" scheduling_name="param.1.0"}
  %param.2 = c128[4,60,960]{2,1,0} parameter(0), sharding={devices=[4,1,1]<=[4]}, metadata={op_name="operands[0]" scheduling_name="param.2"}
  %custom-call.1.0 = (c128[4,960,960]{2,1,0}, s8[4194304]{0}) custom-call(%param.2, %param.1.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bandstructure/htransform.py" source_line=569 scheduling_name="custom-call.1.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["1"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"57600","rhs_stride":"57600","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  ROOT %get-tuple-element.1 = c128[4,960,960]{2,1,0} get-tuple-element(%custom-call.1.0), index=0, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bandstructure/htransform.py" source_line=569 scheduling_name="get-tuple-element.1"}
}

