HloModule jit__kernel, entry_computation_layout={(token[], c128[9,656,80,4]{3,2,1,0}, c128[9,656,80,4]{3,2,1,0}, c128[9,656,656]{2,1,0}, f64[80]{0}, /*index=5*/f64[80]{0}, s32[])->(token[], c128[9,656,46080]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,true,true,true}, allow_spmd_sharding_propagation_to_output={false,true}, num_partitions=16

%region_0.216 (Arg_0.217: c128[], Arg_1.218: c128[]) -> c128[] {
  %Arg_0.217 = c128[] parameter(0), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/reduce_prod"}
  %Arg_1.218 = c128[] parameter(1), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/reduce_prod"}
  ROOT %multiply.219 = c128[] multiply(%Arg_0.217, %Arg_1.218), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
}

%region_1.253 (Arg_0.254: c128[], Arg_1.255: c128[]) -> c128[] {
  %Arg_0.254 = c128[] parameter(0), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod"}
  %Arg_1.255 = c128[] parameter(1), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod"}
  ROOT %multiply.256 = c128[] multiply(%Arg_0.254, %Arg_1.255), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
}

%region_2.270 (Arg_0.271: c128[], Arg_1.272: c128[]) -> c128[] {
  %Arg_0.271 = c128[] parameter(0), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod"}
  %Arg_1.272 = c128[] parameter(1), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod"}
  ROOT %multiply.273 = c128[] multiply(%Arg_0.271, %Arg_1.272), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
}

ENTRY %main.381 (Arg_0.1: token[], Arg_1.2: c128[9,656,80,4], Arg_2.3: c128[9,656,80,4], Arg_3.4: c128[9,656,656], Arg_4.5: f64[80], Arg_5.6: f64[80], Arg_6.7: s32[]) -> (token[], c128[9,656,46080]) {
  %Arg_6.7 = s32[] parameter(6), metadata={op_name="r_start_dyn"}
  %constant.15 = c128[4,4]{1,0} constant({...})
  %constant.26 = s64[] constant(291891024)
  %Arg_0.1 = token[] parameter(0)
  %partition-id.0 = u32[] partition-id(), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %constant.46 = u32[] constant(2), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %shift-right-logical = u32[] shift-right-logical(%partition-id.0, %constant.46), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %constant.47 = u32[] constant(3), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %and = u32[] and(%shift-right-logical, %constant.47), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %convert.0 = s32[] convert(%and), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=285}
  %partition-id.1 = u32[] partition-id(), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=286}
  %constant.48 = u32[] constant(3), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=286}
  %and.1 = u32[] and(%partition-id.1, %constant.48), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=286}
  %convert.1 = s32[] convert(%and.1), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=286}
  %custom-call.4 = (token[], c128[9,5,4,24,24,80]{5,4,3,2,1,0}) custom-call(%constant.26, %Arg_0.1, %convert.0, %convert.1), custom_call_target="xla_python_gpu_callback", operand_layout_constraints={s64[], token[], s32[], s32[]}, custom_call_has_side_effect=true, api_version=API_VERSION_STATUS_RETURNING, sharding={{manual}, {manual}}, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=287}, backend_config="291891024"
  %get-tuple-element.38 = token[] get-tuple-element(%custom-call.4), index=0, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=287}
  %Arg_3.4 = c128[9,656,656]{2,1,0} parameter(3), sharding={devices=[1,4,4]<=[16]}, metadata={op_name="L_q"}
  %custom-call.60 = c128[9,656,656]{2,1,0} custom-call(%Arg_3.4), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=738}
  %custom-call.61 = c128[9,656,656]{2,1,0} custom-call(%custom-call.60), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=739}
  %custom-call.62 = c128[9,656,656]{2,1,0} custom-call(%custom-call.61), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=739}
  %custom-call.63 = (c128[9,656,656]{1,2,0}, s32[9,656]{1,0}, s32[9]{0}) custom-call(%custom-call.62), custom_call_target="cusolver_getrf_ffi", operand_layout_constraints={c128[9,656,656]{1,2,0}}, output_to_operand_aliasing={{0}: (0, {})}, api_version=API_VERSION_TYPED_FFI, frontend_attributes={num_batch_dims="1"}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}, backend_config={}
  %get-tuple-element.8 = s32[9]{0} get-tuple-element(%custom-call.63), index=2, frontend_attributes={num_batch_dims="1"}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}
  %constant.41 = s32[] constant(0)
  %broadcast.53 = s32[9]{0} broadcast(%constant.41), dimensions={}
  %compare.9 = pred[9]{0} compare(%get-tuple-element.8, %broadcast.53), direction=GE, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}
  %broadcast.55 = pred[9,656,656]{2,1,0} broadcast(%compare.9), dimensions={0}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}
  %get-tuple-element.9 = c128[9,656,656]{1,2,0} get-tuple-element(%custom-call.63), index=0, frontend_attributes={num_batch_dims="1"}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}
  %constant.42 = c128[] constant((nan, nan))
  %broadcast.56 = c128[9,656,656]{2,1,0} broadcast(%constant.42), dimensions={}
  %select.10 = c128[9,656,656]{2,1,0} select(%broadcast.55, %get-tuple-element.9, %broadcast.56), metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/jit(solve)/lu" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=721}
  %constant.16 = c128[] constant((0, 0))
  %broadcast.17 = c128[9,656,46080]{2,1,0} broadcast(%constant.16), dimensions={}
  %custom-call.18 = c128[9,656,46080]{2,1,0} custom-call(%broadcast.17), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=942}
  %custom-call.24 = c128[9,656,46080]{2,1,0} custom-call(%custom-call.18), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %constant.64 = c128[4,4]{1,0} constant({...})
  %custom-call.25 = c128[4,4]{1,0} custom-call(%constant.64), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %Arg_1.2 = c128[9,656,80,4]{3,2,1,0} parameter(1), sharding={devices=[1,4,1,1,4]<=[16] last_tile_dim_replicate}, metadata={op_name="psi_l_rmuT_X_fit"}
  %custom-call.26 = c128[9,656,80,4]{3,2,1,0} custom-call(%Arg_1.2), custom_call_target="Sharding", sharding={devices=[1,4,1,1,4]<=[16] last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %dot.2 = c128[4,9,656,80]{3,2,1,0} dot(%custom-call.25, %custom-call.26), lhs_contracting_dims={0}, rhs_contracting_dims={3}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmna,ab,knbv->kmv/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %get-tuple-element.39 = c128[9,5,4,24,24,80]{5,4,3,2,1,0} get-tuple-element(%custom-call.4), index=1, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=287}
  %custom-call.40 = c128[9,5,4,24,24,80]{5,4,3,2,1,0} custom-call(%get-tuple-element.39), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=290}
  %custom-call.41 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.40), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,16,1,1,1,1]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/psi_G_store.py" source_line=290}
  %custom-call.5 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.41), custom_call_target="Sharding", sharding={devices=[1,16,1,1,1,1]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=375}
  %custom-call.6 = c128[9,5,4,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.5), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=375}
  %fft.8 = c128[9,5,4,24,24,80]{5,4,3,2,1,0} fft(%custom-call.6), fft_type=IFFT, fft_length={24,24,80}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/jit(shmap_body)/jit(fft)/fft" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %custom-call.7 = c128[9,5,4,24,24,80]{5,4,3,2,1,0} custom-call(%fft.8), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=375}
  %custom-call.8 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.7), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,16,1,1,1,1]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=375}
  %constant.53 = f64[9]{0} constant({0, 0, 0, 0.33333333333333331, 0.33333333333333331, 0.33333333333333331, 0.66666666666666663, 0.66666666666666663, 0.66666666666666663}), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %broadcast.24 = f64[9,24,1,1]{3,2,1,0} broadcast(%constant.53), dimensions={0}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %iota = f64[1,24,1,1]{3,2,1,0} iota(), iota_dimension=1, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=359}
  %constant.49 = f64[] constant(0.041666666666666664)
  %broadcast.61 = f64[1,24,1,1]{3,2,1,0} broadcast(%constant.49), dimensions={}
  %multiply.20 = f64[1,24,1,1]{3,2,1,0} multiply(%iota, %broadcast.61), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=359}
  %reshape.61 = f64[24]{0} reshape(%multiply.20), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %broadcast.26 = f64[9,24,1,1]{3,2,1,0} broadcast(%reshape.61), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %multiply.3 = f64[9,24,1,1]{3,2,1,0} multiply(%broadcast.24, %broadcast.26), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %reshape.65 = f64[9,24]{1,0} reshape(%multiply.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %broadcast.28 = f64[9,24,24,1]{3,2,1,0} broadcast(%reshape.65), dimensions={0,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %constant.55 = f64[9]{0} constant({0, 0.33333333333333331, 0.66666666666666663, 0, 0.33333333333333331, 0.66666666666666663, 0, 0.33333333333333331, 0.66666666666666663}), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=379}
  %broadcast.30 = f64[9,1,24,1]{3,2,1,0} broadcast(%constant.55), dimensions={0}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=379}
  %iota.1 = f64[1,1,24,1]{3,2,1,0} iota(), iota_dimension=2, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=360}
  %constant.50 = f64[] constant(0.041666666666666664)
  %broadcast.65 = f64[1,1,24,1]{3,2,1,0} broadcast(%constant.50), dimensions={}
  %multiply.21 = f64[1,1,24,1]{3,2,1,0} multiply(%iota.1, %broadcast.65), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=360}
  %reshape.71 = f64[24]{0} reshape(%multiply.21), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=379}
  %broadcast.32 = f64[9,1,24,1]{3,2,1,0} broadcast(%reshape.71), dimensions={2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=379}
  %multiply.4 = f64[9,1,24,1]{3,2,1,0} multiply(%broadcast.30, %broadcast.32), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=379}
  %reshape.74 = f64[9,24]{1,0} reshape(%multiply.4), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %broadcast.34 = f64[9,24,24,1]{3,2,1,0} broadcast(%reshape.74), dimensions={0,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %add.4 = f64[9,24,24,1]{3,2,1,0} add(%broadcast.28, %broadcast.34), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %reshape.28 = f64[9,24,24]{2,1,0} reshape(%add.4), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %broadcast.36 = f64[9,24,24,80]{3,2,1,0} broadcast(%reshape.28), dimensions={0,1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %constant.62 = f64[] constant(0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=380}
  %broadcast.86 = f64[1,1,1,80]{3,2,1,0} broadcast(%constant.62), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=380}
  %iota.2 = f64[1,1,1,80]{3,2,1,0} iota(), iota_dimension=3, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=361}
  %constant.51 = f64[] constant(0.0125)
  %broadcast.69 = f64[1,1,1,80]{3,2,1,0} broadcast(%constant.51), dimensions={}
  %multiply.22 = f64[1,1,1,80]{3,2,1,0} multiply(%iota.2, %broadcast.69), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=361}
  %multiply.24 = f64[1,1,1,80]{3,2,1,0} multiply(%broadcast.86, %multiply.22), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=380}
  %reshape.135 = f64[80]{0} reshape(%multiply.24), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=380}
  %broadcast.42 = f64[9,24,24,80]{3,2,1,0} broadcast(%reshape.135), dimensions={3}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %add.5 = f64[9,24,24,80]{3,2,1,0} add(%broadcast.36, %broadcast.42), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=378}
  %convert.2 = c128[9,24,24,80]{3,2,1,0} convert(%add.5), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=377}
  %constant.29 = c128[] constant((0, 6.2831853071795862))
  %broadcast.43 = c128[9,24,24,80]{3,2,1,0} broadcast(%constant.29), dimensions={}
  %multiply.6 = c128[9,24,24,80]{3,2,1,0} multiply(%convert.2, %broadcast.43), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=377}
  %real.0 = f64[9,24,24,80]{3,2,1,0} real(%multiply.6), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %exponential.0 = f64[9,24,24,80]{3,2,1,0} exponential(%real.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %constant.30 = f64[] constant(inf)
  %broadcast.44 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.30), dimensions={}
  %compare.6 = pred[9,24,24,80]{3,2,1,0} compare(%exponential.0, %broadcast.44), direction=EQ, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %constant.31 = f64[] constant(0.5)
  %broadcast.45 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.31), dimensions={}
  %multiply.7 = f64[9,24,24,80]{3,2,1,0} multiply(%real.0, %broadcast.45), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %exponential.1 = f64[9,24,24,80]{3,2,1,0} exponential(%multiply.7), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %imag.0 = f64[9,24,24,80]{3,2,1,0} imag(%multiply.6), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %cosine.0 = f64[9,24,24,80]{3,2,1,0} cosine(%imag.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.8 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.1, %cosine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.9 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.8, %exponential.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.10 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.0, %cosine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %select.6 = f64[9,24,24,80]{3,2,1,0} select(%compare.6, %multiply.9, %multiply.10), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %constant.32 = f64[] constant(0)
  %broadcast.46 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.32), dimensions={}
  %compare.7 = pred[9,24,24,80]{3,2,1,0} compare(%imag.0, %broadcast.46), direction=EQ, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %sine.0 = f64[9,24,24,80]{3,2,1,0} sine(%imag.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.11 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.1, %sine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.12 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.11, %exponential.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %multiply.13 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.0, %sine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %select.7 = f64[9,24,24,80]{3,2,1,0} select(%compare.6, %multiply.12, %multiply.13), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %select.8 = f64[9,24,24,80]{3,2,1,0} select(%compare.7, %broadcast.46, %select.7), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %complex.0 = c128[9,24,24,80]{3,2,1,0} complex(%select.6, %select.8), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=376}
  %broadcast.48 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} broadcast(%complex.0), dimensions={0,3,4,5}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=383}
  %multiply.14 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} multiply(%custom-call.8, %broadcast.48), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=383}
  %constant.58 = c128[] constant((214.66252583997982, 0)), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=384}
  %broadcast.49 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} broadcast(%constant.58), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=384}
  %multiply.15 = c128[9,80,4,24,24,80]{5,4,3,2,1,0} multiply(%multiply.14, %broadcast.49), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=384}
  %reshape.35 = c128[9,80,4,46080]{3,2,1,0} reshape(%multiply.15), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/reshape" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=388}
  %custom-call.9 = c128[9,80,4,46080]{3,2,1,0} custom-call(%reshape.35), custom_call_target="Sharding", sharding={devices=[1,16,1,1]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=394}
  %custom-call.10 = c128[9,5,4,46080]{3,2,1,0} custom-call(%custom-call.9), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=394}
  %custom-call.13 = c128[9,5,4,46080]{3,2,1,0} custom-call(%custom-call.10), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=394}
  %custom-call.14 = c128[9,80,4,46080]{3,2,1,0} custom-call(%custom-call.13), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,16,1,1]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=394}
  %custom-call.15 = c128[9,80,4,46080]{3,2,1,0} custom-call(%custom-call.14), custom_call_target="Sharding", sharding={devices=[1,4,1,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_reshard_rchunk)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=429}
  %custom-call.16 = c128[9,80,4,46080]{3,2,1,0} custom-call(%custom-call.15), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[4,4]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/load_wfns.py" source_line=433}
  %Arg_4.5 = f64[80]{0} parameter(4), metadata={op_name="norms_l"}
  %convert.4 = c128[80]{0} convert(%Arg_4.5), metadata={op_name="jit(_kernel)/jit(main)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %broadcast.177 = c128[9,80,4,46080]{3,2,1,0} broadcast(%convert.4), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %divide.178 = c128[9,80,4,46080]{3,2,1,0} divide(%custom-call.16, %broadcast.177), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %custom-call.27 = c128[9,80,4,46080]{3,2,1,0} custom-call(%divide.178), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[4,4]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %dot.3 = c128[9,656,46080]{2,1,0} dot(%dot.2, %custom-call.27), lhs_batch_dims={1}, lhs_contracting_dims={0,3}, rhs_batch_dims={0}, rhs_contracting_dims={2,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmna,ab,knbv->kmv/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %add.8 = c128[9,656,46080]{2,1,0} add(%custom-call.24, %dot.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %custom-call.28 = c128[9,656,46080]{2,1,0} custom-call(%add.8), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %custom-call.29 = c128[9,656,46080]{2,1,0} custom-call(%custom-call.28), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=514}
  %reshape.38 = c128[3,3,1,656,46080]{4,3,2,1,0} reshape(%custom-call.29), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/reshape" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=403}
  %custom-call.30 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%reshape.38), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=402}
  %custom-call.31 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.30), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.32 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%custom-call.31), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %transpose.16 = c128[164,11520,3,3,1]{1,0,4,3,2} transpose(%custom-call.32), dimensions={3,4,0,1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %fft.9 = c128[164,11520,3,3,1]{4,3,2,1,0} fft(%transpose.16), fft_type=IFFT, fft_length={3,3,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/jit(fft)/fft" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %constant.36 = c128[3]{0} constant({(3, 0), (3, 0), (1, 0)})
  %custom-call.34 = c128[3]{0} custom-call(%constant.36), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.35 = c128[3]{0} custom-call(%custom-call.34), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %constant.37 = c128[] constant((1, 0))
  %reduce.3 = c128[] reduce(%custom-call.35, %constant.37), dimensions={0}, to_apply=%region_0.216, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %broadcast.50 = c128[164,11520,3,3,1]{4,3,2,1,0} broadcast(%reduce.3), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %multiply.16 = c128[164,11520,3,3,1]{4,3,2,1,0} multiply(%fft.9, %broadcast.50), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %transpose.17 = c128[3,3,1,164,11520]{2,1,0,4,3} transpose(%multiply.16), dimensions={2,3,4,0,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %custom-call.36 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%transpose.17), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.37 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.36), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %real.2 = f64[3,3,1,656,46080]{4,3,2,1,0} real(%custom-call.37), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=503}
  %imag.2 = f64[3,3,1,656,46080]{4,3,2,1,0} imag(%custom-call.37), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=503}
  %negate.2 = f64[3,3,1,656,46080]{4,3,2,1,0} negate(%imag.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/neg" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=503}
  %complex.2 = c128[3,3,1,656,46080]{4,3,2,1,0} complex(%real.2, %negate.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=503}
  %reshape.140 = c128[9,656,46080]{2,1,0} reshape(%complex.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=503}
  %custom-call.38 = c128[9,656,46080]{2,1,0} custom-call(%reshape.140), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=514}
  %custom-call.39 = c128[9,656,46080]{2,1,0} custom-call(%custom-call.38), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=515}
  %custom-call.19 = c128[9,656,46080]{2,1,0} custom-call(%broadcast.17), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=942}
  %custom-call.17 = c128[9,656,46080]{2,1,0} custom-call(%custom-call.19), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %constant.63 = c128[4,4]{1,0} constant({...})
  %custom-call.20 = c128[4,4]{1,0} custom-call(%constant.63), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %Arg_2.3 = c128[9,656,80,4]{3,2,1,0} parameter(2), sharding={devices=[1,4,1,1,4]<=[16] last_tile_dim_replicate}, metadata={op_name="psi_r_rmuT_X_fit"}
  %custom-call.21 = c128[9,656,80,4]{3,2,1,0} custom-call(%Arg_2.3), custom_call_target="Sharding", sharding={devices=[1,4,1,1,4]<=[16] last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %dot.0 = c128[4,9,656,80]{3,2,1,0} dot(%custom-call.20, %custom-call.21), lhs_contracting_dims={0}, rhs_contracting_dims={3}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmna,ab,knbv->kmv/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %Arg_5.6 = f64[80]{0} parameter(5), metadata={op_name="norms_r"}
  %convert.5 = c128[80]{0} convert(%Arg_5.6), metadata={op_name="jit(_kernel)/jit(main)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %broadcast.197 = c128[9,80,4,46080]{3,2,1,0} broadcast(%convert.5), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %divide.198 = c128[9,80,4,46080]{3,2,1,0} divide(%custom-call.16, %broadcast.197), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=973}
  %custom-call.22 = c128[9,80,4,46080]{3,2,1,0} custom-call(%divide.198), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[4,4]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %dot.1 = c128[9,656,46080]{2,1,0} dot(%dot.0, %custom-call.22), lhs_batch_dims={1}, lhs_contracting_dims={0,3}, rhs_batch_dims={0}, rhs_contracting_dims={2,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmna,ab,knbv->kmv/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %add.7 = c128[9,656,46080]{2,1,0} add(%custom-call.17, %dot.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=234}
  %custom-call.23 = c128[9,656,46080]{2,1,0} custom-call(%add.7), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=237}
  %custom-call.42 = c128[9,656,46080]{2,1,0} custom-call(%custom-call.23), custom_call_target="Sharding", sharding={devices=[1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=515}
  %reshape.40 = c128[3,3,1,656,46080]{4,3,2,1,0} reshape(%custom-call.42), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=403}
  %custom-call.43 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%reshape.40), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=402}
  %custom-call.44 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.43), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.45 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%custom-call.44), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %transpose.18 = c128[164,11520,3,3,1]{1,0,4,3,2} transpose(%custom-call.45), dimensions={3,4,0,1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %fft.10 = c128[164,11520,3,3,1]{4,3,2,1,0} fft(%transpose.18), fft_type=IFFT, fft_length={3,3,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/jit(fft)/fft" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %constant.65 = c128[3]{0} constant({(3, 0), (3, 0), (1, 0)})
  %custom-call.46 = c128[3]{0} custom-call(%constant.65), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.47 = c128[3]{0} custom-call(%custom-call.46), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %constant.39 = c128[] constant((1, 0))
  %reduce.4 = c128[] reduce(%custom-call.47, %constant.39), dimensions={0}, to_apply=%region_1.253, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %broadcast.51 = c128[164,11520,3,3,1]{4,3,2,1,0} broadcast(%reduce.4), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %multiply.17 = c128[164,11520,3,3,1]{4,3,2,1,0} multiply(%fft.10, %broadcast.51), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %transpose.19 = c128[3,3,1,164,11520]{2,1,0,4,3} transpose(%multiply.17), dimensions={2,3,4,0,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=325}
  %custom-call.48 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%transpose.19), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.49 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.48), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %reshape.41 = c128[9,656,46080]{2,1,0} reshape(%custom-call.49), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %multiply.18 = c128[9,656,46080]{2,1,0} multiply(%custom-call.39, %reshape.41), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/isdf_fitting.py" source_line=510}
  %reshape.42 = c128[3,3,1,656,46080]{4,3,2,1,0} reshape(%multiply.18), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=403}
  %custom-call.50 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%reshape.42), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/sharding_constraint" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=402}
  %custom-call.51 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.50), custom_call_target="Sharding", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.52 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%custom-call.51), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %transpose.20 = c128[164,11520,3,3,1]{1,0,4,3,2} transpose(%custom-call.52), dimensions={3,4,0,1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %fft.11 = c128[164,11520,3,3,1]{4,3,2,1,0} fft(%transpose.20), fft_type=FFT, fft_length={3,3,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/jit(fft)/fft" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %constant.68 = c128[] constant((1, 0))
  %constant.66 = c128[3]{0} constant({(3, 0), (3, 0), (1, 0)})
  %custom-call.53 = c128[3]{0} custom-call(%constant.66), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.54 = c128[3]{0} custom-call(%custom-call.53), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %constant.67 = c128[] constant((1, 0))
  %reduce.5 = c128[] reduce(%custom-call.54, %constant.67), dimensions={0}, to_apply=%region_2.270, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/reduce_prod" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %divide.3 = c128[] divide(%constant.68, %reduce.5), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %broadcast.52 = c128[164,11520,3,3,1]{4,3,2,1,0} broadcast(%divide.3), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %multiply.19 = c128[164,11520,3,3,1]{4,3,2,1,0} multiply(%fft.11, %broadcast.52), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %transpose.21 = c128[3,3,1,164,11520]{2,1,0,4,3} transpose(%multiply.19), dimensions={2,3,4,0,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/jit(shmap_body)/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=343}
  %custom-call.55 = c128[3,3,1,164,11520]{4,3,2,1,0} custom-call(%transpose.21), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
  %custom-call.56 = c128[3,3,1,656,46080]{4,3,2,1,0} custom-call(%custom-call.55), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,1,1,4,4]<=[16]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/shard_map" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/fft_helpers.py" source_line=404}
