HloModule jit_subtract, entry_computation_layout={(f64[1917]{0}, c128[1917]{0})->c128[1917]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.5 (Arg_0.1: f64[1917], Arg_1.2: c128[1917]) -> c128[1917] {
  %Arg_0.1 = f64[1917]{0} parameter(0), metadata={op_name="x"}
  %convert.3 = c128[1917]{0} convert(%Arg_0.1), metadata={op_name="jit(subtract)/jit(main)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/bispinor_init.py" source_line=35}
  %Arg_1.2 = c128[1917]{0} parameter(1), metadata={op_name="y"}
  ROOT %subtract.4 = c128[1917]{0} subtract(%convert.3, %Arg_1.2), metadata={op_name="jit(subtract)/jit(main)/sub" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/bispinor_init.py" source_line=35}
}

