HloModule jit__full_run, entry_computation_layout={(c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, f64[64,4]{1,0}, /*index=5*/f64[64,4]{1,0}, c128[480,480,4,4,4]{4,3,2,1,0}, c128[480,480]{1,0})->(f64[5]{0}, c128[5,1024]{1,0}, s32[])}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false}, num_partitions=4

%region_1.1270 (Arg_0.1271: f64[], Arg_1.1272: f64[]) -> f64[] {
  %Arg_0.1271 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  %Arg_1.1272 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  ROOT %add.1273 = f64[] add(%Arg_0.1271, %Arg_1.1272), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=249}
}

%region_0.36 (Arg_0.37: c128[], Arg_1.38: c128[]) -> c128[] {
  %Arg_0.37 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(shmap_body)/reduce_prod"}
  %Arg_1.38 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(shmap_body)/reduce_prod"}
  ROOT %multiply.39 = c128[] multiply(%Arg_0.37, %Arg_1.38), metadata={op_name="jit(_full_run)/jit(main)/jit(shmap_body)/reduce_prod" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=412}
}

%region_11.1700 (Arg_0.1701: f64[], Arg_1.1702: f64[], Arg_2.1703: s64[], Arg_3.1704: s64[]) -> pred[] {
  %Arg_2.1703 = s64[] parameter(2), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %Arg_3.1704 = s64[] parameter(3), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %constant.1705 = f64[] constant(nan)
  %constant.1706 = f64[] constant(0)
  %Arg_0.1701 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %compare.1709 = pred[] compare(%Arg_0.1701, %Arg_0.1701), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.910 = f64[] constant(nan)
  %constant.912 = f64[] constant(0)
  %compare.1707 = pred[] compare(%Arg_0.1701, %constant.912), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.913 = f64[] constant(0)
  %select.1708 = f64[] select(%compare.1707, %constant.913, %Arg_0.1701), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %select.1710 = f64[] select(%compare.1709, %constant.910, %select.1708), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %Arg_1.1702 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %compare.1713 = pred[] compare(%Arg_1.1702, %Arg_1.1702), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.911 = f64[] constant(nan)
  %constant.914 = f64[] constant(0)
  %compare.1711 = pred[] compare(%Arg_1.1702, %constant.914), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.915 = f64[] constant(0)
  %select.1712 = f64[] select(%compare.1711, %constant.915, %Arg_1.1702), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %select.1714 = f64[] select(%compare.1713, %constant.911, %select.1712), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  ROOT %compare.1715 = pred[] compare(%select.1710, %select.1714), direction=LT, type=TOTALORDER, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/lt_to" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
}

%region_12.1739 (Arg_0.1740: f64[], Arg_1.1741: f64[]) -> f64[] {
  %Arg_0.1740 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  %Arg_1.1741 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  ROOT %add.1742 = f64[] add(%Arg_0.1740, %Arg_1.1741), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=297}
}

%and.reduce_sub_computation.3 (lhs.3: pred[], rhs.3: pred[]) -> pred[] {
  %lhs.3 = pred[] parameter(0)
  %rhs.3 = pred[] parameter(1)
  ROOT %and.8 = pred[] and(%lhs.3, %rhs.3)
}

%scalar_add_computation (scalar_lhs: c128[], scalar_rhs: c128[]) -> c128[] {
  %scalar_lhs = c128[] parameter(0)
  %scalar_rhs = c128[] parameter(1)
  ROOT %add.566 = c128[] add(%scalar_lhs, %scalar_rhs)
}

%region_5.1407 (arg_tuple.1408: (s64[], c128[1024], s64[], s64[], c128[1024,200])) -> (s64[], c128[1024], s64[], s64[], c128[1024,200]) {
  %constant.1416 = s64[] constant(0)
  %arg_tuple.1408 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) parameter(0)
  %get-tuple-element.1409 = s64[] get-tuple-element(%arg_tuple.1408), index=0
  %constant.1417 = s64[] constant(1)
  %add.1418 = s64[] add(%get-tuple-element.1409, %constant.1417), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275}
  %get-tuple-element.1410 = c128[1024]{0} get-tuple-element(%arg_tuple.1408), index=1
  %get-tuple-element.1412 = s64[] get-tuple-element(%arg_tuple.1408), index=3
  %compare.1419 = pred[] compare(%get-tuple-element.1409, %get-tuple-element.1412), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=269}
  %get-tuple-element.1413 = c128[1024,200]{1,0} get-tuple-element(%arg_tuple.1408), index=4
  %constant.909 = s64[] constant(0)
  %constant.908 = s64[] constant(0)
  %compare.1420 = pred[] compare(%get-tuple-element.1409, %constant.908), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %constant.1415 = s64[] constant(200)
  %add.1421 = s64[] add(%get-tuple-element.1409, %constant.1415), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %select.1422 = s64[] select(%compare.1420, %add.1421, %get-tuple-element.1409), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %dynamic-slice.1423 = c128[1024,1]{1,0} dynamic-slice(%get-tuple-element.1413, %constant.909, %select.1422), dynamic_slice_sizes={1024,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %real.39 = f64[1024,1]{1,0} real(%dynamic-slice.1423), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %imag.30 = f64[1024,1]{1,0} imag(%dynamic-slice.1423), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %negate.52 = f64[1024,1]{1,0} negate(%imag.30), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %complex.37 = c128[1024,1]{1,0} complex(%real.39, %negate.52), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %reshape.446 = c128[1024]{0} reshape(%complex.37), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %multiply.153 = c128[1024]{0} multiply(%reshape.446, %get-tuple-element.1410)
  %constant.551 = c128[] constant((0, 0))
  %reduce.5 = c128[] reduce(%multiply.153, %constant.551), dimensions={0}, to_apply=%scalar_add_computation, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %constant.1414 = c128[] constant((0, 0))
  %select.94 = c128[] select(%compare.1419, %reduce.5, %constant.1414), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %broadcast.952 = c128[1024,1]{1,0} broadcast(%select.94), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %multiply.180 = c128[1024,1]{1,0} multiply(%broadcast.952, %dynamic-slice.1423), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %reshape.323 = c128[1024]{0} reshape(%multiply.180), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %subtract.1433 = c128[1024]{0} subtract(%get-tuple-element.1410, %reshape.323), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %get-tuple-element.1411 = s64[] get-tuple-element(%arg_tuple.1408), index=2
  ROOT %tuple.1434 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) tuple(%add.1418, %subtract.1433, %get-tuple-element.1411, %get-tuple-element.1412, %get-tuple-element.1413)
}

%region_6.1435 (arg_tuple.1436: (s64[], c128[1024], s64[], s64[], c128[1024,200])) -> pred[] {
  %arg_tuple.1436 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) parameter(0)
  %get-tuple-element.1437 = s64[] get-tuple-element(%arg_tuple.1436), index=0
  %get-tuple-element.1439 = s64[] get-tuple-element(%arg_tuple.1436), index=2
  ROOT %compare.1442 = pred[] compare(%get-tuple-element.1437, %get-tuple-element.1439), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275}
}

%region_7.1443 (Arg_0.1444: f64[], Arg_1.1445: f64[]) -> f64[] {
  %Arg_0.1444 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum"}
  %Arg_1.1445 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum"}
  ROOT %add.1446 = f64[] add(%Arg_0.1444, %Arg_1.1445), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=277}
}

%and.reduce_sub_computation (lhs: pred[], rhs: pred[]) -> pred[] {
  %lhs = pred[] parameter(0)
  %rhs = pred[] parameter(1)
  ROOT %and.2 = pred[] and(%lhs, %rhs)
}

%scalar_add_computation.1 (scalar_lhs.1: c128[], scalar_rhs.1: c128[]) -> c128[] {
  %scalar_lhs.1 = c128[] parameter(0)
  %scalar_rhs.1 = c128[] parameter(1)
  ROOT %add.618 = c128[] add(%scalar_lhs.1, %scalar_rhs.1)
}

%region_3.1552.clone.clone.clone (arg_tuple.4: (s64[], c128[1024,200], f64[200], f64[200], c128[1024], /*index=5*/c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], f64[64,4], /*index=10*/f64[64,4], c128[480,480,4,4,4], c128[480,480])) -> (s64[], c128[1024,200], f64[200], f64[200], c128[1024], /*index=5*/c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], f64[64,4], /*index=10*/f64[64,4], c128[480,480,4,4,4], c128[480,480]) {
  %arg_tuple.4 = (s64[], c128[1024,200]{1,0}, f64[200]{0}, f64[200]{0}, c128[1024]{0}, /*index=5*/c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, f64[64,4]{1,0}, /*index=10*/f64[64,4]{1,0}, c128[480,480,4,4,4]{4,3,2,1,0}, c128[480,480]{1,0}) parameter(0)
  %get-tuple-element.244 = s64[] get-tuple-element(%arg_tuple.4), index=0
  %constant.880 = s64[] constant(1)
  %add.627 = s64[] add(%get-tuple-element.244, %constant.880), metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=286}
  %get-tuple-element.242 = c128[1024,200]{1,0} get-tuple-element(%arg_tuple.4), index=1
  %constant.889 = s32[] constant(0)
  %broadcast.997 = s32[2]{0} broadcast(%constant.889), dimensions={}
  %constant.890 = s32[1]{0} constant({0})
  %get-tuple-element.243 = s64[] get-tuple-element(%arg_tuple.4), index=0
  %constant.946 = s64[] constant(1)
  %add.630 = s64[] add(%get-tuple-element.243, %constant.946), metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.885 = s64[] constant(199)
  %minimum.5 = s64[] minimum(%add.630, %constant.885), metadata={op_name="jit(_full_run)/jit(main)/while/body/min" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.954 = s64[] constant(0)
  %compare.96 = pred[] compare(%minimum.5, %constant.954), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.958 = s64[] constant(200)
  %add.631 = s64[] add(%minimum.5, %constant.958), metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %select.259 = s64[] select(%compare.96, %add.631, %minimum.5), metadata={op_name="jit(_full_run)/jit(main)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %convert.63 = s32[] convert(%select.259), metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %reshape.421 = s32[1]{0} reshape(%convert.63), metadata={op_name="jit(_full_run)/jit(main)/while/body/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %concatenate.15 = s32[2]{0} concatenate(%constant.890, %reshape.421), dimensions={0}
  %compare.99 = pred[2]{0} compare(%broadcast.997, %concatenate.15), direction=LE
  %iota.20 = s32[2]{0} iota(), iota_dimension=0
  %constant.894 = s32[] constant(199)
  %broadcast.1005 = s32[2]{0} broadcast(%constant.894), dimensions={}
  %multiply.199 = s32[2]{0} multiply(%iota.20, %broadcast.1005)
  %compare.100 = pred[2]{0} compare(%multiply.199, %concatenate.15), direction=GE
  %and.20 = pred[2]{0} and(%compare.99, %compare.100)
  %constant.891 = pred[] constant(true)
  %reduce.29 = pred[] reduce(%and.20, %constant.891), dimensions={0}, to_apply=%and.reduce_sub_computation
  %broadcast.998 = pred[1024,1]{1,0} broadcast(%reduce.29), dimensions={}
  %constant.897 = s64[] constant(-10)
  %add.634 = s64[] add(%get-tuple-element.243, %constant.897), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=274}
  %constant.948 = s64[] constant(0)
  %maximum.18 = s64[] maximum(%add.634, %constant.948), metadata={op_name="jit(_full_run)/jit(main)/while/body/max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=274}
  %get-tuple-element.234 = f64[64,4]{1,0} get-tuple-element(%arg_tuple.4), index=9
  %custom-call.88 = f64[64,4]{1,0} custom-call(%get-tuple-element.234), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %transpose.68 = f64[4,64]{0,1} transpose(%custom-call.88), dimensions={1,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=105}
  %broadcast.999 = f64[1,4,4,64]{3,2,1,0} broadcast(%transpose.68), dimensions={1,3}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=105}
  %get-tuple-element.233 = f64[64,4]{1,0} get-tuple-element(%arg_tuple.4), index=10
  %custom-call.89 = f64[64,4]{1,0} custom-call(%get-tuple-element.233), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %transpose.69 = f64[4,64]{0,1} transpose(%custom-call.89), dimensions={1,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=105}
  %broadcast.1000 = f64[1,4,4,64]{3,2,1,0} broadcast(%transpose.69), dimensions={2,3}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=105}
  %subtract.37 = f64[1,4,4,64]{3,2,1,0} subtract(%broadcast.999, %broadcast.1000), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=105}
  %convert.60 = c128[1,4,4,64]{3,2,1,0} convert(%subtract.37), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=106}
  %get-tuple-element.239 = c128[1024]{0} get-tuple-element(%arg_tuple.4), index=4
  %reshape.416 = c128[1,4,4,64]{3,2,1,0} reshape(%get-tuple-element.239), metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=202}
  %custom-call.90 = c128[1,4,4,64]{3,2,1,0} custom-call(%reshape.416), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=203}
  %custom-call.91 = c128[1,4,4,64]{3,2,1,0} custom-call(%custom-call.90), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %multiply.191 = c128[1,4,4,64]{3,2,1,0} multiply(%convert.60, %custom-call.91), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=106}
  %custom-call.92 = c128[1,4,4,64]{3,2,1,0} custom-call(%multiply.191), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=107}
  %reshape.422 = c128[4,4,64]{2,1,0} reshape(%custom-call.91)
  %transpose.78 = c128[64,4,4]{0,2,1} transpose(%reshape.422), dimensions={2,0,1}
  %broadcast.1001 = c128[64,480,4,4]{2,3,1,0} broadcast(%transpose.78), dimensions={0,2,3}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvN,bcvk->bNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=124}
  %get-tuple-element.235 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.4), index=8
  %custom-call.93 = c128[64,4,2,480]{3,2,1,0} custom-call(%get-tuple-element.235), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %get-tuple-element.237 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.4), index=6
  %custom-call.94 = c128[64,4,2,480]{3,2,1,0} custom-call(%get-tuple-element.237), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %real.41 = f64[64,4,2,480]{3,2,1,0} real(%custom-call.94), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=114}
  %imag.32 = f64[64,4,2,480]{3,2,1,0} imag(%custom-call.94), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=114}
  %negate.54 = f64[64,4,2,480]{3,2,1,0} negate(%imag.32), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=114}
  %complex.30 = c128[64,4,2,480]{3,2,1,0} complex(%real.41, %negate.54), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=114}
  %dot.45 = c128[64,480,4,4]{3,2,1,0} dot(%custom-call.93, %complex.30), lhs_batch_dims={0,3}, lhs_contracting_dims={2}, rhs_batch_dims={0,3}, rhs_contracting_dims={2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcsN,kvsN->kcvN/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=112}
  %transpose.80 = c128[64,480,4,4]{2,3,1,0} transpose(%dot.45), dimensions={0,1,3,2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcsN,kvsN->kcvN/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=112}
  %multiply.197 = c128[64,480,4,4]{2,3,1,0} multiply(%broadcast.1001, %transpose.80)
  %constant.892 = c128[] constant((0, 0))
  %reduce.30 = c128[64,480]{1,0} reduce(%multiply.197, %constant.892), dimensions={2,3}, to_apply=%scalar_add_computation.1, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvN,bcvk->bNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=124}
  %reshape.423 = c128[64,1,480]{2,1,0} reshape(%reduce.30), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvN,bcvk->bNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=124}
  %transpose.70 = c128[1,480,64]{1,0,2} transpose(%reshape.423), dimensions={1,2,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvN,bcvk->bNk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=124}
  %custom-call.95 = c128[1,480,64]{2,1,0} custom-call(%transpose.70), custom_call_target="Sharding", sharding={devices=[1,2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=128}
  %constant.900 = c128[] constant((0.125, 0)), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=129}
  %broadcast.1006 = c128[1,480,64]{2,1,0} broadcast(%constant.900), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=129}
  %multiply.200 = c128[1,480,64]{2,1,0} multiply(%custom-call.95, %broadcast.1006), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=129}
  %reshape.424 = c128[480,64]{1,0} reshape(%multiply.200)
  %get-tuple-element.231 = c128[480,480]{1,0} get-tuple-element(%arg_tuple.4), index=12
  %custom-call.96 = c128[480,480]{1,0} custom-call(%get-tuple-element.231), custom_call_target="Sharding", sharding={devices=[2,2]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %dot.47 = c128[64,480]{1,0} dot(%reshape.424, %custom-call.96), lhs_contracting_dims={0}, rhs_contracting_dims={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/MN,bNk->bMk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=134}
  %reshape.425 = c128[1,64,480]{2,1,0} reshape(%dot.47), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/MN,bNk->bMk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=134}
  %transpose.71 = c128[1,480,64]{1,2,0} transpose(%reshape.425), dimensions={0,2,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/MN,bNk->bMk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=134}
  %custom-call.97 = c128[1,480,64]{2,1,0} custom-call(%transpose.71), custom_call_target="Sharding", sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=138}
  %reshape.426 = c128[480,64]{1,0} reshape(%custom-call.97)
  %transpose.79 = c128[64,480]{0,1} transpose(%reshape.426), dimensions={1,0}
  %broadcast.1013 = c128[64,480,4,4]{3,2,1,0} broadcast(%transpose.79), dimensions={0,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvM,bMk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=149}
  %get-tuple-element.236 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.4), index=7
  %custom-call.98 = c128[64,4,2,480]{3,2,1,0} custom-call(%get-tuple-element.236), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %get-tuple-element.238 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.4), index=5
  %custom-call.99 = c128[64,4,2,480]{3,2,1,0} custom-call(%get-tuple-element.238), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %real.42 = f64[64,4,2,480]{3,2,1,0} real(%custom-call.99), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=143}
  %imag.33 = f64[64,4,2,480]{3,2,1,0} imag(%custom-call.99), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=143}
  %negate.55 = f64[64,4,2,480]{3,2,1,0} negate(%imag.33), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=143}
  %complex.31 = c128[64,4,2,480]{3,2,1,0} complex(%real.42, %negate.55), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=143}
  %dot.46 = c128[64,480,4,4]{3,2,1,0} dot(%custom-call.98, %complex.31), lhs_batch_dims={0,3}, lhs_contracting_dims={2}, rhs_batch_dims={0,3}, rhs_contracting_dims={2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcsM,kvsM->kcvM/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=141}
  %real.49 = f64[64,480,4,4]{3,2,1,0} real(%dot.46), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=151}
  %imag.38 = f64[64,480,4,4]{3,2,1,0} imag(%dot.46), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=151}
  %negate.60 = f64[64,480,4,4]{3,2,1,0} negate(%imag.38), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=151}
  %complex.38 = c128[64,480,4,4]{3,2,1,0} complex(%real.49, %negate.60), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=151}
  %multiply.203 = c128[64,480,4,4]{3,2,1,0} multiply(%broadcast.1013, %complex.38)
  %constant.893 = c128[] constant((0, 0))
  %reduce.32 = c128[64,4,4]{2,1,0} reduce(%multiply.203, %constant.893), dimensions={1}, to_apply=%scalar_add_computation.1, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvM,bMk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=149}
  %transpose.91 = c128[64,4,4]{1,2,0} transpose(%reduce.32), dimensions={0,2,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvM,bMk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=149}
  %reshape.427 = c128[64,1,4,4]{3,2,1,0} reshape(%transpose.91), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvM,bMk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=149}
  %transpose.72 = c128[1,4,4,64]{2,1,0,3} transpose(%reshape.427), dimensions={1,2,3,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kcvM,bMk->bcvk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=149}
  %custom-call.100 = c128[1,4,4,64]{3,2,1,0} custom-call(%transpose.72), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=153}
  %constant.901 = c128[] constant((0.125, 0)), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=154}
  %broadcast.1007 = c128[1,4,4,64]{3,2,1,0} broadcast(%constant.901), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=154}
  %multiply.201 = c128[1,4,4,64]{3,2,1,0} multiply(%custom-call.100, %broadcast.1007), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=154}
  %add.628 = c128[1,4,4,64]{3,2,1,0} add(%custom-call.92, %multiply.201), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=198}
  %get-tuple-element.232 = c128[480,480,4,4,4]{4,3,2,1,0} get-tuple-element(%arg_tuple.4), index=11
  %custom-call.101 = c128[480,480,4,4,4]{4,3,2,1,0} custom-call(%get-tuple-element.232), custom_call_target="Sharding", sharding={devices=[2,2,1,1,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %broadcast.1003 = c128[1,480,480,2,2,4,4,4]{7,6,5,4,3,2,1,0} broadcast(%custom-call.101), dimensions={1,2,5,6,7}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=177}
  %reshape.428 = c128[4,4,64]{2,1,0} reshape(%custom-call.91)
  %dot.48 = c128[64,4,2,480]{3,2,1,0} dot(%reshape.428, %custom-call.99), lhs_batch_dims={2}, lhs_contracting_dims={0}, rhs_batch_dims={0}, rhs_contracting_dims={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %reshape.429 = c128[64,1,4,2,480]{4,3,2,1,0} reshape(%dot.48), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %transpose.73 = c128[1,4,64,2,480]{4,3,1,0,2} transpose(%reshape.429), dimensions={1,2,0,3,4}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %reshape.430 = c128[4,64,2,480]{3,2,0,1} reshape(%transpose.73)
  %real.43 = f64[64,4,2,480]{3,2,1,0} real(%custom-call.93), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=166}
  %imag.34 = f64[64,4,2,480]{3,2,1,0} imag(%custom-call.93), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=166}
  %negate.56 = f64[64,4,2,480]{3,2,1,0} negate(%imag.34), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=166}
  %complex.33 = c128[64,4,2,480]{3,2,1,0} complex(%real.43, %negate.56), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=166}
  %dot.49 = c128[64,2,480,2,480]{4,3,2,1,0} dot(%reshape.430, %complex.33), lhs_batch_dims={1}, lhs_contracting_dims={0}, rhs_batch_dims={0}, rhs_contracting_dims={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %reshape.431 = c128[64,1,2,480,2,480]{5,4,3,2,1,0} reshape(%dot.49), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %transpose.74 = c128[1,480,480,2,2,64]{2,4,1,3,0,5} transpose(%reshape.431), dimensions={1,3,5,2,4,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,kvsN,bcvk->bMNtsk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=164}
  %custom-call.102 = c128[1,480,480,2,2,64]{5,4,3,2,1,0} custom-call(%transpose.74), custom_call_target="Sharding", sharding={devices=[1,2,2,1,1,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=168}
  %reshape.417 = c128[1,480,480,2,2,4,4,4]{7,6,5,4,3,2,1,0} reshape(%custom-call.102), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=171}
  %custom-call.103 = c128[1,480,480,2,2,4,4,4]{7,6,5,4,3,2,1,0} custom-call(%reshape.417), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=173}, backend_config="139717505528800"
  %multiply.192 = c128[1,480,480,2,2,4,4,4]{7,6,5,4,3,2,1,0} multiply(%broadcast.1003, %custom-call.103), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=177}
  %custom-call.104 = c128[1,480,480,2,2,4,4,4]{7,6,5,4,3,2,1,0} custom-call(%multiply.192), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=178}, backend_config="139717505461200"
  %reshape.418 = c128[1,480,480,2,2,64]{5,4,3,2,1,0} reshape(%custom-call.104), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=179}
  %custom-call.105 = c128[1,480,480,2,2,64]{5,4,3,2,1,0} custom-call(%reshape.418), custom_call_target="Sharding", sharding={devices=[1,2,2,1,1,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=181}
  %reshape.432 = c128[480,480,2,2,64]{4,3,2,1,0} reshape(%custom-call.105)
  %real.44 = f64[64,4,2,480]{3,2,1,0} real(%custom-call.99), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=186}
  %imag.35 = f64[64,4,2,480]{3,2,1,0} imag(%custom-call.99), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=186}
  %negate.57 = f64[64,4,2,480]{3,2,1,0} negate(%imag.35), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=186}
  %complex.34 = c128[64,4,2,480]{3,2,1,0} complex(%real.44, %negate.57), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=186}
  %dot.50 = c128[64,480,2,4]{3,2,1,0} dot(%reshape.432, %complex.34), lhs_batch_dims={4}, lhs_contracting_dims={0,2}, rhs_batch_dims={0}, rhs_contracting_dims={3,2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,bMNtsk->bcNsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=184}
  %reshape.433 = c128[64,1,480,2,4]{4,3,2,1,0} reshape(%dot.50), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,bMNtsk->bcNsk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=184}
  %transpose.75 = c128[1,4,480,2,64]{1,3,2,0,4} transpose(%reshape.433), dimensions={1,4,2,3,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kctM,bMNtsk->bcNsk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=184}
  %custom-call.106 = c128[1,4,480,2,64]{4,3,2,1,0} custom-call(%transpose.75), custom_call_target="Sharding", sharding={devices=[1,2,2,1,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=188}
  %reshape.434 = c128[4,480,2,64]{3,2,1,0} reshape(%custom-call.106)
  %dot.51 = c128[64,4,4]{2,1,0} dot(%reshape.434, %custom-call.93), lhs_batch_dims={3}, lhs_contracting_dims={1,2}, rhs_batch_dims={0}, rhs_contracting_dims={3,2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kvsN,bcNsk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=191}
  %reshape.435 = c128[64,1,4,4]{3,2,1,0} reshape(%dot.51), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kvsN,bcNsk->bcvk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=191}
  %transpose.76 = c128[1,4,4,64]{2,1,0,3} transpose(%reshape.435), dimensions={1,2,3,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/kvsN,bcNsk->bcvk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=191}
  %custom-call.107 = c128[1,4,4,64]{3,2,1,0} custom-call(%transpose.76), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=195}
  %constant.902 = c128[] constant((0.125, 0)), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=196}
  %broadcast.1009 = c128[1,4,4,64]{3,2,1,0} broadcast(%constant.902), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=196}
  %multiply.202 = c128[1,4,4,64]{3,2,1,0} multiply(%custom-call.107, %broadcast.1009), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=196}
  %subtract.38 = c128[1,4,4,64]{3,2,1,0} subtract(%add.628, %multiply.202), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_simple.py" source_line=198}
  %custom-call.108 = c128[1,4,4,64]{3,2,1,0} custom-call(%subtract.38), custom_call_target="Sharding", sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=204}
  %reshape.419 = c128[1024]{0} reshape(%custom-call.108), metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=208}
  %real.45 = f64[1024]{0} real(%get-tuple-element.239), metadata={op_name="jit(_full_run)/jit(main)/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %imag.36 = f64[1024]{0} imag(%get-tuple-element.239), metadata={op_name="jit(_full_run)/jit(main)/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %negate.58 = f64[1024]{0} negate(%imag.36), metadata={op_name="jit(_full_run)/jit(main)/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %complex.35 = c128[1024]{0} complex(%real.45, %negate.58), metadata={op_name="jit(_full_run)/jit(main)/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %multiply.195 = c128[1024]{0} multiply(%complex.35, %reshape.419)
  %constant.888 = c128[] constant((0, 0))
  %reduce.28 = c128[] reduce(%multiply.195, %constant.888), dimensions={0}, to_apply=%scalar_add_computation, metadata={op_name="jit(_full_run)/jit(main)/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %real.46 = f64[] real(%reduce.28), metadata={op_name="jit(_full_run)/jit(main)/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260}
  %convert.61 = c128[] convert(%real.46), metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263}
  %broadcast.995 = c128[1024]{0} broadcast(%convert.61), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263}
  %multiply.193 = c128[1024]{0} multiply(%broadcast.995, %get-tuple-element.239), metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263}
  %subtract.39 = c128[1024]{0} subtract(%reshape.419, %multiply.193), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263}
  %constant.949 = s64[] constant(0)
  %compare.93 = pred[] compare(%get-tuple-element.243, %constant.949), direction=GT, metadata={op_name="jit(_full_run)/jit(main)/while/body/gt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %get-tuple-element.240 = f64[200]{0} get-tuple-element(%arg_tuple.4), index=3
  %constant.898 = s64[] constant(-1)
  %add.635 = s64[] add(%get-tuple-element.243, %constant.898), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %constant.950 = s64[] constant(0)
  %compare.94 = pred[] compare(%add.635, %constant.950), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %constant.903 = s64[] constant(199)
  %add.637 = s64[] add(%get-tuple-element.243, %constant.903), metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %select.257 = s64[] select(%compare.94, %add.637, %add.635), metadata={op_name="jit(_full_run)/jit(main)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %dynamic-slice.50 = f64[1]{0} dynamic-slice(%get-tuple-element.240, %select.257), dynamic_slice_sizes={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %reshape.420 = f64[] reshape(%dynamic-slice.50), metadata={op_name="jit(_full_run)/jit(main)/while/body/squeeze" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %constant.884 = f64[] constant(0)
  %select.258 = f64[] select(%compare.93, %reshape.420, %constant.884), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265}
  %convert.62 = c128[] convert(%select.258), metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266}
  %broadcast.1004 = c128[1024,1]{1,0} broadcast(%convert.62), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266}
  %constant.953 = s64[] constant(0)
  %constant.899 = s64[] constant(-1)
  %add.636 = s64[] add(%get-tuple-element.243, %constant.899), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=264}
  %constant.951 = s64[] constant(0)
  %maximum.19 = s64[] maximum(%add.636, %constant.951), metadata={op_name="jit(_full_run)/jit(main)/while/body/max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=264}
  %dynamic-slice.51 = c128[1024,1]{1,0} dynamic-slice(%get-tuple-element.242, %constant.953, %maximum.19), dynamic_slice_sizes={1024,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=264}
  %multiply.196 = c128[1024,1]{1,0} multiply(%broadcast.1004, %dynamic-slice.51), metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266}
  %reshape.436 = c128[1024]{0} reshape(%multiply.196), metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266}
  %subtract.40 = c128[1024]{0} subtract(%subtract.39, %reshape.436), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266}
  %constant.947 = s64[] constant(1)
