HloModule jit_pbc_distance_sq_batch, entry_computation_layout={(f32[46656,3]{1,0}, f32[400,3]{1,0}, f32[3,3]{1,0})->f32[46656,400]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true,true}, allow_spmd_sharding_propagation_to_output={true}

%round.13 (Arg_0.14: f32[46656,400,3]) -> f32[46656,400,3] {
  %Arg_0.14 = f32[46656,400,3]{2,1,0} parameter(0), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/pjit"}
  ROOT %round-nearest-even.15 = f32[46656,400,3]{2,1,0} round-nearest-even(%Arg_0.14), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/jit(round)/round" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=127}
}

ENTRY %main.20 (Arg_0.1: f32[46656,3], Arg_1.2: f32[400,3], Arg_2.3: f32[3,3]) -> f32[46656,400] {
  %Arg_0.1 = f32[46656,3]{1,0} parameter(0), metadata={op_name="positions_frac"}
  %reshape.4 = f32[46656,1,3]{2,1,0} reshape(%Arg_0.1), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %broadcast.6 = f32[46656,1,3]{2,1,0} broadcast(%reshape.4), dimensions={0,1,2}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %reshape.7 = f32[46656,3]{1,0} reshape(%broadcast.6), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %broadcast.8 = f32[46656,400,3]{2,1,0} broadcast(%reshape.7), dimensions={0,2}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %Arg_1.2 = f32[400,3]{1,0} parameter(1), metadata={op_name="centroids_frac"}
  %reshape.5 = f32[1,400,3]{2,1,0} reshape(%Arg_1.2), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %broadcast.9 = f32[1,400,3]{2,1,0} broadcast(%reshape.5), dimensions={0,1,2}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %reshape.10 = f32[400,3]{1,0} reshape(%broadcast.9), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %broadcast.11 = f32[46656,400,3]{2,1,0} broadcast(%reshape.10), dimensions={1,2}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %subtract.12 = f32[46656,400,3]{2,1,0} subtract(%broadcast.8, %broadcast.11), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=123}
  %call.16 = f32[46656,400,3]{2,1,0} call(%subtract.12), to_apply=%round.13
  %subtract.17 = f32[46656,400,3]{2,1,0} subtract(%subtract.12, %call.16), metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/sub" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=127}
  %Arg_2.3 = f32[3,3]{1,0} parameter(2), metadata={op_name="metric_tensor"}
  %dot.18 = f32[3,46656,400]{2,1,0} dot(%Arg_2.3, %subtract.17), lhs_contracting_dims={0}, rhs_contracting_dims={2}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/pki,ij,pkj->pk/dot_general" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=131}
  ROOT %dot.19 = f32[46656,400]{1,0} dot(%subtract.17, %dot.18), lhs_batch_dims={0,1}, lhs_contracting_dims={2}, rhs_batch_dims={1,2}, rhs_contracting_dims={0}, metadata={op_name="jit(pbc_distance_sq_batch)/jit(main)/pki,ij,pkj->pk/dot_general" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/centroid/kmeans_isdf.py" source_line=131}
}

