HloModule jit__kernel, entry_computation_layout={(token[], c128[9,640,80,2]{3,2,1,0}, c128[9,640,80,2]{3,2,1,0}, c128[9,640,640]{2,1,0}, f64[80]{0}, /*index=5*/f64[80]{0}, s32[])->(token[], c128[9,640,46080]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,true,true,true}, allow_spmd_sharding_propagation_to_output={false,true}, num_partitions=4

ENTRY %main.269 (Arg_0.1: token[], Arg_1.2: c128[9,640,80,2], Arg_2.3: c128[9,640,80,2], Arg_3.4: c128[9,640,640], Arg_4.5: f64[80], Arg_5.6: f64[80], Arg_6.7: s32[]) -> (token[], c128[9,640,46080]) {
  %Arg_6.7 = s32[] parameter(6), metadata={op_name="r_start_dyn"}
  %constant.2 = s64[] constant(87012800)
  %Arg_0.1 = token[] parameter(0)
  %partition-id.0 = u32[] partition-id(), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %constant.17 = u32[] constant(1), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %shift-right-logical = u32[] shift-right-logical(%partition-id.0, %constant.17), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %constant.18 = u32[] constant(1), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %and = u32[] and(%shift-right-logical, %constant.18), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %convert.0 = s32[] convert(%and), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=243}
  %partition-id.1 = u32[] partition-id(), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=244}
  %constant.19 = u32[] constant(1), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=244}
  %and.1 = u32[] and(%partition-id.1, %constant.19), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=244}
  %convert.1 = s32[] convert(%and.1), metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=244}
  %custom-call.0 = (token[], c128[9,20,2,24,24,80]{5,4,3,2,1,0}) custom-call(%constant.2, %Arg_0.1, %convert.0, %convert.1), custom_call_target="xla_python_gpu_callback", operand_layout_constraints={s64[], token[], s32[], s32[]}, custom_call_has_side_effect=true, api_version=API_VERSION_STATUS_RETURNING, sharding={{manual}, {manual}}, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=245}, backend_config="87012800"
  %get-tuple-element.37 = token[] get-tuple-element(%custom-call.0), index=0, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=245}
  %Arg_3.4 = c128[9,640,640]{2,1,0} parameter(3), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="L_q"}
  %custom-call.43 = c128[9,640,640]{2,1,0} custom-call(%Arg_3.4), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=507}
  %custom-call.44 = c128[9,640,640]{2,1,0} custom-call(%custom-call.43), custom_call_target="Sharding", sharding={replicated}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  %custom-call.45 = c128[9,640,640]{2,1,0} custom-call(%custom-call.44), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  %real.3 = f64[9,640,640]{2,1,0} real(%custom-call.45), metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %imag.3 = f64[9,640,640]{2,1,0} imag(%custom-call.45), metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %negate.2 = f64[9,640,640]{2,1,0} negate(%imag.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %complex.3 = c128[9,640,640]{2,1,0} complex(%real.3, %negate.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %transpose.1 = c128[9,640,640]{1,2,0} transpose(%complex.3), dimensions={0,2,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %constant.15 = c128[] constant((0, 0))
  %broadcast.16 = c128[9,640,46080]{2,1,0} broadcast(%constant.15), dimensions={}
  %custom-call.17 = c128[9,640,46080]{2,1,0} custom-call(%broadcast.16), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=696}
  %custom-call.16 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.17), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %Arg_1.2 = c128[9,640,80,2]{3,2,1,0} parameter(1), sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="psi_l_rmuT_X_fit"}
  %custom-call.19 = c128[9,640,80,2]{3,2,1,0} custom-call(%Arg_1.2), custom_call_target="Sharding", sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %get-tuple-element.38 = c128[9,20,2,24,24,80]{5,4,3,2,1,0} get-tuple-element(%custom-call.0), index=1, metadata={op_name="jit(_kernel)/jit(main)/jit(shmap_body)/io_callback" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=245}
  %custom-call.39 = c128[9,20,2,24,24,80]{5,4,3,2,1,0} custom-call(%get-tuple-element.38), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=248}
  %custom-call.40 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.39), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,4,1,1,1,1]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/psi_G_store.py" source_line=248}
  %custom-call.1 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.40), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140350204352640"
  %custom-call.2 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.1), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065994000"
  %custom-call.3 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} custom-call(%custom-call.2), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065994240"
  %constant.27 = f64[9]{0} constant({0, 0, 0, 0.33333333333333331, 0.33333333333333331, 0.33333333333333331, 0.66666666666666663, 0.66666666666666663, 0.66666666666666663}), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %broadcast.1 = f64[9,24,1,1]{3,2,1,0} broadcast(%constant.27), dimensions={0}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %iota = f64[1,24,1,1]{3,2,1,0} iota(), iota_dimension=1, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=342}
  %constant.20 = f64[] constant(0.041666666666666664)
  %broadcast.32 = f64[1,24,1,1]{3,2,1,0} broadcast(%constant.20), dimensions={}
  %multiply.14 = f64[1,24,1,1]{3,2,1,0} multiply(%iota, %broadcast.32), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=342}
  %reshape.30 = f64[24]{0} reshape(%multiply.14), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %broadcast.3 = f64[9,24,1,1]{3,2,1,0} broadcast(%reshape.30), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %multiply.0 = f64[9,24,1,1]{3,2,1,0} multiply(%broadcast.1, %broadcast.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %reshape.33 = f64[9,24]{1,0} reshape(%multiply.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %broadcast.5 = f64[9,24,24,1]{3,2,1,0} broadcast(%reshape.33), dimensions={0,1}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %constant.29 = f64[9]{0} constant({0, 0.33333333333333331, 0.66666666666666663, 0, 0.33333333333333331, 0.66666666666666663, 0, 0.33333333333333331, 0.66666666666666663}), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=362}
  %broadcast.7 = f64[9,1,24,1]{3,2,1,0} broadcast(%constant.29), dimensions={0}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=362}
  %iota.1 = f64[1,1,24,1]{3,2,1,0} iota(), iota_dimension=2, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=343}
  %constant.24 = f64[] constant(0.041666666666666664)
  %broadcast.36 = f64[1,1,24,1]{3,2,1,0} broadcast(%constant.24), dimensions={}
  %multiply.15 = f64[1,1,24,1]{3,2,1,0} multiply(%iota.1, %broadcast.36), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=343}
  %reshape.39 = f64[24]{0} reshape(%multiply.15), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=362}
  %broadcast.10 = f64[9,1,24,1]{3,2,1,0} broadcast(%reshape.39), dimensions={2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=362}
  %multiply.1 = f64[9,1,24,1]{3,2,1,0} multiply(%broadcast.7, %broadcast.10), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=362}
  %reshape.43 = f64[9,24]{1,0} reshape(%multiply.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %broadcast.14 = f64[9,24,24,1]{3,2,1,0} broadcast(%reshape.43), dimensions={0,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %add.1 = f64[9,24,24,1]{3,2,1,0} add(%broadcast.5, %broadcast.14), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %reshape.9 = f64[9,24,24]{2,1,0} reshape(%add.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %broadcast.17 = f64[9,24,24,80]{3,2,1,0} broadcast(%reshape.9), dimensions={0,1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %constant.33 = f64[] constant(0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=363}
  %broadcast.51 = f64[1,1,1,80]{3,2,1,0} broadcast(%constant.33), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=363}
  %iota.2 = f64[1,1,1,80]{3,2,1,0} iota(), iota_dimension=3, metadata={op_name="jit(_kernel)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=344}
  %constant.25 = f64[] constant(0.0125)
  %broadcast.40 = f64[1,1,1,80]{3,2,1,0} broadcast(%constant.25), dimensions={}
  %multiply.16 = f64[1,1,1,80]{3,2,1,0} multiply(%iota.2, %broadcast.40), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=344}
  %multiply.18 = f64[1,1,1,80]{3,2,1,0} multiply(%broadcast.51, %multiply.16), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=363}
  %reshape.100 = f64[80]{0} reshape(%multiply.18), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=363}
  %broadcast.23 = f64[9,24,24,80]{3,2,1,0} broadcast(%reshape.100), dimensions={3}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %add.2 = f64[9,24,24,80]{3,2,1,0} add(%broadcast.17, %broadcast.23), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=361}
  %convert.2 = c128[9,24,24,80]{3,2,1,0} convert(%add.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=360}
  %constant.5 = c128[] constant((0, 6.2831853071795862))
  %broadcast.24 = c128[9,24,24,80]{3,2,1,0} broadcast(%constant.5), dimensions={}
  %multiply.3 = c128[9,24,24,80]{3,2,1,0} multiply(%convert.2, %broadcast.24), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=360}
  %real.1 = f64[9,24,24,80]{3,2,1,0} real(%multiply.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %exponential.0 = f64[9,24,24,80]{3,2,1,0} exponential(%real.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %constant.6 = f64[] constant(inf)
  %broadcast.25 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.6), dimensions={}
  %compare.1 = pred[9,24,24,80]{3,2,1,0} compare(%exponential.0, %broadcast.25), direction=EQ, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %constant.7 = f64[] constant(0.5)
  %broadcast.26 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.7), dimensions={}
  %multiply.4 = f64[9,24,24,80]{3,2,1,0} multiply(%real.1, %broadcast.26), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %exponential.1 = f64[9,24,24,80]{3,2,1,0} exponential(%multiply.4), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %imag.1 = f64[9,24,24,80]{3,2,1,0} imag(%multiply.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %cosine.0 = f64[9,24,24,80]{3,2,1,0} cosine(%imag.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.5 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.1, %cosine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.6 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.5, %exponential.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.7 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.0, %cosine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %select.1 = f64[9,24,24,80]{3,2,1,0} select(%compare.1, %multiply.6, %multiply.7), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %constant.9 = f64[] constant(0)
  %broadcast.27 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant.9), dimensions={}
  %compare.2 = pred[9,24,24,80]{3,2,1,0} compare(%imag.1, %broadcast.27), direction=EQ, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %sine.0 = f64[9,24,24,80]{3,2,1,0} sine(%imag.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.8 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.1, %sine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.9 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.8, %exponential.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %multiply.10 = f64[9,24,24,80]{3,2,1,0} multiply(%exponential.0, %sine.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %select.2 = f64[9,24,24,80]{3,2,1,0} select(%compare.1, %multiply.9, %multiply.10), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %select.3 = f64[9,24,24,80]{3,2,1,0} select(%compare.2, %broadcast.27, %select.2), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %complex.1 = c128[9,24,24,80]{3,2,1,0} complex(%select.1, %select.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=359}
  %broadcast.29 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} broadcast(%complex.1), dimensions={0,3,4,5}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=366}
  %multiply.11 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} multiply(%custom-call.3, %broadcast.29), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=366}
  %constant.32 = c128[] constant((214.66252583997982, 0)), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=367}
  %broadcast.30 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} broadcast(%constant.32), dimensions={}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=367}
  %multiply.12 = c128[9,80,2,24,24,80]{5,4,3,2,1,0} multiply(%multiply.11, %broadcast.30), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=367}
  %reshape.16 = c128[9,80,2,46080]{3,2,1,0} reshape(%multiply.12), metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=371}
  %custom-call.4 = c128[9,80,2,46080]{3,2,1,0} custom-call(%reshape.16), custom_call_target="Sharding", sharding={devices=[1,4,1,1]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=377}
  %custom-call.5 = c128[9,20,2,46080]{3,2,1,0} custom-call(%custom-call.4), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=377}
  %custom-call.8 = c128[9,20,2,46080]{3,2,1,0} custom-call(%custom-call.5), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=377}
  %custom-call.9 = c128[9,80,2,46080]{3,2,1,0} custom-call(%custom-call.8), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,4,1,1]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_fft_and_rslice)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=377}
  %custom-call.10 = c128[9,80,2,46080]{3,2,1,0} custom-call(%custom-call.9), custom_call_target="Sharding", sharding={devices=[1,2,1,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_reshard_rchunk)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=412}
  %custom-call.11 = c128[9,80,2,46080]{3,2,1,0} custom-call(%custom-call.10), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=416}
  %Arg_4.5 = f64[80]{0} parameter(4), metadata={op_name="norms_l"}
  %convert.4 = c128[80]{0} convert(%Arg_4.5), metadata={op_name="jit(_kernel)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %broadcast.168 = c128[9,80,2,46080]{3,2,1,0} broadcast(%convert.4), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %divide.169 = c128[9,80,2,46080]{3,2,1,0} divide(%custom-call.11, %broadcast.168), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %custom-call.20 = c128[9,80,2,46080]{3,2,1,0} custom-call(%divide.169), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %dot.1 = c128[9,640,46080]{2,1,0} dot(%custom-call.19, %custom-call.20), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmns,knsv->kmv/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=139}
  %add.5 = c128[9,640,46080]{2,1,0} add(%custom-call.16, %dot.1), metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=139}
  %custom-call.21 = c128[9,640,46080]{2,1,0} custom-call(%add.5), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %custom-call.22 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.21), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=345}
  %reshape.19 = c128[3,3,1,640,46080]{4,3,2,1,0} reshape(%custom-call.22), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %custom-call.23 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%reshape.19), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.24 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.23), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065997312"
  %custom-call.25 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.24), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065998752"
  %custom-call.26 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.25), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065997936"
  %real.4 = f64[3,3,1,640,46080]{4,3,2,1,0} real(%custom-call.26), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=334}
  %imag.4 = f64[3,3,1,640,46080]{4,3,2,1,0} imag(%custom-call.26), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=334}
  %negate.3 = f64[3,3,1,640,46080]{4,3,2,1,0} negate(%imag.4), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=334}
  %complex.4 = c128[3,3,1,640,46080]{4,3,2,1,0} complex(%real.4, %negate.3), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=334}
  %reshape.108 = c128[9,640,46080]{2,1,0} reshape(%complex.4), metadata={op_name="jit(_kernel)/jit(main)/jit(_left_ifft_conj)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=334}
  %custom-call.27 = c128[9,640,46080]{2,1,0} custom-call(%reshape.108), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=345}
  %custom-call.28 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.27), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=346}
  %custom-call.18 = c128[9,640,46080]{2,1,0} custom-call(%broadcast.16), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=696}
  %custom-call.12 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.18), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %Arg_2.3 = c128[9,640,80,2]{3,2,1,0} parameter(2), sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="psi_r_rmuT_X_fit"}
  %custom-call.13 = c128[9,640,80,2]{3,2,1,0} custom-call(%Arg_2.3), custom_call_target="Sharding", sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %Arg_5.6 = f64[80]{0} parameter(5), metadata={op_name="norms_r"}
  %convert.5 = c128[80]{0} convert(%Arg_5.6), metadata={op_name="jit(_kernel)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %broadcast.185 = c128[9,80,2,46080]{3,2,1,0} broadcast(%convert.5), dimensions={1}, metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %divide.186 = c128[9,80,2,46080]{3,2,1,0} divide(%custom-call.11, %broadcast.185), metadata={op_name="jit(_kernel)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=727}
  %custom-call.14 = c128[9,80,2,46080]{3,2,1,0} custom-call(%divide.186), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %dot.0 = c128[9,640,46080]{2,1,0} dot(%custom-call.13, %custom-call.14), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/kmns,knsv->kmv/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=139}
  %add.4 = c128[9,640,46080]{2,1,0} add(%custom-call.12, %dot.0), metadata={op_name="jit(_kernel)/jit(main)/jit(_accum)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=139}
  %custom-call.15 = c128[9,640,46080]{2,1,0} custom-call(%add.4), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=142}
  %custom-call.29 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.15), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=346}
  %reshape.21 = c128[3,3,1,640,46080]{4,3,2,1,0} reshape(%custom-call.29), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %custom-call.30 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%reshape.21), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.31 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.30), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065998368"
  %custom-call.33 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.31), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065999664"
  %custom-call.34 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.33), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065996880"
  %reshape.22 = c128[9,640,46080]{2,1,0} reshape(%custom-call.34), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=397}
  %multiply.13 = c128[9,640,46080]{2,1,0} multiply(%custom-call.28, %reshape.22), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=341}
  %reshape.23 = c128[3,3,1,640,46080]{4,3,2,1,0} reshape(%multiply.13), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %custom-call.35 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%reshape.23), custom_call_target="Sharding", sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.36 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.35), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349065998800"
  %custom-call.37 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.36), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349066000960"
  %custom-call.38 = c128[3,3,1,640,46080]{4,3,2,1,0} custom-call(%custom-call.37), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140349066000384"
  %reshape.24 = c128[9,640,46080]{2,1,0} reshape(%custom-call.38), metadata={op_name="jit(_kernel)/jit(main)/jit(_right_ifft_mul_fft)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=397}
  %custom-call.41 = c128[9,640,46080]{2,1,0} custom-call(%reshape.24), custom_call_target="Sharding", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=346}
  %custom-call.233 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.41), custom_call_target="Sharding", sharding={devices=[1,1,4]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=748}
  %custom-call.42 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.233), custom_call_target="Sharding", sharding={devices=[1,1,4]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_reshard_z)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=546}
  %custom-call.46 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.42), custom_call_target="Sharding", sharding={devices=[1,1,4]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  %custom-call.47 = c128[9,640,11520]{2,1,0} custom-call(%custom-call.46), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  %triangular-solve.4 = c128[9,640,11520]{2,1,0} triangular-solve(%custom-call.45, %custom-call.47), left_side=true, lower=true, transpose_a=NO_TRANSPOSE, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/vmap(jit(_solve_triangular))/triangular_solve" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=492}
  %triangular-solve.5 = c128[9,640,11520]{2,1,0} triangular-solve(%transpose.1, %triangular-solve.4), left_side=true, transpose_a=NO_TRANSPOSE, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/jit(shmap_body)/vmap(jit(_solve_triangular))/triangular_solve" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=493}
  %custom-call.48 = c128[9,640,11520]{2,1,0} custom-call(%triangular-solve.5), custom_call_target="Sharding", sharding={manual}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  %custom-call.49 = c128[9,640,46080]{2,1,0} custom-call(%custom-call.48), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,1,4]<=[4]}, metadata={op_name="jit(_kernel)/jit(main)/jit(_solve_all_at_once)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/isdf_fitting.py" source_line=508}
  ROOT %tuple.268 = (token[], c128[9,640,46080]{2,1,0}) tuple(%get-tuple-element.37, %custom-call.49)
}

