HloModule jit__tau_kernel, entry_computation_layout={(c128[9,2,640,80]{3,2,1,0}, c128[9,80,2,640]{3,2,1,0}, c128[9,80,2,640]{3,2,1,0}, c128[9,2,640,80]{3,2,1,0}, f64[9,80]{1,0}, /*index=5*/pred[9,80]{1,0}, c128[9,640,640]{2,1,0}, f64[9,640,640]{2,1,0}, pred[9,640,640]{2,1,0}, f64[], /*index=10*/f64[], c128[])->(c128[9,80,80]{2,1,0}, c128[9,80,80]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,true,false,false,false,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true}, num_partitions=4

%region_0.69 (Arg_0.70: c128[], Arg_1.71: c128[]) -> c128[] {
  %Arg_0.70 = c128[] parameter(0), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.71 = c128[] parameter(1), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.72 = c128[] add(%Arg_0.70, %Arg_1.71), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=425}
}

%region_1.73 (Arg_0.74: c128[], Arg_1.75: c128[]) -> c128[] {
  %Arg_0.74 = c128[] parameter(0), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.75 = c128[] parameter(1), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.76 = c128[] add(%Arg_0.74, %Arg_1.75), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=431}
}

%region_2.77 (Arg_0.78: c128[], Arg_1.79: c128[]) -> c128[] {
  %Arg_0.78 = c128[] parameter(0), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.79 = c128[] parameter(1), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.80 = c128[] add(%Arg_0.78, %Arg_1.79), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=425}
}

%region_3.81 (Arg_0.82: c128[], Arg_1.83: c128[]) -> c128[] {
  %Arg_0.82 = c128[] parameter(0), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.83 = c128[] parameter(1), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.84 = c128[] add(%Arg_0.82, %Arg_1.83), metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=431}
}

ENTRY %main.205 (Arg_0.1: c128[9,2,640,80], Arg_1.2: c128[9,80,2,640], Arg_2.3: c128[9,80,2,640], Arg_3.4: c128[9,2,640,80], Arg_4.5: f64[9,80], Arg_5.6: pred[9,80], Arg_6.7: c128[9,640,640], Arg_7.8: f64[9,640,640], Arg_8.9: pred[9,640,640], Arg_9.10: f64[], Arg_10.11: f64[], Arg_11.12: c128[]) -> (c128[9,80,80], c128[9,80,80]) {
  %Arg_2.3 = c128[9,80,2,640]{3,2,1,0} parameter(2), sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="psi_proj_xr"}
  %copy.8 = c128[9,80,2,640]{3,2,1,0} copy(%Arg_2.3), sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %custom-call.2 = c128[9,80,2,320]{3,2,1,0} custom-call(%copy.8), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %real.4 = f64[9,80,2,320]{3,2,1,0} real(%custom-call.2), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %imag.4 = f64[9,80,2,320]{3,2,1,0} imag(%custom-call.2), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %negate.2 = f64[9,80,2,320]{3,2,1,0} negate(%imag.4), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %complex.3 = c128[9,80,2,320]{3,2,1,0} complex(%real.4, %negate.2), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %Arg_0.1 = c128[9,2,640,80]{3,2,1,0} parameter(0), sharding={devices=[1,1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="psi_coh_xn"}
  %Arg_5.6 = pred[9,80]{1,0} parameter(5), metadata={op_name="mask_A"}
  %Arg_11.12 = c128[] parameter(11), metadata={op_name="t_node"}
  %constant.5 = c128[] constant((0, 1)), sharding={replicated}
  %multiply.10 = c128[] multiply(%Arg_11.12, %constant.5), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=488}
  %negate.3 = c128[] negate(%multiply.10), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %broadcast.9 = c128[9,80]{1,0} broadcast(%negate.3), dimensions={}, sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %Arg_4.5 = f64[9,80]{1,0} parameter(4), sharding={replicated}, metadata={op_name="E_A"}
  %Arg_9.10 = f64[] parameter(9), metadata={op_name="E_ref_A"}
  %broadcast.10 = f64[9,80]{1,0} broadcast(%Arg_9.10), dimensions={}, sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %subtract.1 = f64[9,80]{1,0} subtract(%Arg_4.5, %broadcast.10), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %convert.3 = c128[9,80]{1,0} convert(%subtract.1), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.11 = c128[9,80]{1,0} multiply(%broadcast.9, %convert.3), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %real.5 = f64[9,80]{1,0} real(%multiply.11), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %exponential.2 = f64[9,80]{1,0} exponential(%real.5), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %constant.6 = f64[] constant(inf), sharding={replicated}
  %broadcast.11 = f64[9,80]{1,0} broadcast(%constant.6), dimensions={}, sharding={replicated}
  %compare.2 = pred[9,80]{1,0} compare(%exponential.2, %broadcast.11), direction=EQ, sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %constant.7 = f64[] constant(0.5), sharding={replicated}
  %broadcast.12 = f64[9,80]{1,0} broadcast(%constant.7), dimensions={}, sharding={replicated}
  %multiply.12 = f64[9,80]{1,0} multiply(%real.5, %broadcast.12), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %exponential.3 = f64[9,80]{1,0} exponential(%multiply.12), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %imag.5 = f64[9,80]{1,0} imag(%multiply.11), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %cosine.1 = f64[9,80]{1,0} cosine(%imag.5), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.13 = f64[9,80]{1,0} multiply(%exponential.3, %cosine.1), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.14 = f64[9,80]{1,0} multiply(%multiply.13, %exponential.3), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.15 = f64[9,80]{1,0} multiply(%exponential.2, %cosine.1), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %select.6 = f64[9,80]{1,0} select(%compare.2, %multiply.14, %multiply.15), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %constant.8 = f64[] constant(0), sharding={replicated}
  %broadcast.13 = f64[9,80]{1,0} broadcast(%constant.8), dimensions={}, sharding={replicated}
  %compare.3 = pred[9,80]{1,0} compare(%imag.5, %broadcast.13), direction=EQ, sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %sine.1 = f64[9,80]{1,0} sine(%imag.5), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.16 = f64[9,80]{1,0} multiply(%exponential.3, %sine.1), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.17 = f64[9,80]{1,0} multiply(%multiply.16, %exponential.3), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %multiply.18 = f64[9,80]{1,0} multiply(%exponential.2, %sine.1), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %select.7 = f64[9,80]{1,0} select(%compare.2, %multiply.17, %multiply.18), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %select.8 = f64[9,80]{1,0} select(%compare.3, %broadcast.13, %select.7), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %complex.4 = c128[9,80]{1,0} complex(%select.6, %select.8), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=54}
  %constant.9 = c128[] constant((0, 0)), sharding={replicated}
  %broadcast.14 = c128[9,80]{1,0} broadcast(%constant.9), dimensions={}, sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=56}
  %select.9 = c128[9,80]{1,0} select(%Arg_5.6, %complex.4, %broadcast.14), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=56}
  %broadcast.19 = c128[9,80,2,640]{3,2,1,0} broadcast(%select.9), dimensions={0,1}, sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/ksxn,kn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=28}
  %Arg_1.2 = c128[9,80,2,640]{3,2,1,0} parameter(1), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="psi_coh_yr"}
  %real.6 = f64[9,80,2,640]{3,2,1,0} real(%Arg_1.2), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=29}
  %imag.6 = f64[9,80,2,640]{3,2,1,0} imag(%Arg_1.2), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=29}
  %negate.4 = f64[9,80,2,640]{3,2,1,0} negate(%imag.6), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=29}
  %complex.5 = c128[9,80,2,640]{3,2,1,0} complex(%real.6, %negate.4), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/ksxn,kn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=28}
  %multiply.21 = c128[9,80,2,640]{3,2,1,0} multiply(%broadcast.19, %complex.5), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/ksxn,kn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=28}
  %dot.5 = c128[9,2,640,2,640]{4,3,2,1,0} dot(%Arg_0.1, %multiply.21), lhs_batch_dims={0}, lhs_contracting_dims={3}, rhs_batch_dims={0}, rhs_contracting_dims={1}, sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/ksxn,kn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=28}
  %reshape.0 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} reshape(%dot.5), sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %copy.7 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} copy(%reshape.0), sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.4 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%copy.7), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312806368"
  %custom-call.5 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%custom-call.4), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312806656"
  %custom-call.6 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%custom-call.5), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312806608"
  %reshape.1 = c128[9,2,640,2,640]{4,3,2,1,0} reshape(%custom-call.6), sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=397}
  %Arg_8.9 = pred[9,640,640]{2,1,0} parameter(8), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="mask_B"}
  %Arg_6.7 = c128[9,640,640]{2,1,0} parameter(6), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="B_q"}
  %Arg_7.8 = f64[9,640,640]{2,1,0} parameter(7), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="Omega_q"}
  %Arg_10.11 = f64[] parameter(10), metadata={op_name="E_ref_B"}
  %broadcast.2 = f64[9,640,640]{2,1,0} broadcast(%Arg_10.11), dimensions={}, sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %subtract.0 = f64[9,640,640]{2,1,0} subtract(%Arg_7.8, %broadcast.2), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %convert.2 = c128[9,640,640]{2,1,0} convert(%subtract.0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %constant.0 = c128[] constant((-0, -1)), sharding={replicated}
  %multiply.22 = c128[] multiply(%Arg_11.12, %constant.0), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %broadcast.20 = c128[9,640,640]{2,1,0} broadcast(%multiply.22), dimensions={}, sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.1 = c128[9,640,640]{2,1,0} multiply(%convert.2, %broadcast.20), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %real.3 = f64[9,640,640]{2,1,0} real(%multiply.1), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %exponential.0 = f64[9,640,640]{2,1,0} exponential(%real.3), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %constant.1 = f64[] constant(inf), sharding={replicated}
  %broadcast.5 = f64[9,640,640]{2,1,0} broadcast(%constant.1), dimensions={}, sharding={devices=[1,2,2]<=[4]}
  %compare.0 = pred[9,640,640]{2,1,0} compare(%exponential.0, %broadcast.5), direction=EQ, sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %constant.2 = f64[] constant(0.5), sharding={replicated}
  %broadcast.6 = f64[9,640,640]{2,1,0} broadcast(%constant.2), dimensions={}, sharding={devices=[1,2,2]<=[4]}
  %multiply.2 = f64[9,640,640]{2,1,0} multiply(%real.3, %broadcast.6), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %exponential.1 = f64[9,640,640]{2,1,0} exponential(%multiply.2), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %imag.3 = f64[9,640,640]{2,1,0} imag(%multiply.1), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %cosine.0 = f64[9,640,640]{2,1,0} cosine(%imag.3), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.3 = f64[9,640,640]{2,1,0} multiply(%exponential.1, %cosine.0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.4 = f64[9,640,640]{2,1,0} multiply(%multiply.3, %exponential.1), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.5 = f64[9,640,640]{2,1,0} multiply(%exponential.0, %cosine.0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %select.2 = f64[9,640,640]{2,1,0} select(%compare.0, %multiply.4, %multiply.5), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %constant.3 = f64[] constant(0), sharding={replicated}
  %broadcast.7 = f64[9,640,640]{2,1,0} broadcast(%constant.3), dimensions={}, sharding={devices=[1,2,2]<=[4]}
  %compare.1 = pred[9,640,640]{2,1,0} compare(%imag.3, %broadcast.7), direction=EQ, sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %sine.0 = f64[9,640,640]{2,1,0} sine(%imag.3), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.6 = f64[9,640,640]{2,1,0} multiply(%exponential.1, %sine.0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.7 = f64[9,640,640]{2,1,0} multiply(%multiply.6, %exponential.1), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.8 = f64[9,640,640]{2,1,0} multiply(%exponential.0, %sine.0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %select.3 = f64[9,640,640]{2,1,0} select(%compare.0, %multiply.7, %multiply.8), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %select.4 = f64[9,640,640]{2,1,0} select(%compare.1, %broadcast.7, %select.3), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %complex.2 = c128[9,640,640]{2,1,0} complex(%select.2, %select.4), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=523}
  %multiply.9 = c128[9,640,640]{2,1,0} multiply(%Arg_6.7, %complex.2), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=524}
  %constant.4 = c128[] constant((0, 0)), sharding={replicated}
  %broadcast.8 = c128[9,640,640]{2,1,0} broadcast(%constant.4), dimensions={}, sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/minimax_screening.py" source_line=444}
  %select.5 = c128[9,640,640]{2,1,0} select(%Arg_8.9, %multiply.9, %broadcast.8), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/minimax_screening.py" source_line=444}
  %copy.6 = c128[9,640,640]{2,1,0} copy(%select.5), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_build_W_t_q)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=526}
  %reshape.2 = c128[3,3,1,640,640]{4,3,2,1,0} reshape(%copy.6), sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %copy.5 = c128[3,3,1,640,640]{4,3,2,1,0} copy(%reshape.2), sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.8 = c128[3,3,1,640,640]{4,3,2,1,0} custom-call(%copy.5), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312808048"
  %custom-call.9 = c128[3,3,1,640,640]{4,3,2,1,0} custom-call(%custom-call.8), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312808336"
  %custom-call.10 = c128[3,3,1,640,640]{4,3,2,1,0} custom-call(%custom-call.9), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312808576"
  %reshape.4 = c128[9,640,640]{2,1,0} reshape(%custom-call.10), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %broadcast.16 = c128[9,2,640,2,640]{4,3,2,1,0} broadcast(%reshape.4), dimensions={0,2,4}, sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %multiply.19 = c128[9,2,640,2,640]{4,3,2,1,0} multiply(%reshape.1, %broadcast.16), sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %constant.11 = c128[] constant((-0.33333333333333331, 0)), sharding={replicated}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %broadcast.18 = c128[9,2,640,2,640]{4,3,2,1,0} broadcast(%constant.11), dimensions={}, sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %multiply.20 = c128[9,2,640,2,640]{4,3,2,1,0} multiply(%multiply.19, %broadcast.18), sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=493}
  %reshape.5 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} reshape(%multiply.20), sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=396}
  %copy.4 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} copy(%reshape.5), sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=395}
  %custom-call.12 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%copy.4), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312809344"
  %custom-call.13 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%custom-call.12), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312924432"
  %custom-call.14 = c128[3,3,1,2,640,2,640]{6,5,4,3,2,1,0} custom-call(%custom-call.13), custom_call_target="CustomSPMDPartitioning", api_version=API_VERSION_STATUS_RETURNING, sharding={devices=[1,1,1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=259}, backend_config="140164312924672"
  %reshape.6 = c128[9,2,640,2,640]{4,3,2,1,0} reshape(%custom-call.14), sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=397}
  %copy.3 = c128[9,2,640,2,640]{4,3,2,1,0} copy(%reshape.6), sharding={devices=[1,1,2,1,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %custom-call.16 = c128[9,2,320,2,320]{4,3,2,1,0} custom-call(%copy.3), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %real.7 = f64[9,2,320,2,320]{4,3,2,1,0} real(%custom-call.16), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=435}
  %convert.5 = c128[9,2,320,2,320]{4,3,2,1,0} convert(%real.7), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=421}
  %dot.6 = c128[9,80,2,320]{3,2,1,0} dot(%complex.3, %convert.5), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=421}
  %reduce-scatter.4 = c128[9,40,2,320]{3,2,1,0} reduce-scatter(%dot.6), channel_id=1, replica_groups={{0,2},{1,3}}, use_global_device_ids=true, dimensions={1}, to_apply=%region_0.69, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=425}
  %Arg_3.4 = c128[9,2,640,80]{3,2,1,0} parameter(3), sharding={devices=[1,1,2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="psi_proj_yn"}
  %copy.2 = c128[9,2,640,80]{3,2,1,0} copy(%Arg_3.4), sharding={devices=[1,1,2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %custom-call.18 = c128[9,2,320,80]{3,2,1,0} custom-call(%copy.2), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %dot.7 = c128[9,40,80]{2,1,0} dot(%reduce-scatter.4, %custom-call.18), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=428}
  %reduce-scatter.5 = c128[9,40,40]{2,1,0} reduce-scatter(%dot.7), channel_id=2, replica_groups={{0,1},{2,3}}, use_global_device_ids=true, dimensions={2}, to_apply=%region_1.73, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=431}
  %copy.1 = c128[9,40,40]{2,1,0} copy(%reduce-scatter.5), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %custom-call.20 = c128[9,80,80]{2,1,0} custom-call(%copy.1), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %real.8 = f64[9,80,2,320]{3,2,1,0} real(%custom-call.2), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %imag.7 = f64[9,80,2,320]{3,2,1,0} imag(%custom-call.2), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %negate.5 = f64[9,80,2,320]{3,2,1,0} negate(%imag.7), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %complex.6 = c128[9,80,2,320]{3,2,1,0} complex(%real.8, %negate.5), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=423}
  %imag.8 = f64[9,2,320,2,320]{4,3,2,1,0} imag(%custom-call.16), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=436}
  %convert.6 = c128[9,2,320,2,320]{4,3,2,1,0} convert(%imag.8), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=421}
  %dot.8 = c128[9,80,2,320]{3,2,1,0} dot(%complex.6, %convert.6), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=421}
  %reduce-scatter.6 = c128[9,40,2,320]{3,2,1,0} reduce-scatter(%dot.8), channel_id=3, replica_groups={{0,2},{1,3}}, use_global_device_ids=true, dimensions={1}, to_apply=%region_2.77, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=425}
  %dot.9 = c128[9,40,80]{2,1,0} dot(%reduce-scatter.6, %custom-call.18), lhs_batch_dims={0}, lhs_contracting_dims={2,3}, rhs_batch_dims={0}, rhs_contracting_dims={1,2}, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=428}
  %reduce-scatter.7 = c128[9,40,40]{2,1,0} reduce-scatter(%dot.9), channel_id=4, replica_groups={{0,1},{2,3}}, use_global_device_ids=true, dimensions={2}, to_apply=%region_3.81, sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/jit(shmap_body)/reduce_scatter" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=431}
  %copy = c128[9,40,40]{2,1,0} copy(%reduce-scatter.7), sharding={manual}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  %custom-call.22 = c128[9,80,80]{2,1,0} custom-call(%copy), custom_call_target="SPMDShardToFullShape", sharding={devices=[1,2,2]<=[4]}, metadata={op_name="jit(_tau_kernel)/jit(main)/jit(_sigma_kij_kernel)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=494}
  ROOT %tuple.204 = (c128[9,80,80]{2,1,0}, c128[9,80,80]{2,1,0}) tuple(%custom-call.20, %custom-call.22), sharding={{devices=[1,2,2]<=[4]}, {devices=[1,2,2]<=[4]}}
}

