HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(s64[1]{0})->s64[1]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="47fd0d1ec93472a0b81fd4bac10c5238"}

ENTRY %main.2 (Arg_0.1.0: s64[1]) -> s64[1] {
  %Arg_0.1.0 = s64[1]{0} parameter(0), metadata={op_name="args[0]" scheduling_name="Arg_0.1.0"}
  ROOT %copy.1 = s64[1]{0} copy(%Arg_0.1.0)
}

