HloModule jit__full_run, entry_computation_layout={(c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, f64[64,4]{1,0}, /*index=5*/f64[64,4]{1,0}, c128[480,480,4,4,4]{4,3,2,1,0}, c128[480,480]{1,0})->(f64[5]{0}, c128[5,1024]{1,0}, s32[])}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false}, num_partitions=4

%region_0.1149 (Arg_0.1150: f64[], Arg_1.1151: f64[]) -> f64[] {
  %Arg_0.1150 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  %Arg_1.1151 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  ROOT %add.1152 = f64[] add(%Arg_0.1150, %Arg_1.1151), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=249}
}

%region_17.1797 (Arg_0.1798: f64[], Arg_1.1799: f64[], Arg_2.1800: s64[], Arg_3.1801: s64[]) -> pred[] {
  %Arg_2.1800 = s64[] parameter(2), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %Arg_3.1801 = s64[] parameter(3), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %constant.1802 = f64[] constant(nan)
  %constant.1803 = f64[] constant(0)
  %Arg_0.1798 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %compare.1806 = pred[] compare(%Arg_0.1798, %Arg_0.1798), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.1080 = f64[] constant(nan)
  %constant.1082 = f64[] constant(0)
  %compare.1804 = pred[] compare(%Arg_0.1798, %constant.1082), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.1083 = f64[] constant(0)
  %select.1805 = f64[] select(%compare.1804, %constant.1083, %Arg_0.1798), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %select.1807 = f64[] select(%compare.1806, %constant.1080, %select.1805), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %Arg_1.1799 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/sort"}
  %compare.1810 = pred[] compare(%Arg_1.1799, %Arg_1.1799), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.1081 = f64[] constant(nan)
  %constant.1084 = f64[] constant(0)
  %compare.1808 = pred[] compare(%Arg_1.1799, %constant.1084), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %constant.1085 = f64[] constant(0)
  %select.1809 = f64[] select(%compare.1808, %constant.1085, %Arg_1.1799), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  %select.1811 = f64[] select(%compare.1810, %constant.1081, %select.1809), metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
  ROOT %compare.1812 = pred[] compare(%select.1807, %select.1811), direction=LT, type=TOTALORDER, metadata={op_name="jit(_full_run)/jit(main)/jit(argsort)/lt_to" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=293}
}

%region_18.1836 (Arg_0.1837: f64[], Arg_1.1838: f64[]) -> f64[] {
  %Arg_0.1837 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  %Arg_1.1838 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum"}
  ROOT %add.1839 = f64[] add(%Arg_0.1837, %Arg_1.1838), metadata={op_name="jit(_full_run)/jit(main)/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=297}
}

%and.reduce_sub_computation.3 (lhs.3: pred[], rhs.3: pred[]) -> pred[] {
  %lhs.3 = pred[] parameter(0)
  %rhs.3 = pred[] parameter(1)
  ROOT %and.10 = pred[] and(%lhs.3, %rhs.3)
}

%region_6.1287 (Arg_0.1288: c128[], Arg_1.1289: c128[]) -> c128[] {
  %Arg_0.1288 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum"}
  %Arg_1.1289 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum"}
  ROOT %add.1290 = c128[] add(%Arg_0.1288, %Arg_1.1289), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
}

%region_5.1299 (arg_tuple.1300: (s64[], c128[1,2,240,64], c128[1,240,64])) -> (s64[], c128[1,2,240,64], c128[1,240,64]) {
  %arg_tuple.1300 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), sharding={{replicated}, {manual}, {manual}}
  %get-tuple-element.1301 = s64[] get-tuple-element(%arg_tuple.1300), index=0, sharding={replicated}
  %constant.1304 = s64[] constant(1), sharding={replicated}
  %add.1308 = s64[] add(%get-tuple-element.1301, %constant.1304), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285}
  %get-tuple-element.1302 = c128[1,2,240,64]{3,2,1,0} get-tuple-element(%arg_tuple.1300), index=1, sharding={manual}
  %collective-permute.1 = c128[1,2,240,64]{3,2,1,0} collective-permute(%get-tuple-element.1302), channel_id=2, source_target_pairs={{0,2},{2,0},{1,3},{3,1}}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=282}
  %get-tuple-element.1303 = c128[1,240,64]{2,1,0} get-tuple-element(%arg_tuple.1300), index=2, sharding={manual}
  %constant.322 = c128[] constant((0, 0)), sharding={manual}
  %reduce.0 = c128[1,240,64]{2,1,0} reduce(%get-tuple-element.1302, %constant.322), dimensions={1}, to_apply=%region_6.1287, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
  %add.386 = c128[1,240,64]{2,1,0} add(%get-tuple-element.1303, %reduce.0), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
  ROOT %tuple.1309 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) tuple(%add.1308, %collective-permute.1, %add.386), sharding={{replicated}, {manual}, {manual}}
}

%region_7.1310 (arg_tuple.1311: (s64[], c128[1,2,240,64], c128[1,240,64])) -> pred[] {
  %arg_tuple.1311 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), sharding={{replicated}, {manual}, {manual}}
  %get-tuple-element.1312 = s64[] get-tuple-element(%arg_tuple.1311), index=0, sharding={replicated}
  %constant.1315 = s64[] constant(2), sharding={replicated}
  ROOT %compare.1316 = pred[] compare(%get-tuple-element.1312, %constant.1315), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285}
}

%region_8.1317 (Arg_0.1318: c128[], Arg_1.1319: c128[]) -> c128[] {
  %Arg_0.1318 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/psum2"}
  %Arg_1.1319 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/psum2"}
  ROOT %add.1320 = c128[] add(%Arg_0.1318, %Arg_1.1319), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=290}
}

%region_9.1321 (Arg_0.1322: c128[], Arg_1.1323: c128[]) -> c128[] {
  %Arg_0.1322 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.1323 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.1324 = c128[] add(%Arg_0.1322, %Arg_1.1323), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=298}
}

%scalar_add_computation (scalar_lhs: c128[], scalar_rhs: c128[]) -> c128[] {
  %scalar_lhs = c128[] parameter(0)
  %scalar_rhs = c128[] parameter(1)
  ROOT %add.567 = c128[] add(%scalar_lhs, %scalar_rhs)
}

%region_11.1504 (arg_tuple.1505: (s64[], c128[1024], s64[], s64[], c128[1024,200])) -> (s64[], c128[1024], s64[], s64[], c128[1024,200]) {
  %constant.1513 = s64[] constant(0)
  %arg_tuple.1505 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) parameter(0), sharding={{replicated}, {devices=[2,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}}
  %get-tuple-element.1506 = s64[] get-tuple-element(%arg_tuple.1505), index=0, sharding={replicated}
  %constant.1514 = s64[] constant(1), sharding={replicated}
  %add.1515 = s64[] add(%get-tuple-element.1506, %constant.1514), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275}
  %get-tuple-element.1507 = c128[1024]{0} get-tuple-element(%arg_tuple.1505), index=1, sharding={devices=[2,2]<=[4] last_tile_dim_replicate}
  %get-tuple-element.1509 = s64[] get-tuple-element(%arg_tuple.1505), index=3, sharding={replicated}
  %compare.1516 = pred[] compare(%get-tuple-element.1506, %get-tuple-element.1509), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=269}
  %get-tuple-element.1510 = c128[1024,200]{1,0} get-tuple-element(%arg_tuple.1505), index=4, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}
  %constant.1079 = s64[] constant(0)
  %constant.1078 = s64[] constant(0), sharding={replicated}
  %compare.1517 = pred[] compare(%get-tuple-element.1506, %constant.1078), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %constant.1512 = s64[] constant(200), sharding={replicated}
  %add.1518 = s64[] add(%get-tuple-element.1506, %constant.1512), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %select.1519 = s64[] select(%compare.1517, %add.1518, %get-tuple-element.1506), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %dynamic-slice.1520 = c128[1024,1]{1,0} dynamic-slice(%get-tuple-element.1510, %constant.1079, %select.1519), dynamic_slice_sizes={1024,1}, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270}
  %real.41 = f64[1024,1]{1,0} real(%dynamic-slice.1520), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %imag.32 = f64[1024,1]{1,0} imag(%dynamic-slice.1520), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %negate.55 = f64[1024,1]{1,0} negate(%imag.32), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %complex.39 = c128[1024,1]{1,0} complex(%real.41, %negate.55), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %reshape.472 = c128[1024]{0} reshape(%complex.39), sharding={devices=[2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %multiply.130 = c128[1024]{0} multiply(%reshape.472, %get-tuple-element.1507), sharding={devices=[2,2]<=[4] last_tile_dim_replicate}
  %constant.647 = c128[] constant((0, 0))
  %reduce.6 = c128[] reduce(%multiply.130, %constant.647), dimensions={0}, to_apply=%scalar_add_computation, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %constant.1511 = c128[] constant((0, 0)), sharding={replicated}
  %select.101 = c128[] select(%compare.1516, %reduce.6, %constant.1511), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271}
  %broadcast.1050 = c128[1024,1]{1,0} broadcast(%select.101), dimensions={}, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %multiply.163 = c128[1024,1]{1,0} multiply(%broadcast.1050, %dynamic-slice.1520), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %reshape.340 = c128[1024]{0} reshape(%multiply.163), sharding={devices=[2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %subtract.1530 = c128[1024]{0} subtract(%get-tuple-element.1507, %reshape.340), sharding={devices=[2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272}
  %get-tuple-element.1508 = s64[] get-tuple-element(%arg_tuple.1505), index=2, sharding={replicated}
  ROOT %tuple.1531 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) tuple(%add.1515, %subtract.1530, %get-tuple-element.1508, %get-tuple-element.1509, %get-tuple-element.1510), sharding={{replicated}, {devices=[2,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}}
}

%region_12.1532 (arg_tuple.1533: (s64[], c128[1024], s64[], s64[], c128[1024,200])) -> pred[] {
  %arg_tuple.1533 = (s64[], c128[1024]{0}, s64[], s64[], c128[1024,200]{1,0}) parameter(0), sharding={{replicated}, {devices=[2,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}}
  %get-tuple-element.1534 = s64[] get-tuple-element(%arg_tuple.1533), index=0, sharding={replicated}
  %get-tuple-element.1536 = s64[] get-tuple-element(%arg_tuple.1533), index=2, sharding={replicated}
  ROOT %compare.1539 = pred[] compare(%get-tuple-element.1534, %get-tuple-element.1536), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275}
}

%region_13.1540 (Arg_0.1541: f64[], Arg_1.1542: f64[]) -> f64[] {
  %Arg_0.1541 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum"}
  %Arg_1.1542 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum"}
  ROOT %add.1543 = f64[] add(%Arg_0.1541, %Arg_1.1542), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(norm)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=277}
}

%and.reduce_sub_computation (lhs: pred[], rhs: pred[]) -> pred[] {
  %lhs = pred[] parameter(0)
  %rhs = pred[] parameter(1)
  ROOT %and.4 = pred[] and(%lhs, %rhs)
}

%region_3.1259.clone.clone.clone.1 (arg_tuple.11: (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240])) -> (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240]) {
  %arg_tuple.11 = (s64[], c128[1,2,2,64]{3,2,1,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) parameter(0), sharding={{manual}, {manual}, {manual}, {manual}, {manual}, /*index=5*/{manual}}
  %get-tuple-element.392 = s64[] get-tuple-element(%arg_tuple.11), index=0, sharding={manual}
  %constant.1068 = s64[] constant(1), sharding={manual}
  %add.687 = s64[] add(%get-tuple-element.392, %constant.1068), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274}
  %get-tuple-element.390 = c128[1,2,2,64]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=1, sharding={manual}
  %collective-permute.5 = c128[1,2,2,64]{3,2,1,0} collective-permute(%get-tuple-element.390), channel_id=1, source_target_pairs={{0,1},{1,0},{2,3},{3,2}}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=271}
  %get-tuple-element.389 = c128[1,2,240,64]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=2, sharding={manual}
  %reshape.490 = c128[2,2,64]{2,1,0} reshape(%get-tuple-element.390), sharding={manual}
  %get-tuple-element.387 = c128[64,4,2,240]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=4, sharding={manual}
  %constant.1069 = s32[] constant(0), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %get-tuple-element.388 = s32[] get-tuple-element(%arg_tuple.11), index=3, sharding={manual}
  %get-tuple-element.391 = s64[] get-tuple-element(%arg_tuple.11), index=0, sharding={manual}
  %convert.93 = s32[] convert(%get-tuple-element.391), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %subtract.46 = s32[] subtract(%get-tuple-element.388, %convert.93), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1076 = s32[] constant(0), sharding={manual}
  %compare.130 = pred[] compare(%subtract.46, %constant.1076), direction=LT, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %negate.67 = s32[] negate(%subtract.46), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %select.264 = s32[] select(%compare.130, %negate.67, %subtract.46), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1077 = s32[] constant(1), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %and.39 = s32[] and(%select.264, %constant.1077), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %negate.68 = s32[] negate(%and.39), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %select.265 = s32[] select(%compare.130, %negate.68, %and.39), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1121 = s32[] constant(0), sharding={manual}
  %compare.127 = pred[] compare(%select.265, %constant.1121), direction=LT, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1120 = s32[] constant(0), sharding={manual}
  %compare.128 = pred[] compare(%select.265, %constant.1120), direction=NE, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %and.38 = pred[] and(%compare.127, %compare.128), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/and" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1075 = s32[] constant(2), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %add.688 = s32[] add(%select.265, %constant.1075), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %select.262 = s32[] select(%and.38, %add.688, %select.265), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %constant.1072 = s32[] constant(2), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %multiply.187 = s32[] multiply(%select.262, %constant.1072), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=265}
  %constant.1070 = s32[] constant(0), sharding={manual}
  %compare.129 = pred[] compare(%multiply.187, %constant.1070), direction=LT, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %constant.1073 = s32[] constant(4), sharding={manual}
  %add.689 = s32[] add(%multiply.187, %constant.1073), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %select.263 = s32[] select(%compare.129, %add.689, %multiply.187), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %dynamic-slice.71 = c128[64,2,2,240]{3,2,1,0} dynamic-slice(%get-tuple-element.387, %constant.1069, %select.263, %constant.1069, %constant.1069), dynamic_slice_sizes={64,2,2,240}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %dot.55 = c128[64,2,2,240]{3,2,1,0} dot(%reshape.490, %dynamic-slice.71), lhs_batch_dims={2}, lhs_contracting_dims={1}, rhs_batch_dims={0}, rhs_contracting_dims={1}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kvsN,bcvk->bcksN/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=269}
  %reshape.491 = c128[64,1,2,2,240]{4,3,2,1,0} reshape(%dot.55), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kvsN,bcvk->bcksN/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=269}
  %transpose.99 = c128[2,240,64,1,2]{1,4,0,3,2} transpose(%reshape.491), dimensions={2,4,0,1,3}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kvsN,bcvk->bcksN/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=269}
  %get-tuple-element.386 = c128[64,2,2,240]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=5, sharding={manual}
  %real.52 = f64[64,2,2,240]{3,2,1,0} real(%get-tuple-element.386), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %imag.41 = f64[64,2,2,240]{3,2,1,0} imag(%get-tuple-element.386), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %negate.66 = f64[64,2,2,240]{3,2,1,0} negate(%imag.41), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %complex.41 = c128[64,2,2,240]{3,2,1,0} complex(%real.52, %negate.66), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %transpose.98 = c128[2,240,64,2]{1,3,0,2} transpose(%complex.41), dimensions={1,3,0,2}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %reshape.492 = c128[2,240,64,1,2]{1,4,0,3,2} reshape(%transpose.98), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kcsN,bcksN->bcNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %multiply.188 = c128[2,240,64,1,2]{1,4,0,3,2} multiply(%transpose.99, %reshape.492), sharding={manual}
  %constant.1074 = c128[] constant((0, 0)), sharding={manual}
  %reduce.34 = c128[2,240,64,1]{1,0,3,2} reduce(%multiply.188, %constant.1074), dimensions={4}, to_apply=%scalar_add_computation, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kcsN,bcksN->bcNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %reshape.489 = c128[1,2,240,64]{3,2,1,0} reshape(%reduce.34), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kcsN,bcksN->bcNk/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  %add.690 = c128[1,2,240,64]{3,2,1,0} add(%get-tuple-element.389, %reshape.489), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270}
  ROOT %tuple.89 = (s64[], c128[1,2,2,64]{3,2,1,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) tuple(%add.687, %collective-permute.5, %add.690, %get-tuple-element.388, %get-tuple-element.387, /*index=5*/%get-tuple-element.386), sharding={{manual}, {manual}, {manual}, {manual}, {manual}, /*index=5*/{manual}}
  %constant.1071 = s32[] constant(0)
}

%region_4.1276.clone.clone.1 (arg_tuple.10: (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240])) -> pred[] {
  %arg_tuple.10 = (s64[], c128[1,2,2,64]{3,2,1,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) parameter(0), sharding={{manual}, {manual}, {manual}, {manual}, {manual}, /*index=5*/{manual}}
  %get-tuple-element.385 = s64[] get-tuple-element(%arg_tuple.10), index=0, sharding={manual}
  %constant.1067 = s64[] constant(2), sharding={manual}
  ROOT %compare.126 = pred[] compare(%get-tuple-element.385, %constant.1067), direction=LT, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274}
}

%scalar_add_computation.1 (scalar_lhs.1: c128[], scalar_rhs.1: c128[]) -> c128[] {
  %scalar_lhs.1 = c128[] parameter(0)
  %scalar_rhs.1 = c128[] parameter(1)
  ROOT %add.655 = c128[] add(%scalar_lhs.1, %scalar_rhs.1)
}

%region_2.1649.clone.clone.clone (arg_tuple.7: (s64[], c128[1024,200], f64[200], f64[200], c128[1024], /*index=5*/c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], f64[64,4], /*index=10*/f64[64,4], c128[480,480,4,4,4], c128[480,480])) -> (s64[], c128[1024,200], f64[200], f64[200], c128[1024], /*index=5*/c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], c128[64,4,2,480], f64[64,4], /*index=10*/f64[64,4], c128[480,480,4,4,4], c128[480,480]) {
  %arg_tuple.7 = (s64[], c128[1024,200]{1,0}, f64[200]{0}, f64[200]{0}, c128[1024]{0}, /*index=5*/c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, f64[64,4]{1,0}, /*index=10*/f64[64,4]{1,0}, c128[480,480,4,4,4]{4,3,2,1,0}, c128[480,480]{1,0}) parameter(0), sharding={{replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[2,2]<=[4] last_tile_dim_replicate}, /*index=5*/{devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, {devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, {devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, {devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, {replicated}, /*index=10*/{replicated}, {devices=[2,2,1,1,1]<=[4]}, {devices=[2,2]<=[4]}}
  %get-tuple-element.343 = s64[] get-tuple-element(%arg_tuple.7), index=0, sharding={replicated}
  %constant.1002 = s64[] constant(1), sharding={replicated}
  %add.668 = s64[] add(%get-tuple-element.343, %constant.1002), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=286}
  %get-tuple-element.341 = c128[1024,200]{1,0} get-tuple-element(%arg_tuple.7), index=1, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}
  %constant.1038 = s32[] constant(0), sharding={replicated}
  %broadcast.1095 = s32[2]{0} broadcast(%constant.1038), dimensions={}, sharding={replicated}
  %constant.1039 = s32[1]{0} constant({0}), sharding={replicated}
  %get-tuple-element.342 = s64[] get-tuple-element(%arg_tuple.7), index=0, sharding={replicated}
  %constant.1097 = s64[] constant(1), sharding={replicated}
  %add.675 = s64[] add(%get-tuple-element.342, %constant.1097), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.1024 = s64[] constant(199), sharding={replicated}
  %minimum.3 = s64[] minimum(%add.675, %constant.1024), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/min" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.1105 = s64[] constant(0), sharding={replicated}
  %compare.112 = pred[] compare(%minimum.3, %constant.1105), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %constant.1109 = s64[] constant(200), sharding={replicated}
  %add.676 = s64[] add(%minimum.3, %constant.1109), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %select.252 = s64[] select(%compare.112, %add.676, %minimum.3), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %convert.87 = s32[] convert(%select.252), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %reshape.445 = s32[1]{0} reshape(%convert.87), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=281}
  %concatenate.15 = s32[2]{0} concatenate(%constant.1039, %reshape.445), dimensions={0}, sharding={replicated}
  %compare.115 = pred[2]{0} compare(%broadcast.1095, %concatenate.15), direction=LE, sharding={replicated}
  %iota.20 = s32[2]{0} iota(), iota_dimension=0, sharding={replicated}
  %constant.1042 = s32[] constant(199), sharding={replicated}
  %broadcast.1102 = s32[2]{0} broadcast(%constant.1042), dimensions={}, sharding={replicated}
  %multiply.181 = s32[2]{0} multiply(%iota.20, %broadcast.1102), sharding={replicated}
  %compare.116 = pred[2]{0} compare(%multiply.181, %concatenate.15), direction=GE, sharding={replicated}
  %and.31 = pred[2]{0} and(%compare.115, %compare.116), sharding={replicated}
  %constant.1040 = pred[] constant(true)
  %reduce.31 = pred[] reduce(%and.31, %constant.1040), dimensions={0}, to_apply=%and.reduce_sub_computation, sharding={replicated}
  %broadcast.1096 = pred[1024,1]{1,0} broadcast(%reduce.31), dimensions={}, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}
  %constant.1045 = s64[] constant(-10), sharding={replicated}
  %add.679 = s64[] add(%get-tuple-element.342, %constant.1045), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=274}
  %constant.1099 = s64[] constant(0), sharding={replicated}
  %maximum.16 = s64[] maximum(%add.679, %constant.1099), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=274}
  %get-tuple-element.333 = f64[64,4]{1,0} get-tuple-element(%arg_tuple.7), index=9, sharding={replicated}
  %copy.30 = f64[64,4]{1,0} copy(%get-tuple-element.333), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=193}
  %copy.29 = f64[64,4]{1,0} copy(%copy.30), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=444}
  %transpose.80 = f64[4,64]{0,1} transpose(%copy.29), dimensions={1,0}, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %broadcast.1097 = f64[1,4,4,64]{3,2,1,0} broadcast(%transpose.80), dimensions={1,3}, sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %get-tuple-element.332 = f64[64,4]{1,0} get-tuple-element(%arg_tuple.7), index=10, sharding={replicated}
  %copy.28 = f64[64,4]{1,0} copy(%get-tuple-element.332), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=193}
  %copy.27 = f64[64,4]{1,0} copy(%copy.28), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=444}
  %transpose.81 = f64[4,64]{0,1} transpose(%copy.27), dimensions={1,0}, sharding={devices=[2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %broadcast.1098 = f64[1,4,4,64]{3,2,1,0} broadcast(%transpose.81), dimensions={2,3}, sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %subtract.41 = f64[1,4,4,64]{3,2,1,0} subtract(%broadcast.1097, %broadcast.1098), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %convert.82 = c128[1,4,4,64]{3,2,1,0} convert(%subtract.41), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=435}
  %get-tuple-element.338 = c128[1024]{0} get-tuple-element(%arg_tuple.7), index=4, sharding={devices=[2,2]<=[4] last_tile_dim_replicate}
  %reshape.441 = c128[1,4,4,64]{3,2,1,0} reshape(%get-tuple-element.338), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=191}
  %copy.26 = c128[1,4,4,64]{3,2,1,0} copy(%reshape.441), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/sharding_constraint" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=192}
  %copy.25 = c128[1,4,4,64]{3,2,1,0} copy(%copy.26), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=193}
  %copy.24 = c128[1,4,4,64]{3,2,1,0} copy(%copy.25), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=444}
  %multiply.172 = c128[1,4,4,64]{3,2,1,0} multiply(%convert.82, %copy.24), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=435}
  %copy.23 = c128[1,4,4,64]{3,2,1,0} copy(%multiply.172), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=444}
  %constant.1111 = s64[] constant(0), sharding={replicated}
  %constant.1110 = s64[] constant(0), sharding={manual}
  %copy.22 = c128[1,4,4,64]{3,2,1,0} copy(%copy.25), sharding={devices=[1,2,2,1]<=[4]}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %custom-call.219 = c128[1,2,2,64]{3,2,1,0} custom-call(%copy.22), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %constant.1008 = c128[] constant((0, 0)), sharding={manual}
  %broadcast.1091 = c128[1,2,240,64]{3,2,1,0} broadcast(%constant.1008), dimensions={}, sharding={manual}
  %partition-id.10 = u32[] partition-id(), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=246}
  %constant.1030 = u32[] constant(1), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=246}
  %and.29 = u32[] and(%partition-id.10, %constant.1030), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=246}
  %convert.83 = s32[] convert(%and.29), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=246}
  %get-tuple-element.334 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.7), index=8, sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}
  %copy.21 = c128[64,4,2,480]{3,2,1,0} copy(%get-tuple-element.334), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=193}
  %copy.20 = c128[64,4,2,480]{3,2,1,0} copy(%copy.21), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %custom-call.222 = c128[64,4,2,240]{3,2,1,0} custom-call(%copy.20), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %get-tuple-element.336 = c128[64,4,2,480]{3,2,1,0} get-tuple-element(%arg_tuple.7), index=6, sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}
  %copy.19 = c128[64,4,2,480]{3,2,1,0} copy(%get-tuple-element.336), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/pjit" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=193}
  %copy.18 = c128[64,4,2,480]{3,2,1,0} copy(%copy.19), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %custom-call.225 = c128[64,4,2,240]{3,2,1,0} custom-call(%copy.18), custom_call_target="SPMDFullToShardShape", sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/shard_map" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=445}
  %constant.1113 = s32[] constant(0), sharding={manual}
  %partition-id.11 = u32[] partition-id(), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %constant.1032 = u32[] constant(1), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %shift-right-logical.238 = u32[] shift-right-logical(%partition-id.11, %constant.1032), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %constant.1034 = u32[] constant(1), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %and.30 = u32[] and(%shift-right-logical.238, %constant.1034), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %convert.84 = s32[] convert(%and.30), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/axis_index" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=245}
  %constant.1116 = s32[] constant(2), sharding={manual}
  %multiply.173 = s32[] multiply(%convert.84, %constant.1116), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=253}
  %constant.1112 = s32[] constant(0), sharding={manual}
  %compare.108 = pred[] compare(%multiply.173, %constant.1112), direction=LT, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=255}
  %constant.1118 = s32[] constant(4), sharding={manual}
  %add.669 = s32[] add(%multiply.173, %constant.1118), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=255}
  %select.248 = s32[] select(%compare.108, %add.669, %multiply.173), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=255}
  %dynamic-slice.63 = c128[64,2,2,240]{3,2,1,0} dynamic-slice(%custom-call.225, %constant.1113, %select.248, %constant.1113, %constant.1113), dynamic_slice_sizes={64,2,2,240}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=255}
