HloModule jit__full_run, is_scheduled=true, entry_computation_layout={(c128[64,4,2,240]{3,2,1,0}, c128[64,4,2,240]{3,2,1,0}, c128[64,4,2,240]{3,2,1,0}, c128[64,4,2,240]{3,2,1,0}, f64[64,4]{1,0}, /*index=5*/f64[64,4]{1,0}, c128[240,240,4,4,4]{4,3,2,1,0}, c128[240,240]{1,0})->(f64[5]{0}, c128[5,1024]{1,0}, s32[])}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="51e85ec6e89dd189e3ef6db998be3698"}

%region_6.1287 (Arg_0.1288: c128[], Arg_1.1289: c128[]) -> c128[] {
  %Arg_1.1289 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" scheduling_name="Arg_1.1289"}
  %Arg_0.1288 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" scheduling_name="Arg_0.1288"}
  ROOT %add.1341 = c128[] add(%Arg_0.1288, %Arg_1.1289), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281 scheduling_name="add.1341"}
}

%fused_transpose (param_0.2: c128[1,2,240,64], param_1.23: c128[64,2,2,240], param_2.20: c128[64,2,480]) -> c128[1,2,240,64] {
  %param_0.2 = c128[1,2,240,64]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.2"}
  %param_2.20 = c128[64,2,480]{2,1,0} parameter(2), metadata={scheduling_name="param_2.20"}
  %bitcast.6718.5 = c128[1,64,2,2,240]{4,3,2,1,0} bitcast(%param_2.20), metadata={scheduling_name="bitcast.6718.5"}
  %param_1.23 = c128[64,2,2,240]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.23"}
  %real.141.3 = f64[64,2,2,240]{3,2,1,0} real(%param_1.23), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="real.141.3"}
  %imag.118.3 = f64[64,2,2,240]{3,2,1,0} imag(%param_1.23), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="imag.118.3"}
  %negate.165.3 = f64[64,2,2,240]{3,2,1,0} negate(%imag.118.3), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="negate.165.3"}
  %complex.118.5 = c128[64,2,2,240]{3,2,1,0} complex(%real.141.3, %negate.165.3), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="complex.118.5"}
  %bitcast.6728.5 = c128[1,64,2,2,240]{4,3,2,1,0} bitcast(%complex.118.5), metadata={scheduling_name="bitcast.6728.5"}
  %multiply.468.5 = c128[1,64,2,2,240]{4,3,2,1,0} multiply(%bitcast.6718.5, %bitcast.6728.5), metadata={scheduling_name="multiply.468.5"}
  %bitcast.6732.3 = c128[64,2,2,240]{3,2,1,0} bitcast(%multiply.468.5), metadata={scheduling_name="bitcast.6732.3"}
  %constant_1135_1 = c128[] constant((0, 0))
  %reduce.51.3 = c128[64,2,240]{2,1,0} reduce(%bitcast.6732.3, %constant_1135_1), dimensions={2}, to_apply=%region_6.1287, metadata={scheduling_name="reduce.51.3"}
  %bitcast.6736.3 = c128[64,480]{1,0} bitcast(%reduce.51.3), metadata={scheduling_name="bitcast.6736.3"}
  %transpose.371.3 = c128[480,64]{1,0} transpose(%bitcast.6736.3), dimensions={1,0}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kcsN,bcksN->bcNk/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="transpose.371.3"}
  %bitcast.6739.1 = c128[1,2,240,64]{3,2,1,0} bitcast(%transpose.371.3), metadata={scheduling_name="bitcast.6739.1"}
  ROOT %add.1348.1 = c128[1,2,240,64]{3,2,1,0} add(%param_0.2, %bitcast.6739.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="add.1348.1"}
}

%fused_dynamic_slice (param_0.13: c128[64,4,2,240], param_1.22: s32[], param_2.19: s64[]) -> c128[64,2,2,240] {
  %param_0.13 = c128[64,4,2,240]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.13"}
  %constant_1126_1 = s32[] constant(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266}
  %param_1.22 = s32[] parameter(1), metadata={scheduling_name="param_1.22"}
  %param_2.19 = s64[] parameter(2), metadata={scheduling_name="param_2.19"}
  %convert.197.1 = s32[] convert(%param_2.19), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="convert.197.1"}
  %subtract.75.1 = s32[] subtract(%param_1.22, %convert.197.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="subtract.75.1"}
  %compare.272.1 = pred[] compare(%subtract.75.1, %constant_1126_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="compare.272.1"}
  %negate.163.1 = s32[] negate(%subtract.75.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="negate.163.1"}
  %select.677.1 = s32[] select(%compare.272.1, %negate.163.1, %subtract.75.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="select.677.1"}
  %constant_1128_1 = s32[] constant(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %and.62.1 = s32[] and(%select.677.1, %constant_1128_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="and.62.1"}
  %negate.164.1 = s32[] negate(%and.62.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="negate.164.1"}
  %select.678.1 = s32[] select(%compare.272.1, %negate.164.1, %and.62.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/rem" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="select.678.1"}
  %compare.273.1 = pred[] compare(%select.678.1, %constant_1126_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="compare.273.1"}
  %compare.274.1 = pred[] compare(%select.678.1, %constant_1126_1), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="compare.274.1"}
  %and.63.1 = pred[] and(%compare.273.1, %compare.274.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/and" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="and.63.1"}
  %constant_1131_1 = s32[] constant(2), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264}
  %add.1346.1 = s32[] add(%select.678.1, %constant_1131_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="add.1346.1"}
  %select.680.1 = s32[] select(%and.63.1, %add.1346.1, %select.678.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/jit(remainder)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=264 scheduling_name="select.680.1"}
  %multiply.467.1 = s32[] multiply(%select.680.1, %constant_1131_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=265 scheduling_name="multiply.467.1"}
  %compare.275.1 = pred[] compare(%multiply.467.1, %constant_1126_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266 scheduling_name="compare.275.1"}
  %constant_1134_1 = s32[] constant(4)
  %add.1347.1 = s32[] add(%multiply.467.1, %constant_1134_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266 scheduling_name="add.1347.1"}
  %select.681.1 = s32[] select(%compare.275.1, %add.1347.1, %multiply.467.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266 scheduling_name="select.681.1"}
  ROOT %dynamic-slice.138.1 = c128[64,2,2,240]{3,2,1,0} dynamic-slice(%param_0.13, %constant_1126_1, %select.681.1, %constant_1126_1, %constant_1126_1), dynamic_slice_sizes={64,2,2,240}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266 scheduling_name="dynamic-slice.138.1"}
}

%fused_add (param_0.14: s64[]) -> s64[] {
  %param_0.14 = s64[] parameter(0), metadata={scheduling_name="param_0.14"}
  %constant_1125_1 = s64[] constant(1)
  ROOT %add.1345.1 = s64[] add(%param_0.14, %constant_1125_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274 scheduling_name="add.1345.1"}
}

%region_3.1259.clone.clone.clone.1_spmd (param.10.0: (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240])) -> (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240]) {
  %param.10.0 = (s64[], c128[1,2,2,64]{2,1,3,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) parameter(0), metadata={scheduling_name="param.10.0"}
  %get-tuple-element.504 = c128[1,2,2,64]{2,1,3,0} get-tuple-element(%param.10.0), index=1, metadata={scheduling_name="get-tuple-element.504"}
  %copy.117 = c128[1,2,2,64]{2,1,3,0} copy(%get-tuple-element.504), metadata={scheduling_name="copy.117"}
  %collective-permute-start = (c128[1,2,2,64]{2,1,3,0}, c128[1,2,2,64]{2,1,3,0}) collective-permute-start(%copy.117), channel_id=1, source_target_pairs={{0,1},{1,0},{2,3},{3,2}}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=271 scheduling_name="collective-permute-start"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %get-tuple-element.503 = s64[] get-tuple-element(%param.10.0), index=0, metadata={scheduling_name="get-tuple-element.503"}
  %get-tuple-element.512 = s32[] get-tuple-element(%param.10.0), index=3, metadata={scheduling_name="get-tuple-element.512"}
  %get-tuple-element.513 = c128[64,4,2,240]{3,2,1,0} get-tuple-element(%param.10.0), index=4, metadata={scheduling_name="get-tuple-element.513"}
  %loop_dynamic_slice_fusion = c128[64,2,2,240]{3,2,1,0} fusion(%get-tuple-element.513, %get-tuple-element.512, %get-tuple-element.503), kind=kLoop, calls=%fused_dynamic_slice, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=266 scheduling_name="loop_dynamic_slice_fusion"}
  %bitcast.6671.0 = c128[64,2,2]{2,1,0} bitcast(%copy.117), metadata={scheduling_name="bitcast.6671.0"}
  %bitcast.6715.0 = c128[64,2,480]{2,1,0} bitcast(%loop_dynamic_slice_fusion), metadata={scheduling_name="bitcast.6715.0"}
  %custom-call.260.0 = (c128[64,2,480]{2,1,0}, s8[987136]{0}) custom-call(%bitcast.6671.0, %bitcast.6715.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kvsN,bcvk->bcksN/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=269 scheduling_name="custom-call.260.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"4","rhs_stride":"960","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.514 = c128[64,2,2,240]{3,2,1,0} get-tuple-element(%param.10.0), index=5, metadata={scheduling_name="get-tuple-element.514"}
  %get-tuple-element.505 = c128[1,2,240,64]{3,2,1,0} get-tuple-element(%param.10.0), index=2, metadata={scheduling_name="get-tuple-element.505"}
  %get-tuple-element.470.0 = c128[64,2,480]{2,1,0} get-tuple-element(%custom-call.260.0), index=0, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/kvsN,bcvk->bcksN/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=269 scheduling_name="get-tuple-element.470.0"}
  %input_transpose_fusion = c128[1,2,240,64]{3,2,1,0} fusion(%get-tuple-element.505, %get-tuple-element.514, %get-tuple-element.470.0), kind=kInput, calls=%fused_transpose, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=270 scheduling_name="input_transpose_fusion"}
  %loop_add_fusion = s64[] fusion(%get-tuple-element.503), kind=kLoop, calls=%fused_add, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274 deduplicated_name="loop_add_fusion" scheduling_name="loop_add_fusion"}
  %collective-permute-done = c128[1,2,2,64]{2,1,3,0} collective-permute-done(%collective-permute-start), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=271 scheduling_name="collective-permute-done"}
  ROOT %tuple.115 = (s64[], c128[1,2,2,64]{2,1,3,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) tuple(%loop_add_fusion, %collective-permute-done, %input_transpose_fusion, %get-tuple-element.512, %get-tuple-element.513, /*index=5*/%get-tuple-element.514), metadata={scheduling_name="tuple.115"}
}

%fused_compare.1 (param_0.1: s64[]) -> pred[] {
  %param_0.1 = s64[] parameter(0), metadata={scheduling_name="param_0.1"}
  %constant_1123_1 = s64[] constant(2)
  ROOT %compare.271.1 = pred[] compare(%param_0.1, %constant_1123_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274 scheduling_name="compare.271.1"}
}

%region_4.1276.clone.clone.1_spmd (param.9.0: (s64[], c128[1,2,2,64], c128[1,2,240,64], s32[], c128[64,4,2,240], /*index=5*/c128[64,2,2,240])) -> pred[] {
  %param.9.0 = (s64[], c128[1,2,2,64]{2,1,3,0}, c128[1,2,240,64]{3,2,1,0}, s32[], c128[64,4,2,240]{3,2,1,0}, /*index=5*/c128[64,2,2,240]{3,2,1,0}) parameter(0), metadata={scheduling_name="param.9.0"}
  %get-tuple-element.401.0 = s64[] get-tuple-element(%param.9.0), index=0, metadata={scheduling_name="get-tuple-element.401.0"}
  ROOT %loop_compare_fusion.1 = pred[] fusion(%get-tuple-element.401.0), kind=kLoop, calls=%fused_compare.1, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=274 deduplicated_name="loop_compare_fusion.1" scheduling_name="loop_compare_fusion.1"}
}

%fused_add.1 (param_0.16: c128[1,240,64], param_1.33: c128[1,2,240,64]) -> c128[1,240,64] {
  %param_0.16 = c128[1,240,64]{2,1,0} parameter(0), metadata={scheduling_name="param_0.16"}
  %param_1.33 = c128[1,2,240,64]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.33"}
  %bitcast.6759.3 = c128[2,240,64]{2,1,0} bitcast(%param_1.33), metadata={scheduling_name="bitcast.6759.3"}
  %constant_1138_1 = c128[] constant((0, 0))
  %reduce.50.3 = c128[240,64]{1,0} reduce(%bitcast.6759.3, %constant_1138_1), dimensions={0}, to_apply=%region_6.1287, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281 scheduling_name="reduce.50.3"}
  %bitcast.6763.1 = c128[1,240,64]{2,1,0} bitcast(%reduce.50.3), metadata={scheduling_name="bitcast.6763.1"}
  ROOT %add.1350.1 = c128[1,240,64]{2,1,0} add(%param_0.16, %bitcast.6763.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281 scheduling_name="add.1350.1"}
}

%fused_add.2 (param_0.20: s64[]) -> s64[] {
  %param_0.20 = s64[] parameter(0), metadata={scheduling_name="param_0.20"}
  %constant_1137_1 = s64[] constant(1)
  ROOT %add.1349.1 = s64[] add(%param_0.20, %constant_1137_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285 scheduling_name="add.1349.1"}
}

%region_5.1299_spmd (param.12.0: (s64[], c128[1,2,240,64], c128[1,240,64])) -> (s64[], c128[1,2,240,64], c128[1,240,64]) {
  %param.12.0 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), metadata={scheduling_name="param.12.0"}
  %get-tuple-element.519 = c128[1,2,240,64]{3,2,1,0} get-tuple-element(%param.12.0), index=1, metadata={scheduling_name="get-tuple-element.519"}
  %copy.126 = c128[1,2,240,64]{3,2,1,0} copy(%get-tuple-element.519), metadata={scheduling_name="copy.126"}
  %collective-permute-start.1 = (c128[1,2,240,64]{3,2,1,0}, c128[1,2,240,64]{3,2,1,0}) collective-permute-start(%copy.126), channel_id=2, source_target_pairs={{0,2},{2,0},{1,3},{3,1}}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=282 scheduling_name="collective-permute-start.1"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":true,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %get-tuple-element.518 = s64[] get-tuple-element(%param.12.0), index=0, metadata={scheduling_name="get-tuple-element.518"}
  %loop_add_fusion.2 = s64[] fusion(%get-tuple-element.518), kind=kLoop, calls=%fused_add.2, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285 deduplicated_name="loop_add_fusion" scheduling_name="loop_add_fusion.2"}
  %get-tuple-element.520 = c128[1,240,64]{2,1,0} get-tuple-element(%param.12.0), index=2, metadata={scheduling_name="get-tuple-element.520"}
  %loop_add_fusion.1 = c128[1,240,64]{2,1,0} fusion(%get-tuple-element.520, %copy.126), kind=kLoop, calls=%fused_add.1, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281 scheduling_name="loop_add_fusion.1"}
  %collective-permute-done.1 = c128[1,2,240,64]{3,2,1,0} collective-permute-done(%collective-permute-start.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=282 scheduling_name="collective-permute-done.1"}
  ROOT %tuple.118 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) tuple(%loop_add_fusion.2, %collective-permute-done.1, %loop_add_fusion.1), metadata={scheduling_name="tuple.118"}
}

%fused_compare.2 (param_0.15: s64[]) -> pred[] {
  %param_0.15 = s64[] parameter(0), metadata={scheduling_name="param_0.15"}
  %constant_1136_1 = s64[] constant(2)
  ROOT %compare.276.1 = pred[] compare(%param_0.15, %constant_1136_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285 scheduling_name="compare.276.1"}
}

%region_7.1310_spmd (param.11.0: (s64[], c128[1,2,240,64], c128[1,240,64])) -> pred[] {
  %param.11.0 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), metadata={scheduling_name="param.11.0"}
  %get-tuple-element.409.0 = s64[] get-tuple-element(%param.11.0), index=0, metadata={scheduling_name="get-tuple-element.409.0"}
  ROOT %loop_compare_fusion.2 = pred[] fusion(%get-tuple-element.409.0), kind=kLoop, calls=%fused_compare.2, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285 deduplicated_name="loop_compare_fusion.1" scheduling_name="loop_compare_fusion.2"}
}

%fused_subtract (param_0.21: c128[512], param_1.52: c128[512,200], param_2.46: s64[], param_3.33: c128[], param_4.29: s64[]) -> c128[512] {
  %param_0.21 = c128[512]{0} parameter(0), metadata={scheduling_name="param_0.21"}
  %param_2.46 = s64[] parameter(2), metadata={scheduling_name="param_2.46"}
  %param_4.29 = s64[] parameter(4), metadata={scheduling_name="param_4.29"}
  %compare.278.3 = pred[] compare(%param_2.46, %param_4.29), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=269 scheduling_name="compare.278.3"}
  %param_3.33 = c128[] parameter(3), metadata={scheduling_name="param_3.33"}
  %constant_1145_2 = c128[] constant((0, 0))
  %select.683.3 = c128[] select(%compare.278.3, %param_3.33, %constant_1145_2), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="select.683.3"}
  %broadcast.2153.1 = c128[512,1]{1,0} broadcast(%select.683.3), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272 scheduling_name="broadcast.2153.1"}
  %param_1.52 = c128[512,200]{1,0} parameter(1), metadata={scheduling_name="param_1.52"}
  %constant_1142_2 = s64[] constant(0)
  %compare.279.2 = pred[] compare(%param_2.46, %constant_1142_2), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="compare.279.2"}
  %constant_1143_1 = s64[] constant(200)
  %add.1357.2 = s64[] add(%param_2.46, %constant_1143_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="add.1357.2"}
  %select.682.1 = s64[] select(%compare.279.2, %add.1357.2, %param_2.46), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="select.682.1"}
  %dynamic-slice.139.3 = c128[512,1]{1,0} dynamic-slice(%param_1.52, %constant_1142_2, %select.682.1), dynamic_slice_sizes={512,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="dynamic-slice.139.3"}
  %multiply.470.1 = c128[512,1]{1,0} multiply(%broadcast.2153.1, %dynamic-slice.139.3), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272 scheduling_name="multiply.470.1"}
  %bitcast.6835.1 = c128[512]{0} bitcast(%multiply.470.1), metadata={scheduling_name="bitcast.6835.1"}
  ROOT %subtract.76.1 = c128[512]{0} subtract(%param_0.21, %bitcast.6835.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272 scheduling_name="subtract.76.1"}
}

%fused_reduce (param_0.41: c128[512], param_1.58: c128[512,200], param_2.47: s64[]) -> c128[] {
  %param_1.58 = c128[512,200]{1,0} parameter(1), metadata={scheduling_name="param_1.58"}
  %constant_1142_1 = s64[] constant(0)
  %param_2.47 = s64[] parameter(2), metadata={scheduling_name="param_2.47"}
  %compare.279.4 = pred[] compare(%param_2.47, %constant_1142_1), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="compare.279.4"}
  %constant_1143_2 = s64[] constant(200)
  %add.1357.4 = s64[] add(%param_2.47, %constant_1143_2), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="add.1357.4"}
  %select.682.4 = s64[] select(%compare.279.4, %add.1357.4, %param_2.47), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="select.682.4"}
  %dynamic-slice.139.13 = c128[512,1]{1,0} dynamic-slice(%param_1.58, %constant_1142_1, %select.682.4), dynamic_slice_sizes={512,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=270 scheduling_name="dynamic-slice.139.13"}
  %real.142.5 = f64[512,1]{1,0} real(%dynamic-slice.139.13), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="real.142.5"}
  %imag.119.7 = f64[512,1]{1,0} imag(%dynamic-slice.139.13), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="imag.119.7"}
  %negate.166.5 = f64[512,1]{1,0} negate(%imag.119.7), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="negate.166.5"}
  %complex.119.3 = c128[512,1]{1,0} complex(%real.142.5, %negate.166.5), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="complex.119.3"}
  %bitcast.6822.3 = c128[512]{0} bitcast(%complex.119.3), metadata={scheduling_name="bitcast.6822.3"}
  %param_0.41 = c128[512]{0} parameter(0), metadata={scheduling_name="param_0.41"}
  %multiply.469.3 = c128[512]{0} multiply(%bitcast.6822.3, %param_0.41), metadata={scheduling_name="multiply.469.3"}
  %constant_1145_1 = c128[] constant((0, 0))
  ROOT %reduce.38.1 = c128[] reduce(%multiply.469.3, %constant_1145_1), dimensions={0}, to_apply=%region_6.1287, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="reduce.38.1"}
}

%fused_add.3 (param_0.40: s64[]) -> s64[] {
  %param_0.40 = s64[] parameter(0), metadata={scheduling_name="param_0.40"}
  %constant_1140_1 = s64[] constant(1)
  ROOT %add.1356.1 = s64[] add(%param_0.40, %constant_1140_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275 scheduling_name="add.1356.1"}
}

%scalar_add_computation.clone.1 (scalar_lhs.3: c128[], scalar_rhs.3: c128[]) -> c128[] {
  %scalar_rhs.3 = c128[] parameter(1), metadata={scheduling_name="scalar_rhs.3"}
  %scalar_lhs.3 = c128[] parameter(0), metadata={scheduling_name="scalar_lhs.3"}
  ROOT %add.1355 = c128[] add(%scalar_lhs.3, %scalar_rhs.3), metadata={scheduling_name="add.1355"}
}

%region_11.1504_spmd (param.14.0: (s64[], c128[512], s64[], s64[], c128[512,200])) -> (s64[], c128[512], s64[], s64[], c128[512,200]) {
  %param.14.0 = (s64[], c128[512]{0}, s64[], s64[], c128[512,200]{1,0}) parameter(0), metadata={scheduling_name="param.14.0"}
  %get-tuple-element.529 = s64[] get-tuple-element(%param.14.0), index=0, metadata={scheduling_name="get-tuple-element.529"}
  %copy.135 = s64[] copy(%get-tuple-element.529), metadata={scheduling_name="copy.135"}
  %get-tuple-element.538 = c128[512,200]{1,0} get-tuple-element(%param.14.0), index=4, metadata={scheduling_name="get-tuple-element.538"}
  %get-tuple-element.530 = c128[512]{0} get-tuple-element(%param.14.0), index=1, metadata={scheduling_name="get-tuple-element.530"}
  %input_reduce_fusion = c128[] fusion(%get-tuple-element.530, %get-tuple-element.538, %copy.135), kind=kInput, calls=%fused_reduce, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="input_reduce_fusion"}
  %all-reduce-start = c128[] all-reduce-start(%input_reduce_fusion), channel_id=12, replica_groups=[2,2]<=[2,2]T(1,0), use_global_device_ids=true, to_apply=%scalar_add_computation.clone.1, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="all-reduce-start"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":true,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %loop_add_fusion.3 = s64[] fusion(%copy.135), kind=kLoop, calls=%fused_add.3, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275 deduplicated_name="loop_add_fusion" scheduling_name="loop_add_fusion.3"}
  %all-reduce-done = c128[] all-reduce-done(%all-reduce-start), metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=271 scheduling_name="all-reduce-done"}
  %get-tuple-element.537 = s64[] get-tuple-element(%param.14.0), index=3, metadata={scheduling_name="get-tuple-element.537"}
  %loop_subtract_fusion = c128[512]{0} fusion(%get-tuple-element.530, %get-tuple-element.538, %copy.135, %all-reduce-done, %get-tuple-element.537), kind=kLoop, calls=%fused_subtract, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=272 scheduling_name="loop_subtract_fusion"}
  %get-tuple-element.536 = s64[] get-tuple-element(%param.14.0), index=2, metadata={scheduling_name="get-tuple-element.536"}
  ROOT %tuple.121 = (s64[], c128[512]{0}, s64[], s64[], c128[512,200]{1,0}) tuple(%loop_add_fusion.3, %loop_subtract_fusion, %get-tuple-element.536, %get-tuple-element.537, %get-tuple-element.538), metadata={scheduling_name="tuple.121"}
}

%wrapped_compare_computation (param_0.824: s64[], param_1.1025: s64[]) -> pred[] {
  %param_0.824 = s64[] parameter(0), metadata={scheduling_name="param_0.824"}
  %param_1.1025 = s64[] parameter(1), metadata={scheduling_name="param_1.1025"}
  ROOT %compare.277.1 = pred[] compare(%param_0.824, %param_1.1025), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275 scheduling_name="compare.277.1"}
}

%region_12.1532_spmd (param.13.0: (s64[], c128[512], s64[], s64[], c128[512,200])) -> pred[] {
  %param.13.0 = (s64[], c128[512]{0}, s64[], s64[], c128[512,200]{1,0}) parameter(0), metadata={scheduling_name="param.13.0"}
  %get-tuple-element.414.0 = s64[] get-tuple-element(%param.13.0), index=2, metadata={scheduling_name="get-tuple-element.414.0"}
  %get-tuple-element.413.0 = s64[] get-tuple-element(%param.13.0), index=0, metadata={scheduling_name="get-tuple-element.413.0"}
  ROOT %wrapped_compare = pred[] fusion(%get-tuple-element.413.0, %get-tuple-element.414.0), kind=kLoop, calls=%wrapped_compare_computation, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=275 scheduling_name="wrapped_compare"}
}

%fused_subtract.1 (param_0.203: c128[1,2,4,64], param_1.217: c128[512], param_2.135: c128[512,200], param_3.121: s64[], param_4.118: c128[], param_5.81: f64[200]) -> c128[512] {
  %param_0.203 = c128[1,2,4,64]{3,1,0,2} parameter(0), metadata={scheduling_name="param_0.203"}
  %bitcast.7263.5 = c128[4,2,64]{2,1,0} bitcast(%param_0.203), metadata={scheduling_name="bitcast.7263.5"}
  %transpose.390.5 = c128[2,4,64]{2,1,0} transpose(%bitcast.7263.5), dimensions={1,0,2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=197 scheduling_name="transpose.390.5"}
  %bitcast.7276.4 = c128[512]{0} bitcast(%transpose.390.5), metadata={scheduling_name="bitcast.7276.4"}
  %param_4.118 = c128[] parameter(4), metadata={scheduling_name="param_4.118"}
  %real.153.2 = f64[] real(%param_4.118), metadata={op_name="jit(_full_run)/jit(main)/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=260 scheduling_name="real.153.2"}
  %convert.204.1 = c128[] convert(%real.153.2), metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263 scheduling_name="convert.204.1"}
  %broadcast.2172.1 = c128[512]{0} broadcast(%convert.204.1), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263 scheduling_name="broadcast.2172.1"}
  %param_1.217 = c128[512]{0} parameter(1), metadata={scheduling_name="param_1.217"}
  %multiply.489.1 = c128[512]{0} multiply(%broadcast.2172.1, %param_1.217), metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263 scheduling_name="multiply.489.1"}
  %subtract.79.3 = c128[512]{0} subtract(%bitcast.7276.4, %multiply.489.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=263 scheduling_name="subtract.79.3"}
  %param_3.121 = s64[] parameter(3), metadata={scheduling_name="param_3.121"}
  %constant_1160_4 = s64[] constant(0)
  %compare.285.3 = pred[] compare(%param_3.121, %constant_1160_4), direction=GT, metadata={op_name="jit(_full_run)/jit(main)/while/body/gt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="compare.285.3"}
  %param_5.81 = f64[200]{0} parameter(5), metadata={scheduling_name="param_5.81"}
  %constant_1239_1 = s64[] constant(-1)
  %add.1365.4 = s64[] add(%param_3.121, %constant_1239_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="add.1365.4"}
  %compare.286.3 = pred[] compare(%add.1365.4, %constant_1160_4), direction=LT, metadata={op_name="jit(_full_run)/jit(main)/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="compare.286.3"}
  %constant_1159_1 = s64[] constant(199)
  %add.1366.3 = s64[] add(%param_3.121, %constant_1159_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="add.1366.3"}
  %select.687.3 = s64[] select(%compare.286.3, %add.1366.3, %add.1365.4), metadata={op_name="jit(_full_run)/jit(main)/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="select.687.3"}
  %dynamic-slice.148.3 = f64[1]{0} dynamic-slice(%param_5.81, %select.687.3), dynamic_slice_sizes={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="dynamic-slice.148.3"}
  %bitcast.7311.3 = f64[] bitcast(%dynamic-slice.148.3), metadata={scheduling_name="bitcast.7311.3"}
  %constant_1242_2 = f64[] constant(0)
  %select.688.3 = f64[] select(%compare.285.3, %bitcast.7311.3, %constant_1242_2), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=265 scheduling_name="select.688.3"}
  %convert.205.1 = c128[] convert(%select.688.3), metadata={op_name="jit(_full_run)/jit(main)/while/body/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266 scheduling_name="convert.205.1"}
  %broadcast.2173.1 = c128[512,1]{1,0} broadcast(%convert.205.1), dimensions={}, metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266 scheduling_name="broadcast.2173.1"}
  %param_2.135 = c128[512,200]{1,0} parameter(2), metadata={scheduling_name="param_2.135"}
  %maximum.38.1 = s64[] maximum(%add.1365.4, %constant_1160_4), metadata={op_name="jit(_full_run)/jit(main)/while/body/max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=264 scheduling_name="maximum.38.1"}
  %dynamic-slice.149.1 = c128[512,1]{1,0} dynamic-slice(%param_2.135, %constant_1160_4, %maximum.38.1), dynamic_slice_sizes={512,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=264 scheduling_name="dynamic-slice.149.1"}
  %multiply.490.1 = c128[512,1]{1,0} multiply(%broadcast.2173.1, %dynamic-slice.149.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266 scheduling_name="multiply.490.1"}
  %bitcast.7328.1 = c128[512]{0} bitcast(%multiply.490.1), metadata={scheduling_name="bitcast.7328.1"}
  ROOT %subtract.80.1 = c128[512]{0} subtract(%subtract.79.3, %bitcast.7328.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=266 scheduling_name="subtract.80.1"}
}

%fused_transpose.1 (param_0.226: c128[64,2,2], param_1.245: c128[1,2,2,64], param_2.228: c128[512], param_3.126: f64[64,4], param_4.117: f64[64,4], param_5.82: s32[4], param_6.67: u32[], param_7.32: u32[4], param_8.13: u32[4]) -> c128[2,128] {
  %param_3.126 = f64[64,4]{0,1} parameter(3), metadata={scheduling_name="param_3.126"}
  %bitcast.6891.3 = f64[4,64]{1,0} bitcast(%param_3.126), metadata={scheduling_name="bitcast.6891.3"}
  %constant_1540_1 = u32[1]{0} constant({0}), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %param_8.13 = u32[4]{0} parameter(8), metadata={scheduling_name="param_8.13"}
  %param_6.67 = u32[] parameter(6), metadata={scheduling_name="param_6.67"}
  %dynamic-slice.140.1 = u32[1]{0} dynamic-slice(%param_8.13, %param_6.67), dynamic_slice_sizes={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="dynamic-slice.140.1"}
  %constant_1541_1 = u32[1]{0} constant({1}), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434}
  %clamp.8.1 = u32[1]{0} clamp(%constant_1540_1, %dynamic-slice.140.1, %constant_1541_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="clamp.8.1"}
  %convert.199.1 = s32[1]{0} convert(%clamp.8.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="convert.199.1"}
  %constant_1557_1 = s32[1]{0} constant({2})
  %multiply.472.1 = s32[1]{0} multiply(%convert.199.1, %constant_1557_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="multiply.472.1"}
  %bitcast.6904.3 = s32[] bitcast(%multiply.472.1), metadata={scheduling_name="bitcast.6904.3"}
  %constant_1156_7 = s32[] constant(0)
  %dynamic-slice.141.3 = f64[2,64]{1,0} dynamic-slice(%bitcast.6891.3, %bitcast.6904.3, %constant_1156_7), dynamic_slice_sizes={2,64}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="dynamic-slice.141.3"}
  %broadcast.2157.1 = f64[2,64,1,2]{3,2,1,0} broadcast(%dynamic-slice.141.3), dimensions={0,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="broadcast.2157.1"}
  %param_4.117 = f64[64,4]{1,0} parameter(4), metadata={scheduling_name="param_4.117"}
  %param_7.32 = u32[4]{0} parameter(7), metadata={scheduling_name="param_7.32"}
  %dynamic-slice.142.1 = u32[1]{0} dynamic-slice(%param_7.32, %param_6.67), dynamic_slice_sizes={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="dynamic-slice.142.1"}
  %clamp.9.1 = u32[1]{0} clamp(%constant_1540_1, %dynamic-slice.142.1, %constant_1541_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="clamp.9.1"}
  %convert.200.1 = s32[1]{0} convert(%clamp.9.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="convert.200.1"}
  %multiply.473.1 = s32[1]{0} multiply(%convert.200.1, %constant_1557_1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="multiply.473.1"}
  %bitcast.6927.3 = s32[] bitcast(%multiply.473.1), metadata={scheduling_name="bitcast.6927.3"}
  %dynamic-slice.143.3 = f64[64,2]{1,0} dynamic-slice(%param_4.117, %constant_1156_7, %bitcast.6927.3), dynamic_slice_sizes={64,2}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="dynamic-slice.143.3"}
  %broadcast.2158.1 = f64[2,64,1,2]{3,2,1,0} broadcast(%dynamic-slice.143.3), dimensions={1,3}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="broadcast.2158.1"}
  %subtract.77.1 = f64[2,64,1,2]{3,2,1,0} subtract(%broadcast.2157.1, %broadcast.2158.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=434 scheduling_name="subtract.77.1"}
  %convert.201.1 = c128[2,64,1,2]{3,2,1,0} convert(%subtract.77.1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(_apply_D_term)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=435 scheduling_name="convert.201.1"}
  %param_2.228 = c128[512]{0} parameter(2), metadata={scheduling_name="param_2.228"}
  %bitcast.6934.11 = c128[1,2,4,64]{3,2,1,0} bitcast(%param_2.228), metadata={scheduling_name="bitcast.6934.11"}
  %param_5.82 = s32[4]{0} parameter(5), metadata={scheduling_name="param_5.82"}
  %dynamic-slice.144.1 = s32[1]{0} dynamic-slice(%param_5.82, %param_6.67), dynamic_slice_sizes={1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=191 scheduling_name="dynamic-slice.144.1"}
  %bitcast.6943.11 = s32[] bitcast(%dynamic-slice.144.1), metadata={scheduling_name="bitcast.6943.11"}
  %dynamic-slice.145.11 = c128[1,2,2,64]{3,2,1,0} dynamic-slice(%bitcast.6934.11, %constant_1156_7, %constant_1156_7, %bitcast.6943.11, %constant_1156_7), dynamic_slice_sizes={1,2,2,64}, metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=191 scheduling_name="dynamic-slice.145.11"}
  %bitcast.6945.6 = c128[2,2,64]{2,1,0} bitcast(%dynamic-slice.145.11), metadata={scheduling_name="bitcast.6945.6"}
  %transpose.372.5 = c128[2,64,2]{2,1,0} transpose(%bitcast.6945.6), dimensions={0,2,1}, metadata={op_name="jit(_full_run)/jit(main)/while/body/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_lanczos.py" source_line=191 scheduling_name="transpose.372.5"}
  %bitcast.6948.7 = c128[2,64,1,2]{3,2,1,0} bitcast(%transpose.372.5), metadata={scheduling_name="bitcast.6948.7"}
