HloModule jit__einsum, entry_computation_layout={(f64[9,1963,3]{2,1,0}, f64[3,3]{1,0}, f64[9,1963,3]{2,1,0}, f64[3,1963,3]{2,1,0}, f64[3,1963,3]{2,1,0})->(f64[9,1963]{1,0}, f64[1963,9,3]{2,1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true,true}

ENTRY %main.14 (Arg_0.1: f64[9,1963,3], Arg_1.2: f64[3,3], Arg_2.3: f64[9,1963,3], Arg_3.4: f64[3,1963,3], Arg_4.5: f64[3,1963,3]) -> (f64[9,1963], f64[1963,9,3]) {
  %Arg_2.3 = f64[9,1963,3]{2,1,0} parameter(2)
  %Arg_1.2 = f64[3,3]{1,0} parameter(1)
  %Arg_0.1 = f64[9,1963,3]{2,1,0} parameter(0)
  %dot.6 = f64[3,9,1963]{2,1,0} dot(%Arg_1.2, %Arg_0.1), lhs_contracting_dims={0}, rhs_contracting_dims={2}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %dot.8 = f64[9,1963]{1,0} dot(%Arg_2.3, %dot.6), lhs_batch_dims={0,1}, lhs_contracting_dims={2}, rhs_batch_dims={1,2}, rhs_contracting_dims={0}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %Arg_4.5 = f64[3,1963,3]{2,1,0} parameter(4)
  %dot.9 = f64[1963,3,9]{2,1,0} dot(%Arg_4.5, %dot.6), lhs_batch_dims={1}, lhs_contracting_dims={2}, rhs_batch_dims={2}, rhs_contracting_dims={0}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %transpose.11 = f64[1963,9,3]{1,2,0} transpose(%dot.9), dimensions={0,2,1}, metadata={op_name="jit(_einsum)/jit(main)/transpose" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %Arg_3.4 = f64[3,1963,3]{2,1,0} parameter(3)
  %dot.7 = f64[3,3,1963]{2,1,0} dot(%Arg_1.2, %Arg_3.4), lhs_contracting_dims={0}, rhs_contracting_dims={2}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %dot.10 = f64[1963,9,3]{2,1,0} dot(%Arg_2.3, %dot.7), lhs_batch_dims={1}, lhs_contracting_dims={2}, rhs_batch_dims={2}, rhs_contracting_dims={0}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  %add.12 = f64[1963,9,3]{1,2,0} add(%transpose.11, %dot.10), metadata={op_name="jit(_einsum)/jit(main)/add_any" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=644}
  ROOT %tuple.13 = (f64[9,1963]{1,0}, f64[1963,9,3]{1,2,0}) tuple(%dot.8, %add.12)
}

