HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(f64[40]{0})->f64[40]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="233f75712d48200786131fc06ea6cd04"}

ENTRY %main.2 (Arg_0.1.0: f64[40]) -> f64[40] {
  %Arg_0.1.0 = f64[40]{0} parameter(0), metadata={op_name="args[0]" scheduling_name="Arg_0.1.0"}
  ROOT %copy.1 = f64[40]{0} copy(%Arg_0.1.0)
}

