HloModule jit__take, entry_computation_layout={(c128[9,1963]{1,0}, s32[9]{0})->c128[9,1963]{1,0}}, allow_spmd_sharding_propagation_to_parameters={false,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4

%_where.16 (Arg_0.17: pred[9], Arg_1.18: s32[9], Arg_2.19: s32[9]) -> s32[9] {
  %Arg_0.17 = pred[9]{0} parameter(0), metadata={op_name="jit(_take)/jit(main)/pjit"}
  %Arg_1.18 = s32[9]{0} parameter(1), metadata={op_name="jit(_take)/jit(main)/pjit"}
  %Arg_2.19 = s32[9]{0} parameter(2), metadata={op_name="jit(_take)/jit(main)/pjit"}
  ROOT %select.20 = s32[9]{0} select(%Arg_0.17, %Arg_1.18, %Arg_2.19), metadata={op_name="jit(_take)/jit(main)/jit(_where)/select_n" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=598}
}

%region_0.27 (Arg_0.28: pred[], Arg_1.29: pred[]) -> pred[] {
  %Arg_0.28 = pred[] parameter(0), metadata={op_name="jit(_take)/jit(main)/reduce_and"}
  %Arg_1.29 = pred[] parameter(1), metadata={op_name="jit(_take)/jit(main)/reduce_and"}
  ROOT %and.30 = pred[] and(%Arg_0.28, %Arg_1.29), metadata={op_name="jit(_take)/jit(main)/reduce_and" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
}

ENTRY %main.35 (Arg_0.1: c128[9,1963], Arg_1.2: s32[9]) -> c128[9,1963] {
  %Arg_1.2 = s32[9]{0} parameter(1), metadata={op_name="indices"}
  %constant.12 = s32[] constant(0)
  %broadcast.13 = s32[9]{0} broadcast(%constant.12), dimensions={}
  %compare.14 = pred[9]{0} compare(%Arg_1.2, %broadcast.13), direction=LT, metadata={op_name="jit(_take)/jit(main)/lt" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %constant.9 = s32[] constant(9)
  %broadcast.10 = s32[9]{0} broadcast(%constant.9), dimensions={}
  %add.15 = s32[9]{0} add(%Arg_1.2, %broadcast.10), metadata={op_name="jit(_take)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %call.21 = s32[9]{0} call(%compare.14, %add.15, %Arg_1.2), to_apply=%_where.16
  %reshape.22 = s32[9,1]{1,0} reshape(%call.21), metadata={op_name="jit(_take)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %convert.23 = s64[9,1]{1,0} convert(%reshape.22), metadata={op_name="jit(_take)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %constant.7 = s64[] constant(0)
  %broadcast.8 = s64[9,1]{1,0} broadcast(%constant.7), dimensions={}
  %compare.24 = pred[9,1]{1,0} compare(%convert.23, %broadcast.8), direction=GE, metadata={op_name="jit(_take)/jit(main)/ge" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %constant.5 = s64[] constant(8)
  %broadcast.6 = s64[9,1]{1,0} broadcast(%constant.5), dimensions={}
  %compare.25 = pred[9,1]{1,0} compare(%convert.23, %broadcast.6), direction=LE, metadata={op_name="jit(_take)/jit(main)/le" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %and.26 = pred[9,1]{1,0} and(%compare.24, %compare.25), metadata={op_name="jit(_take)/jit(main)/and" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %constant.11 = pred[] constant(true)
  %reduce.31 = pred[9]{0} reduce(%and.26, %constant.11), dimensions={1}, to_apply=%region_0.27, metadata={op_name="jit(_take)/jit(main)/reduce_and" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %broadcast.33 = pred[9,1963]{1,0} broadcast(%reduce.31), dimensions={0}, metadata={op_name="jit(_take)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %Arg_0.1 = c128[9,1963]{1,0} parameter(0), sharding={replicated}, metadata={op_name="a"}
  %gather.32 = c128[9,1963]{1,0} gather(%Arg_0.1, %convert.23), offset_dims={1}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,1963}, metadata={op_name="jit(_take)/jit(main)/gather" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
  %constant.3 = c128[] constant((nan, 0))
  %broadcast.4 = c128[9,1963]{1,0} broadcast(%constant.3), dimensions={}
  ROOT %select.34 = c128[9,1963]{1,0} select(%broadcast.33, %gather.32, %broadcast.4), metadata={op_name="jit(_take)/jit(main)/select_n" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/file_io/wfn_loader.py" source_line=600}
}

