HloModule jit__pair_density, entry_computation_layout={(c128[9,640,80,2]{3,2,1,0}, c128[9,80,2,640]{3,2,1,0})->c128[9,2,2,640,640]{4,3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false}, num_partitions=4

ENTRY %main.7 (Arg_0.1: c128[9,640,80,2], Arg_1.2: c128[9,80,2,640]) -> c128[9,2,2,640,640] {
  %Arg_1.2 = c128[9,80,2,640]{3,2,1,0} parameter(1), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="psi_R"}
  %Arg_0.1 = c128[9,640,80,2]{3,2,1,0} parameter(0), sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="psi_L"}
  %dot.3 = c128[9,2,640,640,2]{4,3,2,1,0} dot(%Arg_1.2, %Arg_0.1), lhs_batch_dims={0}, lhs_contracting_dims={1}, rhs_batch_dims={0}, rhs_contracting_dims={2}, sharding={devices=[1,1,2,2,1]<=[2,2]T(1,0)}, metadata={op_name="jit(_pair_density)/jit(main)/kmna,knbr->kabmr/dot_general" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/isdf_fitting.py" source_line=112}
  ROOT %transpose.4 = c128[9,2,2,640,640]{1,3,4,2,0} transpose(%dot.3), dimensions={0,4,1,3,2}, sharding={devices=[1,1,1,2,2]<=[4]}, metadata={op_name="jit(_pair_density)/jit(main)/kmna,knbr->kabmr/transpose" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/isdf_fitting.py" source_line=112}
}

