HloModule jit_convert_element_type, entry_computation_layout={(f64[])->c128[]}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.3 (Arg_0.1: f64[]) -> c128[] {
  %Arg_0.1 = f64[] parameter(0), metadata={op_name="args[0]"}
  ROOT %convert.2 = c128[] convert(%Arg_0.1), metadata={op_name="jit(convert_element_type)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/gw/coulomb/slab_2d.py" source_line=90}
}

