HloModule jit_fn, entry_computation_layout={(c128[9,32,2,1963]{3,2,1,0}, s32[9,24,24,80]{3,2,1,0}, s32[640,3]{1,0}, f64[9,3]{1,0})->c128[9,32,2,640]{3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,true,true,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4

ENTRY %main.298 (Arg_0.1: c128[9,32,2,1963], Arg_1.2: s32[9,24,24,80], Arg_2.3: s32[640,3], Arg_3.4: f64[9,3]) -> c128[9,32,2,640] {
  %Arg_0.1 = c128[9,32,2,1963]{3,2,1,0} parameter(0), sharding={devices=[1,4,1,1]<=[4]}, metadata={op_name="psi_"}
  %constant.40 = c128[] constant((0, 0))
  %pad = c128[9,32,2,1964]{3,2,1,0} pad(%Arg_0.1, %constant.40), padding=0_0x0_0x0_0x0_1, metadata={op_name="jit(fn)/jit(main)/concatenate" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=91}
  %transpose.43 = c128[32,2,9,1964]{3,1,0,2} transpose(%pad), dimensions={1,2,0,3}, metadata={op_name="jit(fn)/jit(main)/transpose" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=93}
  %reshape.44 = c128[32,2,17676]{2,1,0} reshape(%transpose.43), metadata={op_name="jit(fn)/jit(main)/reshape" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=94}
  %iota = s32[9,1,1,1]{3,2,1,0} iota(), iota_dimension=0, metadata={op_name="jit(fn)/jit(main)/iota" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=97}
  %constant.17 = s32[] constant(1964)
  %broadcast.18 = s32[9,1,1,1]{3,2,1,0} broadcast(%constant.17), dimensions={}
  %multiply.47 = s32[9,1,1,1]{3,2,1,0} multiply(%iota, %broadcast.18), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=97}
  %reshape.49 = s32[9]{0} reshape(%multiply.47), metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=97}
  %broadcast.50 = s32[9,24,24,80]{3,2,1,0} broadcast(%reshape.49), dimensions={0}, metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=97}
  %Arg_1.2 = s32[9,24,24,80]{3,2,1,0} parameter(1), metadata={op_name="g_index_"}
  %add.51 = s32[9,24,24,80]{3,2,1,0} add(%broadcast.50, %Arg_1.2), metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=97}
  %reshape.0 = s32[9,24,24,80,1]{4,3,2,1,0} reshape(%add.51), metadata={op_name="jit(fn)/jit(main)/jit(_take)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=104}
  %gather.0 = c128[32,2,9,24,24,80]{5,4,3,2,1,0} gather(%reshape.44, %reshape.0), offset_dims={0,1}, collapsed_slice_dims={2}, start_index_map={2}, index_vector_dim=4, slice_sizes={32,2,1}, metadata={op_name="jit(fn)/jit(main)/jit(_take)/gather" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=104}
  %transpose.58 = c128[9,32,2,24,24,80]{5,4,3,0,2,1} transpose(%gather.0), dimensions={2,0,1,3,4,5}, metadata={op_name="jit(fn)/jit(main)/transpose" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=105}
  %fft.0 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} fft(%transpose.58), fft_type=IFFT, fft_length={24,24,80}, metadata={op_name="jit(fn)/jit(main)/jit(fft)/fft" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=287}
  %Arg_3.4 = f64[9,3]{1,0} parameter(3), metadata={op_name="kvecs_"}
  %slice.169 = f64[9,1]{1,0} slice(%Arg_3.4), slice={[0:9], [0:1]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %convert.170 = c128[9,1]{1,0} convert(%slice.169), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %constant.11 = c128[] constant((0, 6.2831853071795862))
  %broadcast.12 = c128[9,1]{1,0} broadcast(%constant.11), dimensions={}
  %multiply.171 = c128[9,1]{1,0} multiply(%convert.170, %broadcast.12), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %reshape.175 = c128[9]{0} reshape(%multiply.171), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %broadcast.176 = c128[9,24]{1,0} broadcast(%reshape.175), dimensions={0}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %iota.163 = f64[24]{0} iota(), iota_dimension=0, metadata={op_name="jit(fn)/jit(main)/iota" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=398}
  %constant.12 = f64[] constant(0.041666666666666664)
  %broadcast = f64[24]{0} broadcast(%constant.12), dimensions={}
  %multiply.8 = f64[24]{0} multiply(%iota.163, %broadcast), metadata={op_name="jit(fn)/jit(main)/div" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=398}
  %convert.0 = c128[24]{0} convert(%multiply.8), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %broadcast.179 = c128[9,24]{1,0} broadcast(%convert.0), dimensions={1}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.180 = c128[9,24]{1,0} multiply(%broadcast.176, %broadcast.179), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %real.181 = f64[9,24]{1,0} real(%multiply.180), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %exponential.182 = f64[9,24]{1,0} exponential(%real.181), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %constant.29 = f64[] constant(inf)
  %broadcast.30 = f64[9,24]{1,0} broadcast(%constant.29), dimensions={}
  %compare.183 = pred[9,24]{1,0} compare(%exponential.182, %broadcast.30), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %constant.27 = f64[] constant(0.5)
  %broadcast.28 = f64[9,24]{1,0} broadcast(%constant.27), dimensions={}
  %multiply.184 = f64[9,24]{1,0} multiply(%real.181, %broadcast.28), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %exponential.185 = f64[9,24]{1,0} exponential(%multiply.184), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %imag.186 = f64[9,24]{1,0} imag(%multiply.180), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %cosine.187 = f64[9,24]{1,0} cosine(%imag.186), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.188 = f64[9,24]{1,0} multiply(%exponential.185, %cosine.187), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.189 = f64[9,24]{1,0} multiply(%multiply.188, %exponential.185), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.190 = f64[9,24]{1,0} multiply(%exponential.182, %cosine.187), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %select.191 = f64[9,24]{1,0} select(%compare.183, %multiply.189, %multiply.190), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %constant.25 = f64[] constant(0)
  %broadcast.26 = f64[9,24]{1,0} broadcast(%constant.25), dimensions={}
  %compare.192 = pred[9,24]{1,0} compare(%imag.186, %broadcast.26), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %sine.193 = f64[9,24]{1,0} sine(%imag.186), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.194 = f64[9,24]{1,0} multiply(%exponential.185, %sine.193), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.195 = f64[9,24]{1,0} multiply(%multiply.194, %exponential.185), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %multiply.196 = f64[9,24]{1,0} multiply(%exponential.182, %sine.193), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %select.197 = f64[9,24]{1,0} select(%compare.183, %multiply.195, %multiply.196), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %select.198 = f64[9,24]{1,0} select(%compare.192, %broadcast.26, %select.197), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %complex.199 = c128[9,24]{1,0} complex(%select.191, %select.198), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=404}
  %constant.127 = c128[] constant((214.66252583997982, 0)), metadata={op_name="jit(fn)/jit(main)/sqrt" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=287}
  %broadcast.13 = c128[9,24]{1,0} broadcast(%constant.127), dimensions={}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %multiply.13 = c128[9,24]{1,0} multiply(%complex.199, %broadcast.13), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %broadcast.15 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} broadcast(%multiply.13), dimensions={0,3}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %multiply.268 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} multiply(%fft.0, %broadcast.15), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %slice.200 = f64[9,1]{1,0} slice(%Arg_3.4), slice={[0:9], [1:2]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %convert.201 = c128[9,1]{1,0} convert(%slice.200), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.202 = c128[9,1]{1,0} multiply(%convert.201, %broadcast.12), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %reshape.206 = c128[9]{0} reshape(%multiply.202), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %broadcast.207 = c128[9,24]{1,0} broadcast(%reshape.206), dimensions={0}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %iota.165 = f64[24]{0} iota(), iota_dimension=0, metadata={op_name="jit(fn)/jit(main)/iota" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=399}
  %constant.14 = f64[] constant(0.041666666666666664)
  %broadcast.1 = f64[24]{0} broadcast(%constant.14), dimensions={}
  %multiply.9 = f64[24]{0} multiply(%iota.165, %broadcast.1), metadata={op_name="jit(fn)/jit(main)/div" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=399}
  %convert.1 = c128[24]{0} convert(%multiply.9), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %broadcast.210 = c128[9,24]{1,0} broadcast(%convert.1), dimensions={1}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.211 = c128[9,24]{1,0} multiply(%broadcast.207, %broadcast.210), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %real.212 = f64[9,24]{1,0} real(%multiply.211), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %exponential.213 = f64[9,24]{1,0} exponential(%real.212), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %compare.214 = pred[9,24]{1,0} compare(%exponential.213, %broadcast.30), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.215 = f64[9,24]{1,0} multiply(%real.212, %broadcast.28), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %exponential.216 = f64[9,24]{1,0} exponential(%multiply.215), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %imag.217 = f64[9,24]{1,0} imag(%multiply.211), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %cosine.218 = f64[9,24]{1,0} cosine(%imag.217), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.219 = f64[9,24]{1,0} multiply(%exponential.216, %cosine.218), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.220 = f64[9,24]{1,0} multiply(%multiply.219, %exponential.216), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.221 = f64[9,24]{1,0} multiply(%exponential.213, %cosine.218), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %select.222 = f64[9,24]{1,0} select(%compare.214, %multiply.220, %multiply.221), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %compare.223 = pred[9,24]{1,0} compare(%imag.217, %broadcast.26), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %sine.224 = f64[9,24]{1,0} sine(%imag.217), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.225 = f64[9,24]{1,0} multiply(%exponential.216, %sine.224), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.226 = f64[9,24]{1,0} multiply(%multiply.225, %exponential.216), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %multiply.227 = f64[9,24]{1,0} multiply(%exponential.213, %sine.224), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %select.228 = f64[9,24]{1,0} select(%compare.214, %multiply.226, %multiply.227), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %select.229 = f64[9,24]{1,0} select(%compare.223, %broadcast.26, %select.228), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %complex.230 = c128[9,24]{1,0} complex(%select.222, %select.229), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=405}
  %broadcast.271 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} broadcast(%complex.230), dimensions={0,4}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %multiply.272 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} multiply(%multiply.268, %broadcast.271), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %slice.231 = f64[9,1]{1,0} slice(%Arg_3.4), slice={[0:9], [2:3]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %convert.232 = c128[9,1]{1,0} convert(%slice.231), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.233 = c128[9,1]{1,0} multiply(%convert.232, %broadcast.12), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %reshape.237 = c128[9]{0} reshape(%multiply.233), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %broadcast.238 = c128[9,80]{1,0} broadcast(%reshape.237), dimensions={0}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %iota.167 = f64[80]{0} iota(), iota_dimension=0, metadata={op_name="jit(fn)/jit(main)/iota" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=400}
  %constant.16 = f64[] constant(0.0125)
  %broadcast.2 = f64[80]{0} broadcast(%constant.16), dimensions={}
  %multiply.10 = f64[80]{0} multiply(%iota.167, %broadcast.2), metadata={op_name="jit(fn)/jit(main)/div" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=400}
  %convert.2 = c128[80]{0} convert(%multiply.10), metadata={op_name="jit(fn)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %broadcast.241 = c128[9,80]{1,0} broadcast(%convert.2), dimensions={1}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.242 = c128[9,80]{1,0} multiply(%broadcast.238, %broadcast.241), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %real.243 = f64[9,80]{1,0} real(%multiply.242), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %exponential.244 = f64[9,80]{1,0} exponential(%real.243), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %constant.23 = f64[] constant(inf)
  %broadcast.24 = f64[9,80]{1,0} broadcast(%constant.23), dimensions={}
  %compare.245 = pred[9,80]{1,0} compare(%exponential.244, %broadcast.24), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %constant.21 = f64[] constant(0.5)
  %broadcast.22 = f64[9,80]{1,0} broadcast(%constant.21), dimensions={}
  %multiply.246 = f64[9,80]{1,0} multiply(%real.243, %broadcast.22), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %exponential.247 = f64[9,80]{1,0} exponential(%multiply.246), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %imag.248 = f64[9,80]{1,0} imag(%multiply.242), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %cosine.249 = f64[9,80]{1,0} cosine(%imag.248), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.250 = f64[9,80]{1,0} multiply(%exponential.247, %cosine.249), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.251 = f64[9,80]{1,0} multiply(%multiply.250, %exponential.247), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.252 = f64[9,80]{1,0} multiply(%exponential.244, %cosine.249), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %select.253 = f64[9,80]{1,0} select(%compare.245, %multiply.251, %multiply.252), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %constant.19 = f64[] constant(0)
  %broadcast.20 = f64[9,80]{1,0} broadcast(%constant.19), dimensions={}
  %compare.254 = pred[9,80]{1,0} compare(%imag.248, %broadcast.20), direction=EQ, metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %sine.255 = f64[9,80]{1,0} sine(%imag.248), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.256 = f64[9,80]{1,0} multiply(%exponential.247, %sine.255), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.257 = f64[9,80]{1,0} multiply(%multiply.256, %exponential.247), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %multiply.258 = f64[9,80]{1,0} multiply(%exponential.244, %sine.255), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %select.259 = f64[9,80]{1,0} select(%compare.245, %multiply.257, %multiply.258), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %select.260 = f64[9,80]{1,0} select(%compare.254, %broadcast.20, %select.259), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %complex.261 = c128[9,80]{1,0} complex(%select.253, %select.260), metadata={op_name="jit(fn)/jit(main)/exp" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=406}
  %broadcast.275 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} broadcast(%complex.261), dimensions={0,5}, metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %multiply.276 = c128[9,32,2,24,24,80]{5,4,3,2,1,0} multiply(%multiply.272, %broadcast.275), metadata={op_name="jit(fn)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=416}
  %Arg_2.3 = s32[640,3]{1,0} parameter(2), metadata={op_name="r_mu_"}
  %slice.277 = s32[640,1]{1,0} slice(%Arg_2.3), slice={[0:640], [0:1]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.278 = s32[640]{0} reshape(%slice.277), metadata={op_name="jit(fn)/jit(main)/squeeze" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %constant.9 = s32[] constant(0)
  %broadcast.10 = s32[640]{0} broadcast(%constant.9), dimensions={}
  %compare.283 = pred[640]{0} compare(%reshape.278, %broadcast.10), direction=LT, metadata={op_name="jit(fn)/jit(main)/lt" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %constant.7 = s32[] constant(24)
  %broadcast.8 = s32[640]{0} broadcast(%constant.7), dimensions={}
  %add.284 = s32[640]{0} add(%reshape.278, %broadcast.8), metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %select.285 = s32[640]{0} select(%compare.283, %add.284, %reshape.278), metadata={op_name="jit(fn)/jit(main)/select_n" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.292 = s32[640,1]{1,0} reshape(%select.285), metadata={op_name="jit(fn)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %slice.279 = s32[640,1]{1,0} slice(%Arg_2.3), slice={[0:640], [1:2]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.280 = s32[640]{0} reshape(%slice.279), metadata={op_name="jit(fn)/jit(main)/squeeze" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %compare.286 = pred[640]{0} compare(%reshape.280, %broadcast.10), direction=LT, metadata={op_name="jit(fn)/jit(main)/lt" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %add.287 = s32[640]{0} add(%reshape.280, %broadcast.8), metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %select.288 = s32[640]{0} select(%compare.286, %add.287, %reshape.280), metadata={op_name="jit(fn)/jit(main)/select_n" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.293 = s32[640,1]{1,0} reshape(%select.288), metadata={op_name="jit(fn)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %slice.281 = s32[640,1]{1,0} slice(%Arg_2.3), slice={[0:640], [2:3]}, metadata={op_name="jit(fn)/jit(main)/slice" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.282 = s32[640]{0} reshape(%slice.281), metadata={op_name="jit(fn)/jit(main)/squeeze" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %compare.289 = pred[640]{0} compare(%reshape.282, %broadcast.10), direction=LT, metadata={op_name="jit(fn)/jit(main)/lt" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %constant.5 = s32[] constant(80)
  %broadcast.6 = s32[640]{0} broadcast(%constant.5), dimensions={}
  %add.290 = s32[640]{0} add(%reshape.282, %broadcast.6), metadata={op_name="jit(fn)/jit(main)/add" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %select.291 = s32[640]{0} select(%compare.289, %add.290, %reshape.282), metadata={op_name="jit(fn)/jit(main)/select_n" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %reshape.294 = s32[640,1]{1,0} reshape(%select.291), metadata={op_name="jit(fn)/jit(main)/broadcast_in_dim" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %concatenate.295 = s32[640,3]{1,0} concatenate(%reshape.292, %reshape.293, %reshape.294), dimensions={1}, metadata={op_name="jit(fn)/jit(main)/concatenate" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  %gather.296 = c128[9,32,2,640]{3,2,1,0} gather(%multiply.276, %concatenate.295), offset_dims={0,1,2}, collapsed_slice_dims={3,4,5}, start_index_map={3,4,5}, index_vector_dim=1, slice_sizes={9,32,2,1,1,1}, metadata={op_name="jit(fn)/jit(main)/gather" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=289}
  ROOT %custom-call.297 = c128[9,32,2,640]{3,2,1,0} custom-call(%gather.296), custom_call_target="Sharding", sharding={devices=[1,4,1,1]<=[4]}, metadata={op_name="jit(fn)/jit(main)/sharding_constraint" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_D/src/common/wfn_transforms.py" source_line=144}
}

