HloModule jit_fn, entry_computation_layout={(c128[64,432,60,4]{3,2,1,0}, c128[64,60,4,432]{3,2,1,0}, c128[64,432,60,4]{3,2,1,0}, c128[64,60,4,432]{3,2,1,0}, s32[4]{0}, /*index=5*/c128[4]{0}, s32[4]{0}, c128[4]{0})->c128[64,432,432]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={xla.sdy.meshes={mesh = #sdy.mesh<["x"=2, "y"=2]>}}

FileNames
1 "/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_B/src/common/isdf_fitting.py"
2 "/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_B/src/common/gamma_matrices.py"
3 "<frozen runpy>"
4 "/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_B/src/gw/gw_jax.py"
5 "/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax_B/src/gw/gw_init.py"

FunctionNames
1 "c_q_from_psi_sm.<locals>._local"
2 "gamma_double_contract"
3 "_gamma_double_contract_take"
4 "gamma_apply"
5 "_run_module_as_main"
6 "_run_code"
7 "<module>"
8 "main"
9 "prepare_isdf_and_wavefunctions"
10 "fit_zeta"
11 "fit_zeta_to_h5"
12 "c_q_from_psi_sm"
13 "c_q_from_psi_sm.<locals>.fn"

FileLocations
1 {file_name_id=1 function_name_id=1 line=421 end_line=421 column=11 end_column=64}
2 {file_name_id=1 function_name_id=1 line=426 end_line=426 column=11 end_column=64}
3 {file_name_id=1 function_name_id=1 line=430 end_line=437 column=9 end_column=4}
4 {file_name_id=2 function_name_id=2 line=292 end_line=293 column=11 end_column=67}
5 {file_name_id=2 function_name_id=3 line=160 end_line=160 column=11 end_column=52}
6 {file_name_id=1 function_name_id=1 line=439 end_line=439 column=12 end_column=61}
7 {file_name_id=1 function_name_id=1 line=413 end_line=414 column=9 end_column=58}
8 {file_name_id=1 function_name_id=1 line=415 end_line=416 column=9 end_column=58}
9 {file_name_id=1 function_name_id=1 line=419 end_line=419 column=12 end_column=63}
10 {file_name_id=1 function_name_id=1 line=422 end_line=422 column=16 end_column=31}
11 {file_name_id=1 function_name_id=1 line=424 end_line=424 column=12 end_column=63}
12 {file_name_id=2 function_name_id=3 line=157 end_line=157 column=16 end_column=64}
13 {file_name_id=2 function_name_id=4 line=123 end_line=123 column=10 end_column=38}
14 {file_name_id=2 function_name_id=4 line=126 end_line=126 column=17 end_column=37}
15 {file_name_id=2 function_name_id=4 line=126 end_line=126 column=11 end_column=37}
16 {file_name_id=2 function_name_id=3 line=159 end_line=159 column=16 end_column=64}
17 {file_name_id=2 function_name_id=3 line=160 end_line=160 column=19 end_column=35}
18 {file_name_id=1 function_name_id=1 line=445 end_line=445 column=4 end_column=52}
19 {file_name_id=1 function_name_id=1 line=444 end_line=446 column=10 end_column=14}
20 {file_name_id=3 function_name_id=5 line=198 end_line=199 column=11 end_column=42}
21 {file_name_id=3 function_name_id=6 line=88 end_line=88 column=4 end_column=27}
22 {file_name_id=4 function_name_id=7 line=956 end_line=956 column=18 end_column=24}
23 {file_name_id=4 function_name_id=8 line=169 end_line=181 column=8 end_column=2}
24 {file_name_id=5 function_name_id=9 line=1228 end_line=1231 column=45 end_column=51}
25 {file_name_id=5 function_name_id=10 line=829 end_line=857 column=4 end_column=5}
26 {file_name_id=1 function_name_id=11 line=2050 end_line=2054 column=18 end_column=45}
27 {file_name_id=1 function_name_id=12 line=466 end_line=468 column=8 end_column=35}
28 {file_name_id=1 function_name_id=13 line=450 end_line=451 column=10 end_column=34}

StackFrames
1 {file_location_id=1 parent_frame_id=1}
2 {file_location_id=2 parent_frame_id=1}
3 {file_location_id=3 parent_frame_id=1}
4 {file_location_id=4 parent_frame_id=4}
5 {file_location_id=5 parent_frame_id=5}
6 {file_location_id=6 parent_frame_id=1}
7 {file_location_id=7 parent_frame_id=1}
8 {file_location_id=8 parent_frame_id=1}
9 {file_location_id=9 parent_frame_id=1}
10 {file_location_id=10 parent_frame_id=1}
11 {file_location_id=10 parent_frame_id=11}
12 {file_location_id=11 parent_frame_id=1}
13 {file_location_id=12 parent_frame_id=5}
14 {file_location_id=13 parent_frame_id=14}
15 {file_location_id=14 parent_frame_id=14}
16 {file_location_id=15 parent_frame_id=14}
17 {file_location_id=16 parent_frame_id=5}
18 {file_location_id=13 parent_frame_id=18}
19 {file_location_id=14 parent_frame_id=18}
20 {file_location_id=15 parent_frame_id=18}
21 {file_location_id=17 parent_frame_id=5}
22 {file_location_id=18 parent_frame_id=1}
23 {file_location_id=19 parent_frame_id=1}
24 {file_location_id=20 parent_frame_id=1}
25 {file_location_id=21 parent_frame_id=25}
26 {file_location_id=22 parent_frame_id=26}
27 {file_location_id=23 parent_frame_id=27}
28 {file_location_id=24 parent_frame_id=28}
29 {file_location_id=25 parent_frame_id=29}
30 {file_location_id=26 parent_frame_id=30}
31 {file_location_id=27 parent_frame_id=31}
32 {file_location_id=28 parent_frame_id=32}


%fft.1 (Arg_0.1: c128[4,216,216,4,4,4,4]) -> c128[4,216,216,4,4,4,4] {
  %Arg_0.1 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} parameter(0)
  ROOT %fft.1 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} fft(%Arg_0.1), fft_type=IFFT, fft_length={4,4,4}, metadata={op_name="fft"}
}

%region_0.2 (reduce_prod.3: c128[], reduce_prod.4: c128[]) -> c128[] {
  %reduce_prod.3 = c128[] parameter(0), metadata={op_name="reduce_prod"}
  %reduce_prod.4 = c128[] parameter(1), metadata={op_name="reduce_prod"}
  ROOT %reduce_prod.5 = c128[] multiply(%reduce_prod.3, %reduce_prod.4), metadata={op_name="reduce_prod" stack_frame_id=1}
}

%region_1.3 (reduce_prod.10: c128[], reduce_prod.11: c128[]) -> c128[] {
  %reduce_prod.10 = c128[] parameter(0), metadata={op_name="reduce_prod"}
  %reduce_prod.11 = c128[] parameter(1), metadata={op_name="reduce_prod"}
  ROOT %reduce_prod.12 = c128[] multiply(%reduce_prod.10, %reduce_prod.11), metadata={op_name="reduce_prod" stack_frame_id=2}
}

%_where.4 (Arg_0.4: pred[4], Arg_1.2: s32[4], Arg_2.1: s32[4]) -> s32[4] {
  %Arg_0.4 = pred[4]{0} parameter(0)
  %Arg_1.2 = s32[4]{0} parameter(1)
  %Arg_2.1 = s32[4]{0} parameter(2)
  ROOT %select_n.1 = s32[4]{0} select(%Arg_0.4, %Arg_1.2, %Arg_2.1), metadata={op_name="select_n"}
}

%region_2.5 (reduce_and.3: pred[], reduce_and.4: pred[]) -> pred[] {
  %reduce_and.3 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.4 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.5 = pred[] and(%reduce_and.3, %reduce_and.4), metadata={op_name="reduce_and"}
}

%_take.6 (Arg_0.5: c128[4,4,4,4,216,216,4], Arg_1.3: s32[4]) -> c128[4,4,4,4,216,216,4] {
  %Arg_1.3 = s32[4]{0} parameter(1)
  %constant.14 = s32[] constant(0)
  %broadcast.8 = s32[4]{0} broadcast(%constant.14), dimensions={}
  %lt.1 = pred[4]{0} compare(%Arg_1.3, %broadcast.8), direction=LT, metadata={op_name="lt"}
  %constant.12 = s32[] constant(4)
  %broadcast.7 = s32[4]{0} broadcast(%constant.12), dimensions={}
  %add.1 = s32[4]{0} add(%Arg_1.3, %broadcast.7), metadata={op_name="add"}
  %jit__where_.1 = s32[4]{0} call(%lt.1, %add.1, %Arg_1.3), to_apply=%_where.4, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.4 = s32[4,1]{1,0} reshape(%jit__where_.1), metadata={op_name="broadcast_in_dim"}
  %constant.11 = s32[] constant(0)
  %broadcast.6 = s32[4,1]{1,0} broadcast(%constant.11), dimensions={}
  %ge.1 = pred[4,1]{1,0} compare(%broadcast_in_dim.4, %broadcast.6), direction=GE, metadata={op_name="ge"}
  %constant.10 = s32[] constant(3)
  %broadcast.5 = s32[4,1]{1,0} broadcast(%constant.10), dimensions={}
  %le.1 = pred[4,1]{1,0} compare(%broadcast_in_dim.4, %broadcast.5), direction=LE, metadata={op_name="le"}
  %and.1 = pred[4,1]{1,0} and(%ge.1, %le.1), metadata={op_name="and"}
  %constant.13 = pred[] constant(true)
  %reduce_and.7 = pred[4]{0} reduce(%and.1, %constant.13), dimensions={1}, to_apply=%region_2.5, metadata={op_name="reduce_and"}
  %broadcast_in_dim.5 = pred[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%reduce_and.7), dimensions={3}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.5 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} parameter(0)
  %gather.1 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} gather(%Arg_0.5, %broadcast_in_dim.4), offset_dims={0,1,2,4,5,6}, collapsed_slice_dims={3}, start_index_map={3}, index_vector_dim=1, slice_sizes={4,4,4,1,216,216,4}, metadata={op_name="gather"}
  %constant.9 = c128[] constant((nan, 0))
  %broadcast_in_dim.3 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%constant.9), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.3 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} select(%broadcast_in_dim.5, %gather.1, %broadcast_in_dim.3), metadata={op_name="select_n"}
}

%region_3.7 (reduce_and.11: pred[], reduce_and.12: pred[]) -> pred[] {
  %reduce_and.11 = pred[] parameter(0), metadata={op_name="reduce_and"}
  %reduce_and.12 = pred[] parameter(1), metadata={op_name="reduce_and"}
  ROOT %reduce_and.13 = pred[] and(%reduce_and.11, %reduce_and.12), metadata={op_name="reduce_and"}
}

%_take_10.8 (Arg_0.7: c128[4,4,4,4,216,216,4], Arg_1.5: s32[4]) -> c128[4,4,4,4,216,216,4] {
  %Arg_1.5 = s32[4]{0} parameter(1)
  %constant.26 = s32[] constant(0)
  %broadcast.16 = s32[4]{0} broadcast(%constant.26), dimensions={}
  %lt.3 = pred[4]{0} compare(%Arg_1.5, %broadcast.16), direction=LT, metadata={op_name="lt"}
  %constant.24 = s32[] constant(4)
  %broadcast.15 = s32[4]{0} broadcast(%constant.24), dimensions={}
  %add.3 = s32[4]{0} add(%Arg_1.5, %broadcast.15), metadata={op_name="add"}
  %jit__where_.3 = s32[4]{0} call(%lt.3, %add.3, %Arg_1.5), to_apply=%_where.4, metadata={op_name="jit(_where)"}
  %broadcast_in_dim.10 = s32[4,1]{1,0} reshape(%jit__where_.3), metadata={op_name="broadcast_in_dim"}
  %constant.23 = s32[] constant(0)
  %broadcast.14 = s32[4,1]{1,0} broadcast(%constant.23), dimensions={}
  %ge.3 = pred[4,1]{1,0} compare(%broadcast_in_dim.10, %broadcast.14), direction=GE, metadata={op_name="ge"}
  %constant.22 = s32[] constant(3)
  %broadcast.13 = s32[4,1]{1,0} broadcast(%constant.22), dimensions={}
  %le.3 = pred[4,1]{1,0} compare(%broadcast_in_dim.10, %broadcast.13), direction=LE, metadata={op_name="le"}
  %and.3 = pred[4,1]{1,0} and(%ge.3, %le.3), metadata={op_name="and"}
  %constant.25 = pred[] constant(true)
  %reduce_and.15 = pred[4]{0} reduce(%and.3, %constant.25), dimensions={1}, to_apply=%region_3.7, metadata={op_name="reduce_and"}
  %broadcast_in_dim.11 = pred[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%reduce_and.15), dimensions={6}, metadata={op_name="broadcast_in_dim"}
  %Arg_0.7 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} parameter(0)
  %gather.3 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} gather(%Arg_0.7, %broadcast_in_dim.10), offset_dims={0,1,2,3,4,5}, collapsed_slice_dims={6}, start_index_map={6}, index_vector_dim=1, slice_sizes={4,4,4,4,216,216,1}, metadata={op_name="gather"}
  %constant.21 = c128[] constant((nan, 0))
  %broadcast_in_dim.9 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%constant.21), dimensions={}, metadata={op_name="broadcast_in_dim"}
  ROOT %select_n.5 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} select(%broadcast_in_dim.11, %gather.3, %broadcast_in_dim.9), metadata={op_name="select_n"}
}

%region_4.9 (reduce_sum.3: c128[], reduce_sum.4: c128[]) -> c128[] {
  %reduce_sum.3 = c128[] parameter(0), metadata={op_name="reduce_sum"}
  %reduce_sum.4 = c128[] parameter(1), metadata={op_name="reduce_sum"}
  ROOT %reduce_sum.5 = c128[] add(%reduce_sum.3, %reduce_sum.4), metadata={op_name="reduce_sum" stack_frame_id=5}
}

%fft_18.10 (Arg_0.9: c128[216,216,4,4,4]) -> c128[216,216,4,4,4] {
  %Arg_0.9 = c128[216,216,4,4,4]{4,3,2,1,0} parameter(0)
  ROOT %fft.3 = c128[216,216,4,4,4]{4,3,2,1,0} fft(%Arg_0.9), fft_type=FFT, fft_length={4,4,4}, metadata={op_name="fft"}
}

%region_5.11 (reduce_prod.17: c128[], reduce_prod.18: c128[]) -> c128[] {
  %reduce_prod.17 = c128[] parameter(0), metadata={op_name="reduce_prod"}
  %reduce_prod.18 = c128[] parameter(1), metadata={op_name="reduce_prod"}
  ROOT %reduce_prod.19 = c128[] multiply(%reduce_prod.17, %reduce_prod.18), metadata={op_name="reduce_prod" stack_frame_id=6}
}

%xla.sdy.manual_computation_body.12 (shard_map.23: c128[3], shard_map.24: c128[3], shard_map.25: c128[3], shard_map.26: c128[64,216,60,4], shard_map.27: c128[64,60,4,216], shard_map.28: c128[64,216,60,4], shard_map.29: c128[64,60,4,216], shard_map.30: s32[4], shard_map.31: c128[4], shard_map.32: s32[4], shard_map.33: c128[4]) -> c128[64,216,216] {
  %shard_map.27 = c128[64,60,4,216]{3,2,1,0} parameter(4), metadata={op_name="shard_map"}
  %shard_map.26 = c128[64,216,60,4]{3,2,1,0} parameter(3), metadata={op_name="shard_map"}
  %dot_general.2 = c128[64,4,216,216,4]{4,3,2,1,0} dot(%shard_map.27, %shard_map.26), lhs_batch_dims={0}, lhs_contracting_dims={1}, rhs_batch_dims={0}, rhs_contracting_dims={2}, metadata={op_name="kmna,knbr->karmb/dot_general" stack_frame_id=7}
  %transpose.9 = c128[64,4,216,216,4]{1,3,2,4,0} transpose(%dot_general.2), dimensions={0,4,2,3,1}, metadata={op_name="kmna,knbr->karmb/transpose" stack_frame_id=7}
  %reshape.5 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} reshape(%transpose.9), metadata={op_name="reshape" stack_frame_id=9}
  %transpose.11 = c128[4,216,216,4,4,4,4]{3,2,1,0,6,5,4} transpose(%reshape.5), dimensions={3,4,5,6,0,1,2}, metadata={op_name="transpose" stack_frame_id=1}
  %jit_fft_.3 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} call(%transpose.11), to_apply=%fft.1, metadata={op_name="jit(fft)" stack_frame_id=1}
  %shard_map.23 = c128[3]{0} parameter(0), metadata={op_name="shard_map"}
  %constant.28 = c128[] constant((1, 0))
  %reduce_prod.21 = c128[] reduce(%shard_map.23, %constant.28), dimensions={0}, to_apply=%region_0.2, metadata={op_name="reduce_prod" stack_frame_id=1}
  %mul.15 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} broadcast(%reduce_prod.21), dimensions={}, metadata={op_name="mul" stack_frame_id=1}
  %mul.16 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} multiply(%jit_fft_.3, %mul.15), metadata={op_name="mul" stack_frame_id=1}
  %transpose.12 = c128[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} transpose(%mul.16), dimensions={4,5,6,0,1,2,3}, metadata={op_name="transpose" stack_frame_id=1}
  %real.1 = f64[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} real(%transpose.12), metadata={op_name="real" stack_frame_id=11}
  %imag.1 = f64[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} imag(%transpose.12), metadata={op_name="imag" stack_frame_id=11}
  %neg.1 = f64[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} negate(%imag.1), metadata={op_name="neg" stack_frame_id=11}
  %complex.1 = c128[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} complex(%real.1, %neg.1), metadata={op_name="complex" stack_frame_id=11}
  %shard_map.29 = c128[64,60,4,216]{3,2,1,0} parameter(6), metadata={op_name="shard_map"}
  %shard_map.28 = c128[64,216,60,4]{3,2,1,0} parameter(5), metadata={op_name="shard_map"}
  %dot_general.3 = c128[64,4,216,216,4]{4,3,2,1,0} dot(%shard_map.29, %shard_map.28), lhs_batch_dims={0}, lhs_contracting_dims={1}, rhs_batch_dims={0}, rhs_contracting_dims={2}, metadata={op_name="kmna,knbr->karmb/dot_general" stack_frame_id=8}
  %transpose.10 = c128[64,4,216,216,4]{1,3,2,4,0} transpose(%dot_general.3), dimensions={0,4,2,3,1}, metadata={op_name="kmna,knbr->karmb/transpose" stack_frame_id=8}
  %reshape.6 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} reshape(%transpose.10), metadata={op_name="reshape" stack_frame_id=12}
  %transpose.13 = c128[4,216,216,4,4,4,4]{3,2,1,0,6,5,4} transpose(%reshape.6), dimensions={3,4,5,6,0,1,2}, metadata={op_name="transpose" stack_frame_id=2}
  %jit_fft_.4 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} call(%transpose.13), to_apply=%fft.1, metadata={op_name="jit(fft)" stack_frame_id=2}
  %shard_map.24 = c128[3]{0} parameter(1), metadata={op_name="shard_map"}
  %reduce_prod.22 = c128[] reduce(%shard_map.24, %constant.28), dimensions={0}, to_apply=%region_1.3, metadata={op_name="reduce_prod" stack_frame_id=2}
  %mul.17 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} broadcast(%reduce_prod.22), dimensions={}, metadata={op_name="mul" stack_frame_id=2}
  %mul.18 = c128[4,216,216,4,4,4,4]{6,5,4,3,2,1,0} multiply(%jit_fft_.4, %mul.17), metadata={op_name="mul" stack_frame_id=2}
  %transpose.14 = c128[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} transpose(%mul.18), dimensions={4,5,6,0,1,2,3}, metadata={op_name="transpose" stack_frame_id=2}
  %shard_map.30 = s32[4]{0} parameter(7), metadata={op_name="shard_map"}
  %jit__take_.2 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} call(%transpose.14, %shard_map.30), to_apply=%_take.6, metadata={op_name="jit(_take)" stack_frame_id=14}
  %shard_map.31 = c128[4]{0} parameter(8), metadata={op_name="shard_map"}
  %reshape.7 = c128[1,1,1,4,1,1,1]{6,5,4,3,2,1,0} reshape(%shard_map.31), metadata={op_name="reshape" stack_frame_id=15}
  %mul.19 = c128[1,1,1,4,1,1,1]{6,5,4,3,2,1,0} broadcast(%reshape.7), dimensions={0,1,2,3,4,5,6}, metadata={op_name="mul" stack_frame_id=16}
  %mul.20 = c128[4]{0} reshape(%mul.19), metadata={op_name="mul" stack_frame_id=16}
  %mul.21 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%mul.20), dimensions={3}, metadata={op_name="mul" stack_frame_id=16}
  %mul.22 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} multiply(%jit__take_.2, %mul.21), metadata={op_name="mul" stack_frame_id=16}
  %shard_map.32 = s32[4]{0} parameter(9), metadata={op_name="shard_map"}
  %jit__take_.3 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} call(%mul.22, %shard_map.32), to_apply=%_take_10.8, metadata={op_name="jit(_take)" stack_frame_id=18}
  %shard_map.33 = c128[4]{0} parameter(10), metadata={op_name="shard_map"}
  %reshape.8 = c128[1,1,1,1,1,1,4]{6,5,4,3,2,1,0} reshape(%shard_map.33), metadata={op_name="reshape" stack_frame_id=19}
  %mul.23 = c128[1,1,1,1,1,1,4]{6,5,4,3,2,1,0} broadcast(%reshape.8), dimensions={0,1,2,3,4,5,6}, metadata={op_name="mul" stack_frame_id=20}
  %mul.24 = c128[4]{0} reshape(%mul.23), metadata={op_name="mul" stack_frame_id=20}
  %mul.25 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} broadcast(%mul.24), dimensions={6}, metadata={op_name="mul" stack_frame_id=20}
  %mul.26 = c128[4,4,4,4,216,216,4]{6,5,4,3,2,1,0} multiply(%jit__take_.3, %mul.25), metadata={op_name="mul" stack_frame_id=20}
  %mul.27 = c128[4,4,4,4,216,216,4]{2,1,0,6,5,4,3} multiply(%complex.1, %mul.26), metadata={op_name="mul" stack_frame_id=21}
  %constant.27 = c128[] constant((0, 0))
  %reduce_sum.7 = c128[4,4,4,216,216]{4,3,2,1,0} reduce(%mul.27, %constant.27), dimensions={3,6}, to_apply=%region_4.9, metadata={op_name="reduce_sum" stack_frame_id=5}
  %transpose.15 = c128[216,216,4,4,4]{1,0,4,3,2} transpose(%reduce_sum.7), dimensions={3,4,0,1,2}, metadata={op_name="transpose" stack_frame_id=6}
  %jit_fft_.5 = c128[216,216,4,4,4]{4,3,2,1,0} call(%transpose.15), to_apply=%fft_18.10, metadata={op_name="jit(fft)" stack_frame_id=6}
  %shard_map.25 = c128[3]{0} parameter(2), metadata={op_name="shard_map"}
  %reduce_prod.23 = c128[] reduce(%shard_map.25, %constant.28), dimensions={0}, to_apply=%region_5.11, metadata={op_name="reduce_prod" stack_frame_id=6}
  %div.1 = c128[] divide(%constant.28, %reduce_prod.23), metadata={op_name="div" stack_frame_id=6}
  %mul.28 = c128[216,216,4,4,4]{4,3,2,1,0} broadcast(%div.1), dimensions={}, metadata={op_name="mul" stack_frame_id=6}
  %mul.29 = c128[216,216,4,4,4]{4,3,2,1,0} multiply(%jit_fft_.5, %mul.28), metadata={op_name="mul" stack_frame_id=6}
  %transpose.16 = c128[4,4,4,216,216]{2,1,0,4,3} transpose(%mul.29), dimensions={2,3,4,0,1}, metadata={op_name="transpose" stack_frame_id=6}
  %reshape.9 = c128[64,216,216]{2,1,0} reshape(%transpose.16), metadata={op_name="reshape" stack_frame_id=22}
  ROOT %transpose.17 = c128[64,216,216]{1,2,0} transpose(%reshape.9), dimensions={0,2,1}, metadata={op_name="transpose" stack_frame_id=23}
}

ENTRY %main.13 (psi_l_X_.1: c128[64,432,60,4], psi_l_Y_.1: c128[64,60,4,432], psi_r_X_.1: c128[64,432,60,4], psi_r_Y_.1: c128[64,60,4,432], pL.1: s32[4], phL.1: c128[4], pR.1: s32[4], phR.1: c128[4]) -> c128[64,432,432] {
  %constant.29 = c128[] constant((4, 0))
  %broadcast.17 = c128[3]{0} broadcast(%constant.29), dimensions={}
  %psi_l_X_.1 = c128[64,432,60,4]{3,2,1,0} parameter(0), sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, frontend_attributes={xla.sdy.sharding="#sdy.sharding<@mesh, [{}, {\"x\"}, {}, {}]>"}, metadata={op_name="psi_l_X_"}
  %psi_l_Y_.1 = c128[64,60,4,432]{3,2,1,0} parameter(1), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, frontend_attributes={xla.sdy.sharding="#sdy.sharding<@mesh, [{}, {}, {}, {\"y\"}]>"}, metadata={op_name="psi_l_Y_"}
  %psi_r_X_.1 = c128[64,432,60,4]{3,2,1,0} parameter(2), sharding={devices=[1,2,1,1,2]<=[4] last_tile_dim_replicate}, frontend_attributes={xla.sdy.sharding="#sdy.sharding<@mesh, [{}, {\"x\"}, {}, {}]>"}, metadata={op_name="psi_r_X_"}
  %psi_r_Y_.1 = c128[64,60,4,432]{3,2,1,0} parameter(3), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, frontend_attributes={xla.sdy.sharding="#sdy.sharding<@mesh, [{}, {}, {}, {\"y\"}]>"}, metadata={op_name="psi_r_Y_"}
  %pL.1 = s32[4]{0} parameter(4), metadata={op_name="pL"}
  %phL.1 = c128[4]{0} parameter(5), metadata={op_name="phL"}
  %pR.1 = s32[4]{0} parameter(6), metadata={op_name="pR"}
  %phR.1 = c128[4]{0} parameter(7), metadata={op_name="phR"}
  %shard_map.36 = (c128[3]{0}, c128[3]{0}, c128[3]{0}, c128[64,216,60,4]{3,2,1,0}, c128[64,60,4,216]{3,2,1,0}, /*index=5*/c128[64,216,60,4]{3,2,1,0}, c128[64,60,4,216]{3,2,1,0}, s32[4]{0}, c128[4]{0}, s32[4]{0}, /*index=10*/c128[4]{0}) custom-call(%broadcast.17, %broadcast.17, %broadcast.17, %psi_l_X_.1, %psi_l_Y_.1, /*index=5*/%psi_r_X_.1, %psi_r_Y_.1, %pL.1, %phL.1, %pR.1, /*index=10*/%phR.1), custom_call_target="xla.sdy.GlobalToLocalShape", custom_call_has_side_effect=true, frontend_attributes={xla.sdy.in_shardings="#sdy.sharding_per_value<[<@mesh, [{}]>, <@mesh, [{}]>, <@mesh, [{}]>, <@mesh, [{}, {\"x\"}, {}, {}]>, <@mesh, [{}, {}, {}, {\"y\"}]>, <@mesh, [{}, {\"x\"}, {}, {}]>, <@mesh, [{}, {}, {}, {\"y\"}]>, <@mesh, [{}]>, <@mesh, [{}]>, <@mesh, [{}]>, <@mesh, [{}]>]>",xla.sdy.manual_axes="#sdy<manual_axes{\"x\", \"y\"}>"}, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.37 = c128[3]{0} get-tuple-element(%shard_map.36), index=0, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.38 = c128[3]{0} get-tuple-element(%shard_map.36), index=1, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.39 = c128[3]{0} get-tuple-element(%shard_map.36), index=2, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.40 = c128[64,216,60,4]{3,2,1,0} get-tuple-element(%shard_map.36), index=3, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.41 = c128[64,60,4,216]{3,2,1,0} get-tuple-element(%shard_map.36), index=4, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.42 = c128[64,216,60,4]{3,2,1,0} get-tuple-element(%shard_map.36), index=5, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.43 = c128[64,60,4,216]{3,2,1,0} get-tuple-element(%shard_map.36), index=6, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.44 = s32[4]{0} get-tuple-element(%shard_map.36), index=7, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.45 = c128[4]{0} get-tuple-element(%shard_map.36), index=8, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.46 = s32[4]{0} get-tuple-element(%shard_map.36), index=9, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.47 = c128[4]{0} get-tuple-element(%shard_map.36), index=10, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  %shard_map.48 = c128[64,216,216]{1,2,0} call(%shard_map.37, %shard_map.38, %shard_map.39, %shard_map.40, %shard_map.41, /*index=5*/%shard_map.42, %shard_map.43, %shard_map.44, %shard_map.45, %shard_map.46, /*index=10*/%shard_map.47), to_apply=%xla.sdy.manual_computation_body.12, frontend_attributes={inlineable="false"}, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
  ROOT %shard_map.49 = c128[64,432,432]{2,1,0} custom-call(%shard_map.48), custom_call_target="xla.sdy.LocalToGlobalShape", custom_call_has_side_effect=true, frontend_attributes={xla.sdy.manual_axes="#sdy<manual_axes{\"x\", \"y\"}>",xla.sdy.out_shardings="#sdy.sharding_per_value<[<@mesh, [{}, {\"x\"}, {\"y\"}]>]>"}, metadata={op_name="jit(fn)/shard_map" stack_frame_id=32}
}

