HloModule jit_matmul, entry_computation_layout={(f64[1917,3]{1,0}, f64[3,102]{1,0}, f64[1917,3]{1,0})->(f64[1917,102]{1,0}, f64[1917,102]{1,0})}, allow_spmd_sharding_propagation_to_parameters={true,true,true}, allow_spmd_sharding_propagation_to_output={true,true}

ENTRY %main.7 (Arg_0.1: f64[1917,3], Arg_1.2: f64[3,102], Arg_2.3: f64[1917,3]) -> (f64[1917,102], f64[1917,102]) {
  %Arg_0.1 = f64[1917,3]{1,0} parameter(0)
  %Arg_1.2 = f64[3,102]{1,0} parameter(1)
  %dot.4 = f64[1917,102]{1,0} dot(%Arg_0.1, %Arg_1.2), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(matmul)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/vnl_ops.py" source_line=373}
  %Arg_2.3 = f64[1917,3]{1,0} parameter(2)
  %dot.5 = f64[1917,102]{1,0} dot(%Arg_2.3, %Arg_1.2), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(matmul)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/vnl_ops.py" source_line=373}
  ROOT %tuple.6 = (f64[1917,102]{1,0}, f64[1917,102]{1,0}) tuple(%dot.4, %dot.5)
}

