HloModule jit__einsum, is_scheduled=true, entry_computation_layout={(c128[26,26]{1,0}, c128[26,2,1947]{2,1,0})->c128[26,2,1947]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="094768204a68b80b525b1079ddb6d59c"}

ENTRY %main.4 (Arg_0.1.0: c128[26,26], Arg_1.2.0: c128[26,2,1947]) -> c128[26,2,1947] {
  %Arg_1.2.0 = c128[26,2,1947]{2,1,0} parameter(1), metadata={op_name="operands[1]" scheduling_name="Arg_1.2.0"}
  %Arg_0.1.0 = c128[26,26]{1,0} parameter(0), metadata={op_name="operands[0]" scheduling_name="Arg_0.1.0"}
  %bitcast.27.0 = c128[26,3894]{1,0} bitcast(%Arg_1.2.0), metadata={scheduling_name="bitcast.27.0"}
  %custom-call.1.0 = (c128[26,3894]{1,0}, s8[1630720]{0}) custom-call(%Arg_0.1.0, %bitcast.27.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=331 scheduling_name="custom-call.1.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["1"],"rhs_contracting_dimensions":["0"],"lhs_batch_dimensions":[],"rhs_batch_dimensions":[]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"676","rhs_stride":"101244","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.1 = c128[26,3894]{1,0} get-tuple-element(%custom-call.1.0), index=0, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=331 scheduling_name="get-tuple-element.1"}
  ROOT %bitcast.1.0 = c128[26,2,1947]{2,1,0} bitcast(%get-tuple-element.1), metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=331 scheduling_name="bitcast.1.0"}
}

