HloModule jit__einsum, entry_computation_layout={(f64[1963,3]{1,0}, f64[3,3]{1,0}, f64[1963,3]{1,0})->f64[1963]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.6 (Arg_0.1: f64[1963,3], Arg_1.2: f64[3,3], Arg_2.3: f64[1963,3]) -> f64[1963] {
  %Arg_2.3 = f64[1963,3]{1,0} parameter(2), metadata={op_name="operands[2]"}
  %Arg_1.2 = f64[3,3]{1,0} parameter(1), metadata={op_name="operands[1]"}
  %Arg_0.1 = f64[1963,3]{1,0} parameter(0), metadata={op_name="operands[0]"}
  %dot.4 = f64[3,1963]{1,0} dot(%Arg_1.2, %Arg_0.1), lhs_contracting_dims={0}, rhs_contracting_dims={1}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=628}
  ROOT %dot.5 = f64[1963]{0} dot(%Arg_2.3, %dot.4), lhs_batch_dims={0}, lhs_contracting_dims={1}, rhs_batch_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(_einsum)/jit(main)/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/psp/run_sternheimer.py" source_line=628}
}

