HloModule jit_sigma_coh, is_scheduled=true, entry_computation_layout={(c128[9,2,320,80]{3,2,1,0}, c128[9,80,2,320]{3,2,1,0}, c128[9,80,2,320]{3,2,1,0}, c128[9,2,320,80]{3,2,1,0}, c128[9,640,640]{2,1,0}, /*index=5*/c128[9,320,320]{2,1,0})->c128[9,80,80]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="564dfb90f5cff5ea69af8c99553750ff"}

%fused_transpose (param_0.28: c128[3,1,2,320,2,320,3]) -> c128[3,3,409600] {
  %param_0.28 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.28"}
  %constant_27_2 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.60.6 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} broadcast(%constant_27_2), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.60.6"}
  %multiply.43.3 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} multiply(%param_0.28, %broadcast.60.6), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.43.3"}
  %bitcast.756.1 = c128[3,409600,3]{2,1,0} bitcast(%multiply.43.3), metadata={scheduling_name="bitcast.756.1"}
  ROOT %transpose.184.1 = c128[3,3,409600]{2,1,0} transpose(%bitcast.756.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.184.1"}
}

%fused_transpose.1 (param_0.30: c128[3,1,2,320,2,320,3]) -> c128[3,409600,3] {
  %param_0.30 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.30"}
  %constant_27_5 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.60.8 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} broadcast(%constant_27_5), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.60.8"}
  %multiply.42.3 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} multiply(%param_0.30, %broadcast.60.8), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.42.3"}
  %bitcast.745.1 = c128[3,409600,3]{2,1,0} bitcast(%multiply.42.3), metadata={scheduling_name="bitcast.745.1"}
  ROOT %transpose.183.1 = c128[3,409600,3]{2,1,0} transpose(%bitcast.745.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.183.1"}
}

%fused_transpose.2 (param_0.152: c128[3,3,2,320,2,320,1], param_1.176: c128[3,3,320,320,1]) -> c128[1228800,3] {
  %param_0.152 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.152"}
  %real.63.3 = f64[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} real(%param_0.152), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.63.3"}
  %imag.63.3 = f64[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} imag(%param_0.152), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.63.3"}
  %negate.63.3 = f64[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} negate(%imag.63.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.63.3"}
  %complex.63.3 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} complex(%real.63.3, %negate.63.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.63.3"}
  %bitcast.641.5 = c128[9,2,320,2,320]{4,3,2,1,0} bitcast(%complex.63.3), metadata={scheduling_name="bitcast.641.5"}
  %param_1.176 = c128[3,3,320,320,1]{4,3,2,1,0} parameter(1), metadata={scheduling_name="param_1.176"}
  %real.69.3 = f64[3,3,320,320,1]{4,3,2,1,0} real(%param_1.176), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.69.3"}
  %imag.69.3 = f64[3,3,320,320,1]{4,3,2,1,0} imag(%param_1.176), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.69.3"}
  %negate.69.3 = f64[3,3,320,320,1]{4,3,2,1,0} negate(%imag.69.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.69.3"}
  %complex.69.3 = c128[3,3,320,320,1]{4,3,2,1,0} complex(%real.69.3, %negate.69.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.69.3"}
  %bitcast.727.5 = c128[9,320,320]{2,1,0} bitcast(%complex.69.3), metadata={scheduling_name="bitcast.727.5"}
  %broadcast.64.5 = c128[9,2,320,2,320]{4,3,2,1,0} broadcast(%bitcast.727.5), dimensions={0,2,4}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="broadcast.64.5"}
  %multiply.40.5 = c128[9,2,320,2,320]{4,3,2,1,0} multiply(%bitcast.641.5, %broadcast.64.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="multiply.40.5"}
  %constant_15_1 = c128[] constant((-0.33333333333333331, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365}
  %broadcast.65.3 = c128[9,2,320,2,320]{4,3,2,1,0} broadcast(%constant_15_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="broadcast.65.3"}
  %multiply.41.3 = c128[9,2,320,2,320]{4,3,2,1,0} multiply(%multiply.40.5, %broadcast.65.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="multiply.41.3"}
  %bitcast.734.1 = c128[3,1228800]{1,0} bitcast(%multiply.41.3), metadata={scheduling_name="bitcast.734.1"}
  ROOT %transpose.182.1 = c128[1228800,3]{1,0} transpose(%bitcast.734.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="transpose.182.1"}
}

%fused_transpose.3 (param_0.153: c128[3,1,320,320,3]) -> c128[3,3,102400] {
  %param_0.153 = c128[3,1,320,320,3]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.153"}
  %real.67.3 = f64[3,1,320,320,3]{4,3,2,1,0} real(%param_0.153), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.67.3"}
  %imag.67.3 = f64[3,1,320,320,3]{4,3,2,1,0} imag(%param_0.153), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.67.3"}
  %negate.67.3 = f64[3,1,320,320,3]{4,3,2,1,0} negate(%imag.67.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.67.3"}
  %complex.67.15 = c128[3,1,320,320,3]{4,3,2,1,0} complex(%real.67.3, %negate.67.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.67.15"}
  %constant_27_1 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.62.26 = c128[3,1,320,320,3]{4,3,2,1,0} broadcast(%constant_27_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.62.26"}
  %multiply.39.15 = c128[3,1,320,320,3]{4,3,2,1,0} multiply(%complex.67.15, %broadcast.62.26), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.39.15"}
  %real.68.5 = f64[3,1,320,320,3]{4,3,2,1,0} real(%multiply.39.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.68.5"}
  %imag.68.7 = f64[3,1,320,320,3]{4,3,2,1,0} imag(%multiply.39.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.68.7"}
  %negate.68.5 = f64[3,1,320,320,3]{4,3,2,1,0} negate(%imag.68.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.68.5"}
  %complex.68.3 = c128[3,1,320,320,3]{4,3,2,1,0} complex(%real.68.5, %negate.68.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.68.3"}
  %bitcast.714.1 = c128[3,102400,3]{2,1,0} bitcast(%complex.68.3), metadata={scheduling_name="bitcast.714.1"}
  ROOT %transpose.181.1 = c128[3,3,102400]{2,1,0} transpose(%bitcast.714.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.181.1"}
}

%fused_transpose.4 (param_0.156: c128[3,1,320,320,3]) -> c128[3,102400,3] {
  %param_0.156 = c128[3,1,320,320,3]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.156"}
  %real.65.3 = f64[3,1,320,320,3]{4,3,2,1,0} real(%param_0.156), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.65.3"}
  %imag.65.3 = f64[3,1,320,320,3]{4,3,2,1,0} imag(%param_0.156), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.65.3"}
  %negate.65.3 = f64[3,1,320,320,3]{4,3,2,1,0} negate(%imag.65.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.65.3"}
  %complex.65.15 = c128[3,1,320,320,3]{4,3,2,1,0} complex(%real.65.3, %negate.65.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.65.15"}
  %constant_27_6 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.62.30 = c128[3,1,320,320,3]{4,3,2,1,0} broadcast(%constant_27_6), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.62.30"}
  %multiply.38.15 = c128[3,1,320,320,3]{4,3,2,1,0} multiply(%complex.65.15, %broadcast.62.30), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.38.15"}
  %real.66.5 = f64[3,1,320,320,3]{4,3,2,1,0} real(%multiply.38.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.66.5"}
  %imag.66.7 = f64[3,1,320,320,3]{4,3,2,1,0} imag(%multiply.38.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.66.7"}
  %negate.66.5 = f64[3,1,320,320,3]{4,3,2,1,0} negate(%imag.66.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.66.5"}
  %complex.66.3 = c128[3,1,320,320,3]{4,3,2,1,0} complex(%real.66.5, %negate.66.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.66.3"}
  %bitcast.691.1 = c128[3,102400,3]{2,1,0} bitcast(%complex.66.3), metadata={scheduling_name="bitcast.691.1"}
  ROOT %transpose.180.1 = c128[3,102400,3]{2,1,0} transpose(%bitcast.691.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.180.1"}
}

%fused_transpose.5 (param_0.147: c128[9,320,320]) -> c128[307200,3] {
  %param_0.147 = c128[9,320,320]{2,1,0} parameter(0), metadata={scheduling_name="param_0.147"}
  %real.64.3 = f64[9,320,320]{2,1,0} real(%param_0.147), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.64.3"}
  %imag.64.3 = f64[9,320,320]{2,1,0} imag(%param_0.147), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.64.3"}
  %negate.64.3 = f64[9,320,320]{2,1,0} negate(%imag.64.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.64.3"}
  %complex.64.3 = c128[9,320,320]{2,1,0} complex(%real.64.3, %negate.64.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.64.3"}
  %bitcast.668.1 = c128[3,307200]{1,0} bitcast(%complex.64.3), metadata={scheduling_name="bitcast.668.1"}
  ROOT %transpose.179.1 = c128[307200,3]{1,0} transpose(%bitcast.668.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.179.1"}
}

%fused_transpose.6 (param_0.155: c128[3,1,2,320,2,320,3]) -> c128[3,3,409600] {
  %param_0.155 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.155"}
  %real.61.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} real(%param_0.155), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.61.3"}
  %imag.61.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} imag(%param_0.155), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.61.3"}
  %negate.61.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} negate(%imag.61.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.61.3"}
  %complex.60.15 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} complex(%real.61.3, %negate.61.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.60.15"}
  %constant_27_4 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.60.32 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} broadcast(%constant_27_4), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.60.32"}
  %multiply.37.15 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} multiply(%complex.60.15, %broadcast.60.32), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.37.15"}
  %real.62.5 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} real(%multiply.37.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.62.5"}
  %imag.62.7 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} imag(%multiply.37.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.62.7"}
  %negate.62.5 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} negate(%imag.62.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.62.5"}
  %complex.62.3 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} complex(%real.62.5, %negate.62.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.62.3"}
  %bitcast.628.1 = c128[3,409600,3]{2,1,0} bitcast(%complex.62.3), metadata={scheduling_name="bitcast.628.1"}
  ROOT %transpose.178.1 = c128[3,3,409600]{2,1,0} transpose(%bitcast.628.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.178.1"}
}

%fused_transpose.7 (param_0.154: c128[3,1,2,320,2,320,3]) -> c128[3,409600,3] {
  %param_0.154 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.154"}
  %real.59.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} real(%param_0.154), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.59.3"}
  %imag.58.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} imag(%param_0.154), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.58.3"}
  %negate.58.3 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} negate(%imag.58.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.58.3"}
  %complex.58.15 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} complex(%real.59.3, %negate.58.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.58.15"}
  %constant_27_3 = c128[] constant((0.57735026918962584, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157}
  %broadcast.60.36 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} broadcast(%constant_27_3), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="broadcast.60.36"}
  %multiply.36.15 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} multiply(%complex.58.15, %broadcast.60.36), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="multiply.36.15"}
  %real.60.5 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} real(%multiply.36.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.60.5"}
  %imag.60.7 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} imag(%multiply.36.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.60.7"}
  %negate.59.5 = f64[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} negate(%imag.60.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.59.5"}
  %complex.59.3 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} complex(%real.60.5, %negate.59.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.59.3"}
  %bitcast.605.1 = c128[3,409600,3]{2,1,0} bitcast(%complex.59.3), metadata={scheduling_name="bitcast.605.1"}
  ROOT %transpose.177.1 = c128[3,409600,3]{2,1,0} transpose(%bitcast.605.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.177.1"}
}

%fused_transpose.8 (param_0.90: c128[9,640,640]) -> c128[1228800,3] {
  %param_0.90 = c128[9,640,640]{2,1,0} parameter(0), metadata={scheduling_name="param_0.90"}
  %real.57.3 = f64[9,640,640]{2,1,0} real(%param_0.90), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="real.57.3"}
  %imag.57.3 = f64[9,640,640]{2,1,0} imag(%param_0.90), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="imag.57.3"}
  %negate.57.3 = f64[9,640,640]{2,1,0} negate(%imag.57.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="negate.57.3"}
  %complex.57.3 = c128[9,640,640]{2,1,0} complex(%real.57.3, %negate.57.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="complex.57.3"}
  %bitcast.583.1 = c128[3,1228800]{1,0} bitcast(%complex.57.3), metadata={scheduling_name="bitcast.583.1"}
  ROOT %transpose.176.1 = c128[1228800,3]{1,0} transpose(%bitcast.583.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="transpose.176.1"}
}

%fused_multiply (param_0.40: c128[3,3,2,320,2,320,1]) -> c128[3,3,2,320,2,320,1] {
  %constant_3_1 = c128[] constant((-0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365}
  %broadcast.59.1 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} broadcast(%constant_3_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="broadcast.59.1"}
  %param_0.40 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.40"}
  ROOT %multiply.44.1 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} multiply(%broadcast.59.1, %param_0.40), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="multiply.44.1"}
}

%fused_subtract (param_0.95: c128[9,320,320], param_1.101: c128[9,640,640], param_2.104: s32[4], param_3.45: u32[], param_4.13: s32[4]) -> c128[9,320,320] {
  %param_1.101 = c128[9,640,640]{2,1,0} parameter(1), metadata={scheduling_name="param_1.101"}
  %constant_9_1 = s32[] constant(0), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379}
  %param_4.13 = s32[4]{0} parameter(4), metadata={scheduling_name="param_4.13"}
  %param_3.45 = u32[] parameter(3), metadata={scheduling_name="param_3.45"}
  %dynamic-slice.12.1 = s32[1]{0} dynamic-slice(%param_4.13, %param_3.45), dynamic_slice_sizes={1}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379 scheduling_name="dynamic-slice.12.1"}
  %bitcast.651.3 = s32[] bitcast(%dynamic-slice.12.1), metadata={scheduling_name="bitcast.651.3"}
  %param_2.104 = s32[4]{0} parameter(2), metadata={scheduling_name="param_2.104"}
  %dynamic-slice.13.1 = s32[1]{0} dynamic-slice(%param_2.104, %param_3.45), dynamic_slice_sizes={1}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379 scheduling_name="dynamic-slice.13.1"}
  %bitcast.657.3 = s32[] bitcast(%dynamic-slice.13.1), metadata={scheduling_name="bitcast.657.3"}
  %dynamic-slice.14.3 = c128[9,320,320]{2,1,0} dynamic-slice(%param_1.101, %constant_9_1, %bitcast.651.3, %bitcast.657.3), dynamic_slice_sizes={9,320,320}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379 scheduling_name="dynamic-slice.14.3"}
  %param_0.95 = c128[9,320,320]{2,1,0} parameter(0), metadata={scheduling_name="param_0.95"}
  ROOT %subtract.3.1 = c128[9,320,320]{2,1,0} subtract(%dynamic-slice.14.3, %param_0.95), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379 scheduling_name="subtract.3.1"}
}

%fused_complex (param_0.149: c128[9,80,2,320]) -> c128[9,80,2,320] {
  %param_0.149 = c128[9,80,2,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.149"}
  %real.56.1 = f64[9,80,2,320]{3,2,1,0} real(%param_0.149), metadata={op_name="jit(sigma_coh)/jit(main)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="real.56.1"}
  %imag.56.1 = f64[9,80,2,320]{3,2,1,0} imag(%param_0.149), metadata={op_name="jit(sigma_coh)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="imag.56.1"}
  %negate.56.1 = f64[9,80,2,320]{3,2,1,0} negate(%imag.56.1), metadata={op_name="jit(sigma_coh)/jit(main)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="negate.56.1"}
  ROOT %complex.56.1 = c128[9,80,2,320]{3,2,1,0} complex(%real.56.1, %negate.56.1), metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="complex.56.1"}
}

%fused_complex.1 (param_0.151: c128[9,80,2,320]) -> c128[9,80,2,320] {
  %param_0.151 = c128[9,80,2,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.151"}
  %real.55.1 = f64[9,80,2,320]{3,2,1,0} real(%param_0.151), metadata={op_name="jit(sigma_coh)/jit(main)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="real.55.1"}
  %imag.55.1 = f64[9,80,2,320]{3,2,1,0} imag(%param_0.151), metadata={op_name="jit(sigma_coh)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="imag.55.1"}
  %negate.55.1 = f64[9,80,2,320]{3,2,1,0} negate(%imag.55.1), metadata={op_name="jit(sigma_coh)/jit(main)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="negate.55.1"}
  ROOT %complex.55.1 = c128[9,80,2,320]{3,2,1,0} complex(%real.55.1, %negate.55.1), metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="complex.55.1"}
}

%add.clone (x.1: c128[], y.1: c128[]) -> c128[] {
  %y.1 = c128[] parameter(1), metadata={scheduling_name="y.1"}
  %x.1 = c128[] parameter(0), metadata={scheduling_name="x.1"}
  ROOT %add.8 = c128[] add(%x.1, %y.1), metadata={scheduling_name="add.8"}
}

%add.1.clone (x.3: c128[], y.3: c128[]) -> c128[] {
  %y.3 = c128[] parameter(1), metadata={scheduling_name="y.3"}
  %x.3 = c128[] parameter(0), metadata={scheduling_name="x.3"}
  ROOT %add.9 = c128[] add(%x.3, %y.3), metadata={scheduling_name="add.9"}
}

ENTRY %main.64_spmd (param.1.0: c128[9,2,320,80], param.6: c128[9,80,2,320], param.2.0: c128[9,80,2,320], param.5.0: c128[9,2,320,80], param.3.0: c128[9,640,640], param.4.0: c128[9,320,320]) -> c128[9,80,80] {
  %param.2.0 = c128[9,80,2,320]{3,2,1,0} parameter(2), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="wfns.psi_yr" scheduling_name="param.2.0"}
  %param.1.0 = c128[9,2,320,80]{3,2,1,0} parameter(0), sharding={devices=[1,1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="wfns.psi_xn" scheduling_name="param.1.0"}
  %constant_10_0 = s32[4]{0} constant({0, 0, 320, 320}), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379}
  %constant_11_0 = s32[4]{0} constant({0, 320, 0, 320}), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379}
  %param.3.0 = c128[9,640,640]{2,1,0} parameter(4), sharding={replicated}, metadata={op_name="W_q" scheduling_name="param.3.0"}
  %param.4.0 = c128[9,320,320]{2,1,0} parameter(5), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="V_q" scheduling_name="param.4.0"}
  %param.6 = c128[9,80,2,320]{3,2,1,0} parameter(1), sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="wfns.psi_xr" scheduling_name="param.6"}
  %param.5.0 = c128[9,2,320,80]{3,2,1,0} parameter(3), sharding={devices=[1,1,2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="wfns.psi_yn" scheduling_name="param.5.0"}
  %loop_complex_fusion = c128[9,80,2,320]{3,2,1,0} fusion(%param.2.0), kind=kLoop, calls=%fused_complex, metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=31 deduplicated_name="loop_complex_fusion" scheduling_name="loop_complex_fusion"}
  %bitcast.574.0 = c128[9,80,640]{2,1,0} bitcast(%loop_complex_fusion), metadata={scheduling_name="bitcast.574.0"}
  %bitcast.564.0 = c128[9,640,80]{2,1,0} bitcast(%param.1.0), metadata={scheduling_name="bitcast.564.0"}
  %custom-call.39.0 = (c128[9,640,640]{2,1,0}, s8[4194304]{0}) custom-call(%bitcast.564.0, %bitcast.574.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(sigma_coh)/jit(main)/ksxn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=30 scheduling_name="custom-call.39.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"51200","rhs_stride":"51200","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.3 = c128[9,640,640]{2,1,0} get-tuple-element(%custom-call.39.0), index=0, metadata={op_name="jit(sigma_coh)/jit(main)/ksxn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/greens_function_kernel.py" source_line=30 scheduling_name="get-tuple-element.3"}
  %loop_transpose_fusion.8 = c128[1228800,3]{1,0} fusion(%get-tuple-element.3), kind=kLoop, calls=%fused_transpose.8, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.8"}
  %partition-id.1 = u32[] partition-id(), metadata={scheduling_name="partition-id.1"}
  %bitcast.587.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.8), metadata={scheduling_name="bitcast.587.0"}
  %fft.0.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} fft(%bitcast.587.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.0.0"}
  %loop_transpose_fusion.7 = c128[3,409600,3]{2,1,0} fusion(%fft.0.0), kind=kLoop, calls=%fused_transpose.7, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.7"}
  %loop_subtract_fusion = c128[9,320,320]{2,1,0} fusion(%param.4.0, %param.3.0, %constant_11_0, %partition-id.1, %constant_10_0), kind=kLoop, calls=%fused_subtract, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=379 scheduling_name="loop_subtract_fusion"}
  %loop_transpose_fusion.5 = c128[307200,3]{1,0} fusion(%loop_subtract_fusion), kind=kLoop, calls=%fused_transpose.5, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.5"}
  %bitcast.609.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.7), metadata={scheduling_name="bitcast.609.0"}
  %fft.1.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} fft(%bitcast.609.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.1.0"}
  %bitcast.672.0 = c128[3,1,320,320,3]{4,3,2,1,0} bitcast(%loop_transpose_fusion.5), metadata={scheduling_name="bitcast.672.0"}
  %fft.3.0 = c128[3,1,320,320,3]{4,3,2,1,0} fft(%bitcast.672.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.3.0"}
  %loop_transpose_fusion.4 = c128[3,102400,3]{2,1,0} fusion(%fft.3.0), kind=kLoop, calls=%fused_transpose.4, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.4"}
  %loop_transpose_fusion.6 = c128[3,3,409600]{2,1,0} fusion(%fft.1.0), kind=kLoop, calls=%fused_transpose.6, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.6"}
  %bitcast.695.0 = c128[3,1,320,320,3]{4,3,2,1,0} bitcast(%loop_transpose_fusion.4), metadata={scheduling_name="bitcast.695.0"}
  %fft.4.0 = c128[3,1,320,320,3]{4,3,2,1,0} fft(%bitcast.695.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.4.0"}
  %loop_transpose_fusion.3 = c128[3,3,102400]{2,1,0} fusion(%fft.4.0), kind=kLoop, calls=%fused_transpose.3, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.3"}
  %bitcast.632.0 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.6), metadata={scheduling_name="bitcast.632.0"}
  %fft.2.0 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} fft(%bitcast.632.0), fft_type=FFT, fft_length={1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.2.0"}
  %bitcast.718.0 = c128[3,3,320,320,1]{4,3,2,1,0} bitcast(%loop_transpose_fusion.3), metadata={scheduling_name="bitcast.718.0"}
  %fft.5.0 = c128[3,3,320,320,1]{4,3,2,1,0} fft(%bitcast.718.0), fft_type=FFT, fft_length={1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(ifftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.5.0"}
  %loop_transpose_fusion.2 = c128[1228800,3]{1,0} fusion(%fft.2.0, %fft.5.0), kind=kLoop, calls=%fused_transpose.2, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="loop_transpose_fusion.2"}
  %bitcast.738.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.2), metadata={scheduling_name="bitcast.738.0"}
  %fft.6.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} fft(%bitcast.738.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.6.0"}
  %loop_transpose_fusion.1 = c128[3,409600,3]{2,1,0} fusion(%fft.6.0), kind=kLoop, calls=%fused_transpose.1, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion.1"}
  %bitcast.749.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.1), metadata={scheduling_name="bitcast.749.0"}
  %fft.7.0 = c128[3,1,2,320,2,320,3]{6,5,4,3,2,1,0} fft(%bitcast.749.0), fft_type=FFT, fft_length={3}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.7.0"}
  %loop_transpose_fusion = c128[3,3,409600]{2,1,0} fusion(%fft.7.0), kind=kLoop, calls=%fused_transpose, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="loop_transpose_fusion"}
  %bitcast.760.0 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion), metadata={scheduling_name="bitcast.760.0"}
  %fft.8.0 = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} fft(%bitcast.760.0), fft_type=FFT, fft_length={1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/jit(fftn)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/fft_helpers.py" source_line=157 scheduling_name="fft.8.0"}
  %loop_multiply_fusion = c128[3,3,2,320,2,320,1]{6,5,4,3,2,1,0} fusion(%fft.8.0), kind=kLoop, calls=%fused_multiply, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/gw_jax.py" source_line=365 scheduling_name="loop_multiply_fusion"}
  %loop_complex_fusion.1 = c128[9,80,2,320]{3,2,1,0} fusion(%param.6), kind=kLoop, calls=%fused_complex.1, metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 deduplicated_name="loop_complex_fusion" scheduling_name="loop_complex_fusion.1"}
  %bitcast.765.0 = c128[9,640,640]{2,1,0} bitcast(%loop_multiply_fusion), metadata={scheduling_name="bitcast.765.0"}
  %bitcast.558.0 = c128[9,80,640]{2,1,0} bitcast(%loop_complex_fusion.1), metadata={scheduling_name="bitcast.558.0"}
  %custom-call.40.0 = (c128[9,80,640]{2,1,0}, s8[4194304]{0}) custom-call(%bitcast.558.0, %bitcast.765.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(sigma_coh)/jit(main)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="custom-call.40.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"51200","rhs_stride":"409600","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.1.0 = c128[9,80,640]{2,1,0} get-tuple-element(%custom-call.40.0), index=0, metadata={op_name="jit(sigma_coh)/jit(main)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="get-tuple-element.1.0"}
  %bitcast.769.0 = c128[9,80,2,320]{3,2,1,0} bitcast(%get-tuple-element.1.0), metadata={scheduling_name="bitcast.769.0"}
  %all-reduce-start = c128[9,80,2,320]{3,2,1,0} all-reduce-start(%bitcast.769.0), channel_id=1, replica_groups={{0,2},{1,3}}, use_global_device_ids=true, to_apply=%add.clone, metadata={op_name="jit(sigma_coh)/jit(main)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="all-reduce-start"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":true,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %all-reduce-done = c128[9,80,2,320]{3,2,1,0} all-reduce-done(%all-reduce-start), metadata={op_name="jit(sigma_coh)/jit(main)/kmsx,ksxty->kmty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=15 scheduling_name="all-reduce-done"}
  %bitcast.773.0 = c128[9,80,640]{2,1,0} bitcast(%all-reduce-done), metadata={scheduling_name="bitcast.773.0"}
  %bitcast.777.0 = c128[9,640,80]{2,1,0} bitcast(%param.5.0), metadata={scheduling_name="bitcast.777.0"}
  %custom-call.41.0 = (c128[9,80,80]{2,1,0}, s8[4194304]{0}) custom-call(%bitcast.773.0, %bitcast.777.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(sigma_coh)/jit(main)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=16 scheduling_name="custom-call.41.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"51200","rhs_stride":"51200","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.2.0 = c128[9,80,80]{2,1,0} get-tuple-element(%custom-call.41.0), index=0, metadata={op_name="jit(sigma_coh)/jit(main)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=16 scheduling_name="get-tuple-element.2.0"}
  %all-reduce-start.1 = c128[9,80,80]{2,1,0} all-reduce-start(%get-tuple-element.2.0), channel_id=2, replica_groups={{0,1},{2,3}}, use_global_device_ids=true, to_apply=%add.1.clone, metadata={op_name="jit(sigma_coh)/jit(main)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=16 scheduling_name="all-reduce-start.1"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":true,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  ROOT %all-reduce-done.1 = c128[9,80,80]{2,1,0} all-reduce-done(%all-reduce-start.1), metadata={op_name="jit(sigma_coh)/jit(main)/kmty,ktyn->kmn/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/projection_kernel.py" source_line=16 scheduling_name="all-reduce-done.1"}
}

