HloModule jit_inv, entry_computation_layout={(f64[3,3]{1,0})->f64[3,3]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

%_lu_solve.8 (Arg_0.9: f64[3,3], Arg_1.10: s32[3], Arg_2.11: f64[3,3]) -> f64[3,3] {
  %Arg_0.9 = f64[3,3]{1,0} parameter(0), metadata={op_name="jit(inv)/jit(main)/jit(solve)/pjit"}
  %Arg_2.11 = f64[3,3]{1,0} parameter(2), metadata={op_name="jit(inv)/jit(main)/jit(solve)/pjit"}
  %reshape.16 = f64[3,3,1]{2,1,0} reshape(%Arg_2.11), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %Arg_1.10 = s32[3]{0} parameter(1), metadata={op_name="jit(inv)/jit(main)/jit(solve)/pjit"}
  %constant.14 = s32[] constant(0)
  %broadcast.15 = s32[3]{0} broadcast(%constant.14), dimensions={}
  %compare.17 = pred[3]{0} compare(%Arg_1.10, %broadcast.15), direction=LT, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %constant.12 = s32[] constant(3)
  %broadcast.13 = s32[3]{0} broadcast(%constant.12), dimensions={}
  %add.18 = s32[3]{0} add(%Arg_1.10, %broadcast.13), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %select.19 = s32[3]{0} select(%compare.17, %add.18, %Arg_1.10), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %reshape.20 = s32[3,1]{1,0} reshape(%select.19), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %gather.21 = f64[3,3,1]{2,1,0} gather(%reshape.16, %reshape.20), offset_dims={0,2}, collapsed_slice_dims={1}, start_index_map={1}, index_vector_dim=1, slice_sizes={3,1,1}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/gather" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %transpose.22 = f64[3,1,3]{1,0,2} transpose(%gather.21), dimensions={1,2,0}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %reshape.23 = f64[3,3]{1,0} reshape(%transpose.22), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %triangular-solve.24 = f64[3,3]{1,0} triangular-solve(%Arg_0.9, %reshape.23), left_side=true, lower=true, unit_diagonal=true, transpose_a=NO_TRANSPOSE, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/triangular_solve" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %triangular-solve.25 = f64[3,3]{1,0} triangular-solve(%Arg_0.9, %triangular-solve.24), left_side=true, transpose_a=NO_TRANSPOSE, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/triangular_solve" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %reshape.26 = f64[3,1,3]{2,1,0} reshape(%triangular-solve.25), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/reshape" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %transpose.27 = f64[3,3,1]{0,2,1} transpose(%reshape.26), dimensions={2,0,1}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  ROOT %reshape.28 = f64[3,3]{1,0} reshape(%transpose.27), metadata={op_name="jit(inv)/jit(main)/jit(solve)/vmap(jit(_lu_solve))/squeeze" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
}

%solve.29 (Arg_0.30: f64[3,3], Arg_1.31: f64[3,3]) -> f64[3,3] {
  %Arg_0.30 = f64[3,3]{1,0} parameter(0), metadata={op_name="jit(inv)/jit(main)/pjit"}
  %custom-call.37 = (f64[3,3]{0,1}, s32[3]{0}, s32[]) custom-call(%Arg_0.30), custom_call_target="cusolver_getrf_ffi", operand_layout_constraints={f64[3,3]{0,1}}, output_to_operand_aliasing={{0}: (0, {})}, api_version=API_VERSION_TYPED_FFI, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}, backend_config={}
  %get-tuple-element.40 = s32[] get-tuple-element(%custom-call.37), index=2, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %constant.36 = s32[] constant(0)
  %compare.42 = pred[] compare(%get-tuple-element.40, %constant.36), direction=GE, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %reshape.43 = pred[1,1]{1,0} reshape(%compare.42), metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %broadcast.44 = pred[1,1]{1,0} broadcast(%reshape.43), dimensions={0,1}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %reshape.45 = pred[] reshape(%broadcast.44), metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %broadcast.46 = pred[3,3]{1,0} broadcast(%reshape.45), dimensions={}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %get-tuple-element.38 = f64[3,3]{0,1} get-tuple-element(%custom-call.37), index=0, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %constant.32 = f64[] constant(nan)
  %broadcast.33 = f64[3,3]{1,0} broadcast(%constant.32), dimensions={}
  %select.47 = f64[3,3]{1,0} select(%broadcast.46, %get-tuple-element.38, %broadcast.33), metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %get-tuple-element.39 = s32[3]{0} get-tuple-element(%custom-call.37), index=1, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %constant.34 = s32[] constant(1)
  %broadcast.35 = s32[3]{0} broadcast(%constant.34), dimensions={}
  %subtract.41 = s32[3]{0} subtract(%get-tuple-element.39, %broadcast.35), metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %custom-call.48 = s32[3]{0} custom-call(%subtract.41), custom_call_target="cu_lu_pivots_to_permutation", operand_layout_constraints={s32[3]{0}}, api_version=API_VERSION_TYPED_FFI, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/lu_pivots_to_permutation" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}, backend_config={}
  %Arg_1.31 = f64[3,3]{1,0} parameter(1), metadata={op_name="jit(inv)/jit(main)/pjit"}
  %transpose.49 = f64[3,3]{0,1} transpose(%Arg_1.31), dimensions={1,0}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %call.50 = f64[3,3]{1,0} call(%select.47, %custom-call.48, %transpose.49), to_apply=%_lu_solve.8
  ROOT %transpose.51 = f64[3,3]{0,1} transpose(%call.50), dimensions={1,0}, metadata={op_name="jit(inv)/jit(main)/jit(solve)/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
}

ENTRY %main.53 (Arg_0.1: f64[3,3]) -> f64[3,3] {
  %Arg_0.1 = f64[3,3]{1,0} parameter(0), metadata={op_name="a"}
  %iota.2 = s64[3]{0} iota(), iota_dimension=0, metadata={op_name="jit(inv)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %broadcast.3 = s64[3,3]{1,0} broadcast(%iota.2), dimensions={0}, metadata={op_name="jit(inv)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %iota.4 = s64[3]{0} iota(), iota_dimension=0, metadata={op_name="jit(inv)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %broadcast.5 = s64[3,3]{1,0} broadcast(%iota.4), dimensions={1}, metadata={op_name="jit(inv)/jit(main)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %compare.6 = pred[3,3]{1,0} compare(%broadcast.3, %broadcast.5), direction=EQ, metadata={op_name="jit(inv)/jit(main)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  %convert.7 = f64[3,3]{1,0} convert(%compare.6), metadata={op_name="jit(inv)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/vcoul.py" source_line=272}
  ROOT %call.52 = f64[3,3]{0,1} call(%Arg_0.1, %convert.7), to_apply=%solve.29
}

