HloModule jit_get_sqrt_v_and_phase, is_scheduled=true, entry_computation_layout={(f64[9,3]{1,0})->(c128[9,2419]{1,0}, c128[9,1,24,24,80]{4,3,2,1,0})}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true,true}, frontend_attributes={fingerprint_before_lhs="4232c07069a598b19168729bb30a7f8b"}

%region_0.129 (Arg_0.130: f64[], Arg_1.131: f64[]) -> f64[] {
  %Arg_1.131 = f64[] parameter(1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/reduce_sum" scheduling_name="Arg_1.131"}
  %Arg_0.130 = f64[] parameter(0), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/reduce_sum" scheduling_name="Arg_0.130"}
  ROOT %add.17 = f64[] add(%Arg_0.130, %Arg_1.131), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=406 scheduling_name="add.17"}
}

%fused_gather (param_0.24: s32[2419,1], param_1.205: f64[24,24,80,3], param_2.135: f64[3], param_3.83: f64[9,3], param_4.60: f64[3], param_5.60: f64[3]) -> c128[2419,1,9] {
  %param_1.205 = f64[24,24,80,3]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.205"}
  %broadcast.145.25 = f64[9,24,24,80,3]{4,3,2,1,0} broadcast(%param_1.205), dimensions={1,2,3,4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=404 scheduling_name="broadcast.145.25"}
  %param_3.83 = f64[9,3]{1,0} parameter(3), metadata={scheduling_name="param_3.83"}
  %slice.15.7 = f64[9,1]{1,0} slice(%param_3.83), slice={[0:9], [0:1]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=399 scheduling_name="slice.15.7"}
  %constant_99 = f64[] constant(0.33333333333333331)
  %broadcast.146.14 = f64[9,1]{1,0} broadcast(%constant_99), dimensions={}, metadata={scheduling_name="broadcast.146.14"}
  %multiply.66.7 = f64[9,1]{1,0} multiply(%slice.15.7, %broadcast.146.14), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=399 scheduling_name="multiply.66.7"}
  %bitcast.495.12 = f64[9]{0} bitcast(%multiply.66.7), metadata={scheduling_name="bitcast.495.12"}
  %broadcast.147.7 = f64[9,3]{1,0} broadcast(%bitcast.495.12), dimensions={0}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.147.7"}
  %param_5.60 = f64[3]{0} parameter(5), metadata={scheduling_name="param_5.60"}
  %broadcast.148.5 = f64[9,3]{1,0} broadcast(%param_5.60), dimensions={1}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.148.5"}
  %multiply.67.5 = f64[9,3]{1,0} multiply(%broadcast.147.7, %broadcast.148.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="multiply.67.5"}
  %slice.16.7 = f64[9,1]{1,0} slice(%param_3.83), slice={[0:9], [1:2]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=400 scheduling_name="slice.16.7"}
  %multiply.68.7 = f64[9,1]{1,0} multiply(%slice.16.7, %broadcast.146.14), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=400 scheduling_name="multiply.68.7"}
  %bitcast.508.12 = f64[9]{0} bitcast(%multiply.68.7), metadata={scheduling_name="bitcast.508.12"}
  %broadcast.150.7 = f64[9,3]{1,0} broadcast(%bitcast.508.12), dimensions={0}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.150.7"}
  %param_4.60 = f64[3]{0} parameter(4), metadata={scheduling_name="param_4.60"}
  %broadcast.151.5 = f64[9,3]{1,0} broadcast(%param_4.60), dimensions={1}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.151.5"}
  %multiply.69.5 = f64[9,3]{1,0} multiply(%broadcast.150.7, %broadcast.151.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="multiply.69.5"}
  %add.18.3 = f64[9,3]{1,0} add(%multiply.67.5, %multiply.69.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="add.18.3"}
  %slice.17.4 = f64[9,1]{1,0} slice(%param_3.83), slice={[0:9], [2:3]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=401 scheduling_name="slice.17.4"}
  %bitcast.518.10 = f64[9]{0} bitcast(%slice.17.4), metadata={scheduling_name="bitcast.518.10"}
  %broadcast.152.7 = f64[9,3]{1,0} broadcast(%bitcast.518.10), dimensions={0}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.152.7"}
  %param_2.135 = f64[3]{0} parameter(2), metadata={scheduling_name="param_2.135"}
  %broadcast.153.5 = f64[9,3]{1,0} broadcast(%param_2.135), dimensions={1}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="broadcast.153.5"}
  %multiply.70.5 = f64[9,3]{1,0} multiply(%broadcast.152.7, %broadcast.153.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="multiply.70.5"}
  %add.19.3 = f64[9,3]{1,0} add(%add.18.3, %multiply.70.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=403 scheduling_name="add.19.3"}
  %broadcast.154.25 = f64[9,24,24,80,3]{4,3,2,1,0} broadcast(%add.19.3), dimensions={0,4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=404 scheduling_name="broadcast.154.25"}
  %add.20.25 = f64[9,24,24,80,3]{4,3,2,1,0} add(%broadcast.145.25, %broadcast.154.25), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=404 scheduling_name="add.20.25"}
  %multiply.71.5 = f64[9,24,24,80,3]{4,3,2,1,0} multiply(%add.20.25, %add.20.25), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=406 scheduling_name="multiply.71.5"}
  %constant_3_1 = f64[] constant(0)
  %reduce.133.5 = f64[9,24,24,80]{3,2,1,0} reduce(%multiply.71.5, %constant_3_1), dimensions={4}, to_apply=%region_0.129, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=406 scheduling_name="reduce.133.5"}
  %constant_5_1 = f64[] constant(30)
  %broadcast.155.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_5_1), dimensions={}, metadata={scheduling_name="broadcast.155.1"}
  %compare.10.3 = pred[9,24,24,80]{3,2,1,0} compare(%reduce.133.5, %broadcast.155.1), direction=GT, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/gt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=418 scheduling_name="compare.10.3"}
  %broadcast.156.14 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_3_1), dimensions={}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="broadcast.156.14"}
  %constant_17_1 = f64[] constant(1e-12)
  %broadcast.157.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_17_1), dimensions={}, metadata={scheduling_name="broadcast.157.1"}
  %compare.11.3 = pred[9,24,24,80]{3,2,1,0} compare(%reduce.133.5, %broadcast.157.1), direction=LT, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/lt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=407 scheduling_name="compare.11.3"}
  %constant_9_1 = f64[] constant(25.132741228718345)
  %broadcast.159.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_9_1), dimensions={}, metadata={scheduling_name="broadcast.159.1"}
  %constant_11_1 = f64[] constant(1)
  %broadcast.160.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_11_1), dimensions={}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="broadcast.160.1"}
  %select.18.11 = f64[9,24,24,80]{3,2,1,0} select(%compare.11.3, %broadcast.160.1, %reduce.133.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="select.18.11"}
  %divide.2.11 = f64[9,24,24,80]{3,2,1,0} divide(%broadcast.159.1, %select.18.11), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=414 scheduling_name="divide.2.11"}
  %broadcast.161.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_11_1), dimensions={}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="broadcast.161.1"}
  %slice.18.5 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.25), slice={[0:9], [0:24], [0:24], [0:80], [0:1]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="slice.18.5"}
  %multiply.72.7 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.18.5, %slice.18.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/integer_pow" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="multiply.72.7"}
  %slice.19.5 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.25), slice={[0:9], [0:24], [0:24], [0:80], [1:2]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="slice.19.5"}
  %multiply.73.7 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.19.5, %slice.19.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/integer_pow" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="multiply.73.7"}
  %add.21.7 = f64[9,24,24,80,1]{4,3,2,1,0} add(%multiply.72.7, %multiply.73.7), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="add.21.7"}
  %sqrt.5.5 = f64[9,24,24,80,1]{4,3,2,1,0} sqrt(%add.21.7), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/sqrt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=410 scheduling_name="sqrt.5.5"}
  %constant_15_1 = f64[] constant(-11.33835674775462)
  %broadcast.162.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_15_1), dimensions={}, metadata={scheduling_name="broadcast.162.1"}
  %multiply.74.5 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%sqrt.5.5, %broadcast.162.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="multiply.74.5"}
  %exponential.7.3 = f64[9,24,24,80,1]{4,3,2,1,0} exponential(%multiply.74.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="exponential.7.3"}
  %slice.20.9 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.25), slice={[0:9], [0:24], [0:24], [0:80], [2:3]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=411 scheduling_name="slice.20.9"}
  %constant_13_1 = f64[] constant(11.33835674775462)
  %broadcast.163.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_13_1), dimensions={}, metadata={scheduling_name="broadcast.163.1"}
  %multiply.75.7 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.20.9, %broadcast.163.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="multiply.75.7"}
  %cosine.5.5 = f64[9,24,24,80,1]{4,3,2,1,0} cosine(%multiply.75.7), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/cos" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="cosine.5.5"}
  %multiply.76.7 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%exponential.7.3, %cosine.5.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="multiply.76.7"}
  %subtract.3.7 = f64[9,24,24,80,1]{4,3,2,1,0} subtract(%broadcast.161.1, %multiply.76.7), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=412 scheduling_name="subtract.3.7"}
  %bitcast.581.9 = f64[9,24,24,80]{3,2,1,0} bitcast(%subtract.3.7), metadata={scheduling_name="bitcast.581.9"}
  %multiply.78.9 = f64[9,24,24,80]{3,2,1,0} multiply(%divide.2.11, %bitcast.581.9), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=414 scheduling_name="multiply.78.9"}
  %constant_7_1 = f64[] constant(0.0014240933398978817)
  %broadcast.164.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_7_1), dimensions={}, metadata={scheduling_name="broadcast.164.1"}
  %multiply.79.7 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.78.9, %broadcast.164.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=415 scheduling_name="multiply.79.7"}
  %select.19.5 = f64[9,24,24,80]{3,2,1,0} select(%compare.11.3, %broadcast.156.14, %multiply.79.7), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="select.19.5"}
  %select.20.3 = f64[9,24,24,80]{3,2,1,0} select(%compare.10.3, %broadcast.156.14, %select.19.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=408 scheduling_name="select.20.3"}
  %compare.12.3 = pred[9,24,24,80]{3,2,1,0} compare(%select.20.3, %broadcast.156.14), direction=GT, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/gt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=419 scheduling_name="compare.12.3"}
  %sqrt.6.1 = f64[9,24,24,80]{3,2,1,0} sqrt(%select.20.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/sqrt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=419 scheduling_name="sqrt.6.1"}
  %select.21.3 = f64[9,24,24,80]{3,2,1,0} select(%compare.12.3, %sqrt.6.1, %broadcast.156.14), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=419 scheduling_name="select.21.3"}
  %bitcast.600.3 = f64[9,46080]{1,0} bitcast(%select.21.3), metadata={scheduling_name="bitcast.600.3"}
  %convert.10.3 = c128[9,46080]{1,0} convert(%bitcast.600.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=421 scheduling_name="convert.10.3"}
  %bitcast.604.1 = c128[46080,9]{0,1} bitcast(%convert.10.3), metadata={scheduling_name="bitcast.604.1"}
  %param_0.24 = s32[2419,1]{1,0} parameter(0), metadata={scheduling_name="param_0.24"}
  ROOT %gather.2 = c128[2419,1,9]{0,2,1} gather(%bitcast.604.1, %param_0.24), offset_dims={1,2}, collapsed_slice_dims={}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,9}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/gather" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=421 scheduling_name="gather.2"}
}

%fused_complex (param_0.181: f64[1,1,9,24,24], param_1.208: f64[80], param_2.138: f64[9,3]) -> c128[9,1,24,24,80] {
  %param_0.181 = f64[1,1,9,24,24]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.181"}
  %bitcast.630.21 = f64[9,24,24]{2,1,0} bitcast(%param_0.181), metadata={scheduling_name="bitcast.630.21"}
  %broadcast.175.21 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%bitcast.630.21), dimensions={0,2,3}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.175.21"}
  %param_2.138 = f64[9,3]{1,0} parameter(2), metadata={scheduling_name="param_2.138"}
  %slice.17.6 = f64[9,1]{1,0} slice(%param_2.138), slice={[0:9], [2:3]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=401 scheduling_name="slice.17.6"}
  %bitcast.518.12 = f64[9]{0} bitcast(%slice.17.6), metadata={scheduling_name="bitcast.518.12"}
  %broadcast.176.5 = f64[1,1,1,9,80]{4,3,2,1,0} broadcast(%bitcast.518.12), dimensions={3}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=394 scheduling_name="broadcast.176.5"}
  %param_1.208 = f64[80]{0} parameter(1), metadata={scheduling_name="param_1.208"}
  %broadcast.177.3 = f64[1,1,1,9,80]{4,3,2,1,0} broadcast(%param_1.208), dimensions={4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=394 scheduling_name="broadcast.177.3"}
  %multiply.82.3 = f64[1,1,1,9,80]{4,3,2,1,0} multiply(%broadcast.176.5, %broadcast.177.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=394 scheduling_name="multiply.82.3"}
  %bitcast.639.21 = f64[9,80]{1,0} bitcast(%multiply.82.3), metadata={scheduling_name="bitcast.639.21"}
  %broadcast.178.21 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%bitcast.639.21), dimensions={0,4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.178.21"}
  %add.23.19 = f64[9,1,24,24,80]{4,3,2,1,0} add(%broadcast.175.21, %broadcast.178.21), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="add.23.19"}
  %convert.11.19 = c128[9,1,24,24,80]{4,3,2,1,0} convert(%add.23.19), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="convert.11.19"}
  %constant_20_1 = c128[] constant((0, -6.2831853071795862))
  %broadcast.179.19 = c128[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_20_1), dimensions={}, metadata={scheduling_name="broadcast.179.19"}
  %multiply.83.19 = c128[9,1,24,24,80]{4,3,2,1,0} multiply(%convert.11.19, %broadcast.179.19), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.83.19"}
  %real.2.11 = f64[9,1,24,24,80]{4,3,2,1,0} real(%multiply.83.19), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="real.2.11"}
  %exponential.8.3 = f64[9,1,24,24,80]{4,3,2,1,0} exponential(%real.2.11), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="exponential.8.3"}
  %constant_33_1 = f64[] constant(inf)
  %broadcast.180.1 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_33_1), dimensions={}, metadata={scheduling_name="broadcast.180.1"}
  %compare.13.1 = pred[9,1,24,24,80]{4,3,2,1,0} compare(%exponential.8.3, %broadcast.180.1), direction=EQ, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="compare.13.1"}
  %constant_31_1 = f64[] constant(0.5)
  %broadcast.181.3 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_31_1), dimensions={}, metadata={scheduling_name="broadcast.181.3"}
  %multiply.84.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%real.2.11, %broadcast.181.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.84.5"}
  %exponential.9.3 = f64[9,1,24,24,80]{4,3,2,1,0} exponential(%multiply.84.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="exponential.9.3"}
  %imag.2.5 = f64[9,1,24,24,80]{4,3,2,1,0} imag(%multiply.83.19), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="imag.2.5"}
  %cosine.6.1 = f64[9,1,24,24,80]{4,3,2,1,0} cosine(%imag.2.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="cosine.6.1"}
  %multiply.85.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.9.3, %cosine.6.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.85.5"}
  %multiply.87.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%multiply.85.5, %exponential.9.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.87.5"}
  %multiply.88.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.8.3, %cosine.6.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.88.3"}
  %select.22.3 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.13.1, %multiply.87.5, %multiply.88.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="select.22.3"}
  %constant_3_2 = f64[] constant(0)
  %broadcast.183.6 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_3_2), dimensions={}, metadata={scheduling_name="broadcast.183.6"}
  %compare.14.3 = pred[9,1,24,24,80]{4,3,2,1,0} compare(%imag.2.5, %broadcast.183.6), direction=EQ, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="compare.14.3"}
  %sine.2.1 = f64[9,1,24,24,80]{4,3,2,1,0} sine(%imag.2.5), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="sine.2.1"}
  %multiply.89.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.9.3, %sine.2.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.89.3"}
  %multiply.91.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%multiply.89.3, %exponential.9.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.91.3"}
  %multiply.92.1 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.8.3, %sine.2.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="multiply.92.1"}
  %select.23.1 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.13.1, %multiply.91.3, %multiply.92.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="select.23.1"}
  %select.24.3 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.14.3, %broadcast.183.6, %select.23.1), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="select.24.3"}
  ROOT %complex.2.1 = c128[9,1,24,24,80]{4,3,2,1,0} complex(%select.22.3, %select.24.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="complex.2.1"}
}

%fused_add (param_0.149: f64[24], param_1.209: f64[9,3]) -> f64[1,1,9,24,24] {
  %param_1.209 = f64[9,3]{1,0} parameter(1), metadata={scheduling_name="param_1.209"}
  %slice.15.3 = f64[9,1]{1,0} slice(%param_1.209), slice={[0:9], [0:1]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=399 scheduling_name="slice.15.3"}
  %constant_98 = f64[] constant(0.33333333333333331)
  %broadcast.146.4 = f64[9,1]{1,0} broadcast(%constant_98), dimensions={}, metadata={scheduling_name="broadcast.146.4"}
  %multiply.66.3 = f64[9,1]{1,0} multiply(%slice.15.3, %broadcast.146.4), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=399 scheduling_name="multiply.66.3"}
  %bitcast.495.6 = f64[9]{0} bitcast(%multiply.66.3), metadata={scheduling_name="bitcast.495.6"}
  %broadcast.168.5 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%bitcast.495.6), dimensions={3}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.168.5"}
  %param_0.149 = f64[24]{0} parameter(0), metadata={scheduling_name="param_0.149"}
  %broadcast.169.6 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%param_0.149), dimensions={4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.169.6"}
  %multiply.80.3 = f64[1,1,1,9,24]{4,3,2,1,0} multiply(%broadcast.168.5, %broadcast.169.6), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="multiply.80.3"}
  %bitcast.616.3 = f64[9,24]{1,0} bitcast(%multiply.80.3), metadata={scheduling_name="bitcast.616.3"}
  %broadcast.170.3 = f64[1,1,9,24,24]{4,3,2,1,0} broadcast(%bitcast.616.3), dimensions={2,3}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.170.3"}
  %slice.16.3 = f64[9,1]{1,0} slice(%param_1.209), slice={[0:9], [1:2]}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=400 scheduling_name="slice.16.3"}
  %multiply.68.3 = f64[9,1]{1,0} multiply(%slice.16.3, %broadcast.146.4), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=400 scheduling_name="multiply.68.3"}
  %bitcast.508.6 = f64[9]{0} bitcast(%multiply.68.3), metadata={scheduling_name="bitcast.508.6"}
  %broadcast.171.5 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%bitcast.508.6), dimensions={3}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=393 scheduling_name="broadcast.171.5"}
  %multiply.81.3 = f64[1,1,1,9,24]{4,3,2,1,0} multiply(%broadcast.171.5, %broadcast.169.6), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=393 scheduling_name="multiply.81.3"}
  %bitcast.626.3 = f64[9,24]{1,0} bitcast(%multiply.81.3), metadata={scheduling_name="bitcast.626.3"}
  %broadcast.174.3 = f64[1,1,9,24,24]{4,3,2,1,0} broadcast(%bitcast.626.3), dimensions={2,4}, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="broadcast.174.3"}
  ROOT %add.22.1 = f64[1,1,9,24,24]{4,3,2,1,0} add(%broadcast.170.3, %broadcast.174.3), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="add.22.1"}
}

ENTRY %main.189 (Arg_0.1.0: f64[9,3]) -> (c128[9,2419], c128[9,1,24,24,80]) {
  %Arg_0.1.0 = f64[9,3]{1,0} parameter(0), metadata={op_name="qvec_wrapped" scheduling_name="Arg_0.1.0"}
  %constant_18_0 = f64[24]{0} constant({...}), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392}
  %constant_30_0 = f64[80]{0} constant({...}), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=394}
  %constant_2_0 = s32[2419,1]{1,0} constant({...})
  %constant_32_0 = f64[3]{0} constant({1.0507622167739268, 0.60665637184174681, -0})
  %constant_34_0 = f64[3]{0} constant({0, 1.2133158112027018, 0})
  %constant_38_0 = f64[3]{0} constant({0, -0, 0.27707653970333357})
  %constant_8_0 = f64[24,24,80,3]{3,2,1,0} constant({...}), metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=404}
  %loop_add_fusion = f64[1,1,9,24,24]{4,3,2,1,0} fusion(%constant_18_0, %Arg_0.1.0), kind=kLoop, calls=%fused_add, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=392 scheduling_name="loop_add_fusion"}
  %loop_complex_fusion = c128[9,1,24,24,80]{4,3,2,1,0} fusion(%loop_add_fusion, %constant_30_0, %Arg_0.1.0), kind=kLoop, calls=%fused_complex, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=391 scheduling_name="loop_complex_fusion"}
  %loop_gather_fusion = c128[2419,1,9]{0,2,1} fusion(%constant_2_0, %constant_8_0, %constant_38_0, %Arg_0.1.0, %constant_34_0, /*index=5*/%constant_32_0), kind=kLoop, calls=%fused_gather, metadata={op_name="jit(get_sqrt_v_and_phase)/jit(main)/gather" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/compute_vcoul.py" source_line=421 scheduling_name="loop_gather_fusion"}
  %bitcast.609.0 = c128[9,2419]{1,0} bitcast(%loop_gather_fusion), metadata={scheduling_name="bitcast.609.0"}
  ROOT %tuple.188.0 = (c128[9,2419]{1,0}, c128[9,1,24,24,80]{4,3,2,1,0}) tuple(%bitcast.609.0, %loop_complex_fusion), metadata={scheduling_name="tuple.188.0"}
}

