HloModule jit_greater, entry_computation_layout={(f64[], s64[])->pred[]}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.5 (Arg_0.1: f64[], Arg_1.2: s64[]) -> pred[] {
  %Arg_0.1 = f64[] parameter(0), metadata={op_name="x"}
  %Arg_1.2 = s64[] parameter(1), metadata={op_name="y"}
  %convert.3 = f64[] convert(%Arg_1.2), metadata={op_name="jit(greater)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=81}
  ROOT %compare.4 = pred[] compare(%Arg_0.1, %convert.3), direction=GT, metadata={op_name="jit(greater)/jit(main)/gt" source_file="/global/homes/j/jackm/software/lorrax_C/src/common/load_wfns.py" source_line=81}
}

