HloModule jit_sigma_coh, is_scheduled=true, entry_computation_layout={(c128[64,2,240,60]{3,2,1,0}, c128[64,60,2,240]{3,2,1,0}, c128[64,60,2,240]{3,2,1,0}, c128[64,2,240,60]{3,2,1,0}, c128[16,480,480]{2,1,0}, /*index=5*/c128[64,240,240]{2,1,0})->c128[64,60,60]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="26b37ffb8f1722a413cf2d54c7e6754d"}

%fused_transpose (param_0.59: c128[4,4,2,240,2,240,4]) -> c128[16,4,230400] {
  %constant_3_1 = c128[] constant((-0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87}
  %broadcast.70.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_3_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="broadcast.70.3"}
  %param_0.59 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.59"}
  %constant_33_2 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.16 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_2), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.16"}
  %multiply.65.5 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%param_0.59, %broadcast.71.16), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.65.5"}
  %multiply.66.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%broadcast.70.3, %multiply.65.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="multiply.66.3"}
  %bitcast.872.1 = c128[16,230400,4]{2,1,0} bitcast(%multiply.66.3), metadata={scheduling_name="bitcast.872.1"}
  ROOT %transpose.260.1 = c128[16,4,230400]{2,1,0} transpose(%bitcast.872.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="transpose.260.1"}
}

%fused_transpose.1 (param_0.44: c128[4,4,2,240,2,240,4]) -> c128[4,4,230400,4] {
  %param_0.44 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.44"}
  %constant_33_7 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.10 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_7), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.10"}
  %multiply.64.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%param_0.44, %broadcast.71.10), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.64.3"}
  %bitcast.860.1 = c128[4,4,230400,4]{3,2,1,0} bitcast(%multiply.64.3), metadata={scheduling_name="bitcast.860.1"}
  ROOT %transpose.259.1 = c128[4,4,230400,4]{3,2,1,0} transpose(%bitcast.860.1), dimensions={0,3,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.259.1"}
}

%fused_transpose.2 (param_0.46: c128[4,4,2,240,2,240,4]) -> c128[4,921600,4] {
  %param_0.46 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.46"}
  %constant_33_6 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.12 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_6), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.12"}
  %multiply.63.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%param_0.46, %broadcast.71.12), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.63.3"}
  %bitcast.849.1 = c128[4,921600,4]{2,1,0} bitcast(%multiply.63.3), metadata={scheduling_name="bitcast.849.1"}
  ROOT %transpose.258.1 = c128[4,921600,4]{2,1,0} transpose(%bitcast.849.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.258.1"}
}

%fused_transpose.3 (param_0.7: c128[64,2,240,2,240]) -> c128[3686400,4] {
  %param_0.7 = c128[64,2,240,2,240]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.7"}
  %bitcast.838.1 = c128[4,3686400]{1,0} bitcast(%param_0.7), metadata={scheduling_name="bitcast.838.1"}
  ROOT %transpose.257.1 = c128[3686400,4]{1,0} transpose(%bitcast.838.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="transpose.257.1"}
}

%fused_transpose.4 (param_0.190: c128[4,4,240,240,4]) -> c128[16,4,57600] {
  %param_0.190 = c128[4,4,240,240,4]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.190"}
  %real.69.3 = f64[4,4,240,240,4]{4,3,2,1,0} real(%param_0.190), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.69.3"}
  %imag.69.3 = f64[4,4,240,240,4]{4,3,2,1,0} imag(%param_0.190), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.69.3"}
  %negate.69.3 = f64[4,4,240,240,4]{4,3,2,1,0} negate(%imag.69.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.69.3"}
  %complex.69.3 = c128[4,4,240,240,4]{4,3,2,1,0} complex(%real.69.3, %negate.69.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.69.3"}
  %constant_33_1 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.74.5 = c128[4,4,240,240,4]{4,3,2,1,0} broadcast(%constant_33_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.74.5"}
  %multiply.60.3 = c128[4,4,240,240,4]{4,3,2,1,0} multiply(%complex.69.3, %broadcast.74.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.60.3"}
  %bitcast.828.1 = c128[16,57600,4]{2,1,0} bitcast(%multiply.60.3), metadata={scheduling_name="bitcast.828.1"}
  ROOT %transpose.256.1 = c128[16,4,57600]{2,1,0} transpose(%bitcast.828.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.256.1"}
}

%fused_transpose.5 (param_0.195: c128[4,4,240,240,4]) -> c128[4,4,57600,4] {
  %param_0.195 = c128[4,4,240,240,4]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.195"}
  %real.67.3 = f64[4,4,240,240,4]{4,3,2,1,0} real(%param_0.195), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.67.3"}
  %imag.67.3 = f64[4,4,240,240,4]{4,3,2,1,0} imag(%param_0.195), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.67.3"}
  %negate.67.3 = f64[4,4,240,240,4]{4,3,2,1,0} negate(%imag.67.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.67.3"}
  %complex.67.15 = c128[4,4,240,240,4]{4,3,2,1,0} complex(%real.67.3, %negate.67.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.67.15"}
  %constant_33_9 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.74.29 = c128[4,4,240,240,4]{4,3,2,1,0} broadcast(%constant_33_9), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.74.29"}
  %multiply.59.15 = c128[4,4,240,240,4]{4,3,2,1,0} multiply(%complex.67.15, %broadcast.74.29), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.59.15"}
  %real.68.5 = f64[4,4,240,240,4]{4,3,2,1,0} real(%multiply.59.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.68.5"}
  %imag.68.7 = f64[4,4,240,240,4]{4,3,2,1,0} imag(%multiply.59.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.68.7"}
  %negate.68.5 = f64[4,4,240,240,4]{4,3,2,1,0} negate(%imag.68.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.68.5"}
  %complex.68.3 = c128[4,4,240,240,4]{4,3,2,1,0} complex(%real.68.5, %negate.68.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.68.3"}
  %bitcast.811.1 = c128[4,4,57600,4]{3,2,1,0} bitcast(%complex.68.3), metadata={scheduling_name="bitcast.811.1"}
  ROOT %transpose.255.1 = c128[4,4,57600,4]{3,2,1,0} transpose(%bitcast.811.1), dimensions={0,3,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.255.1"}
}

%fused_transpose.6 (param_0.194: c128[4,4,240,240,4]) -> c128[4,230400,4] {
  %param_0.194 = c128[4,4,240,240,4]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.194"}
  %real.65.3 = f64[4,4,240,240,4]{4,3,2,1,0} real(%param_0.194), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.65.3"}
  %imag.65.3 = f64[4,4,240,240,4]{4,3,2,1,0} imag(%param_0.194), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.65.3"}
  %negate.65.3 = f64[4,4,240,240,4]{4,3,2,1,0} negate(%imag.65.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.65.3"}
  %complex.65.15 = c128[4,4,240,240,4]{4,3,2,1,0} complex(%real.65.3, %negate.65.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.65.15"}
  %constant_33_8 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.74.33 = c128[4,4,240,240,4]{4,3,2,1,0} broadcast(%constant_33_8), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.74.33"}
  %multiply.58.15 = c128[4,4,240,240,4]{4,3,2,1,0} multiply(%complex.65.15, %broadcast.74.33), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.58.15"}
  %real.66.5 = f64[4,4,240,240,4]{4,3,2,1,0} real(%multiply.58.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.66.5"}
  %imag.66.7 = f64[4,4,240,240,4]{4,3,2,1,0} imag(%multiply.58.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.66.7"}
  %negate.66.5 = f64[4,4,240,240,4]{4,3,2,1,0} negate(%imag.66.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.66.5"}
  %complex.66.3 = c128[4,4,240,240,4]{4,3,2,1,0} complex(%real.66.5, %negate.66.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.66.3"}
  %bitcast.788.1 = c128[4,230400,4]{2,1,0} bitcast(%complex.66.3), metadata={scheduling_name="bitcast.788.1"}
  ROOT %transpose.254.1 = c128[4,230400,4]{2,1,0} transpose(%bitcast.788.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.254.1"}
}

%fused_transpose.7 (param_0.17: c128[64,240,240]) -> c128[921600,4] {
  %param_0.17 = c128[64,240,240]{2,1,0} parameter(0), metadata={scheduling_name="param_0.17"}
  %bitcast.765.1 = c128[4,921600]{1,0} bitcast(%param_0.17), metadata={scheduling_name="bitcast.765.1"}
  ROOT %transpose.253.1 = c128[921600,4]{1,0} transpose(%bitcast.765.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.253.1"}
}

%fused_transpose.8 (param_0.22: c128[64,240,480]) -> c128[240,64,480] {
  %param_0.22 = c128[64,240,480]{1,0,2} parameter(0), metadata={scheduling_name="param_0.22"}
  %bitcast.726.1 = c128[480,64,240]{2,1,0} bitcast(%param_0.22), metadata={scheduling_name="bitcast.726.1"}
  ROOT %transpose.251.1 = c128[240,64,480]{2,1,0} transpose(%bitcast.726.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="transpose.251.1"}
}

%fused_transpose.9 (param_0.24: c128[64,240,240]) -> c128[240,15360] {
  %param_0.24 = c128[64,240,240]{2,1,0} parameter(0), metadata={scheduling_name="param_0.24"}
  %bitcast.719.1 = c128[15360,240]{1,0} bitcast(%param_0.24), metadata={scheduling_name="bitcast.719.1"}
  ROOT %transpose.250.1 = c128[240,15360]{1,0} transpose(%bitcast.719.1), dimensions={1,0}, metadata={op_name="V_q" scheduling_name="transpose.250.1"}
}

%fused_transpose.10 (param_0.193: c128[4,4,2,240,2,240,4]) -> c128[16,4,230400] {
  %param_0.193 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.193"}
  %real.63.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} real(%param_0.193), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.63.3"}
  %imag.63.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} imag(%param_0.193), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.63.3"}
  %negate.63.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} negate(%imag.63.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.63.3"}
  %complex.63.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} complex(%real.63.3, %negate.63.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.63.3"}
  %constant_33_5 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.14 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_5), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.14"}
  %multiply.56.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%complex.63.3, %broadcast.71.14), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.56.3"}
  %bitcast.709.1 = c128[16,230400,4]{2,1,0} bitcast(%multiply.56.3), metadata={scheduling_name="bitcast.709.1"}
  ROOT %transpose.248.1 = c128[16,4,230400]{2,1,0} transpose(%bitcast.709.1), dimensions={0,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.248.1"}
}

%fused_transpose.11 (param_0.192: c128[4,4,2,240,2,240,4]) -> c128[4,4,230400,4] {
  %param_0.192 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.192"}
  %real.61.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} real(%param_0.192), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.61.3"}
  %imag.61.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} imag(%param_0.192), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.61.3"}
  %negate.61.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} negate(%imag.61.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.61.3"}
  %complex.61.15 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} complex(%real.61.3, %negate.61.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.61.15"}
  %constant_33_4 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.40 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_4), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.40"}
  %multiply.55.15 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%complex.61.15, %broadcast.71.40), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.55.15"}
  %real.62.5 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} real(%multiply.55.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.62.5"}
  %imag.62.7 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} imag(%multiply.55.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.62.7"}
  %negate.62.5 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} negate(%imag.62.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.62.5"}
  %complex.62.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} complex(%real.62.5, %negate.62.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.62.3"}
  %bitcast.692.1 = c128[4,4,230400,4]{3,2,1,0} bitcast(%complex.62.3), metadata={scheduling_name="bitcast.692.1"}
  ROOT %transpose.247.1 = c128[4,4,230400,4]{3,2,1,0} transpose(%bitcast.692.1), dimensions={0,3,2,1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.247.1"}
}

%fused_transpose.12 (param_0.191: c128[4,4,2,240,2,240,4]) -> c128[4,921600,4] {
  %param_0.191 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.191"}
  %real.59.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} real(%param_0.191), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.59.3"}
  %imag.59.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} imag(%param_0.191), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.59.3"}
  %negate.59.3 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} negate(%imag.59.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.59.3"}
  %complex.59.15 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} complex(%real.59.3, %negate.59.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.59.15"}
  %constant_33_3 = c128[] constant((0.5, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259}
  %broadcast.71.44 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} broadcast(%constant_33_3), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="broadcast.71.44"}
  %multiply.54.15 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} multiply(%complex.59.15, %broadcast.71.44), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="multiply.54.15"}
  %real.60.5 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} real(%multiply.54.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.60.5"}
  %imag.60.7 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} imag(%multiply.54.15), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.60.7"}
  %negate.60.5 = f64[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} negate(%imag.60.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.60.5"}
  %complex.60.3 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} complex(%real.60.5, %negate.60.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.60.3"}
  %bitcast.669.1 = c128[4,921600,4]{2,1,0} bitcast(%complex.60.3), metadata={scheduling_name="bitcast.669.1"}
  ROOT %transpose.246.1 = c128[4,921600,4]{2,1,0} transpose(%bitcast.669.1), dimensions={2,1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.246.1"}
}

%fused_transpose.13 (param_0.110: c128[64,480,480]) -> c128[3686400,4] {
  %param_0.110 = c128[64,480,480]{2,1,0} parameter(0), metadata={scheduling_name="param_0.110"}
  %real.58.3 = f64[64,480,480]{2,1,0} real(%param_0.110), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.58.3"}
  %imag.58.3 = f64[64,480,480]{2,1,0} imag(%param_0.110), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.58.3"}
  %negate.58.3 = f64[64,480,480]{2,1,0} negate(%imag.58.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.58.3"}
  %complex.58.3 = c128[64,480,480]{2,1,0} complex(%real.58.3, %negate.58.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.58.3"}
  %bitcast.647.1 = c128[4,3686400]{1,0} bitcast(%complex.58.3), metadata={scheduling_name="bitcast.647.1"}
  ROOT %transpose.245.1 = c128[3686400,4]{1,0} transpose(%bitcast.647.1), dimensions={1,0}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="transpose.245.1"}
}

%fused_multiply (param_0.53: c128[16,4,230400], param_1.34: c128[16,4,57600]) -> c128[64,2,240,2,240] {
  %param_0.53 = c128[16,4,230400]{2,1,0} parameter(0), metadata={scheduling_name="param_0.53"}
  %bitcast.712.3 = c128[64,2,240,2,240]{4,3,2,1,0} bitcast(%param_0.53), metadata={scheduling_name="bitcast.712.3"}
  %param_1.34 = c128[16,4,57600]{2,1,0} parameter(1), metadata={scheduling_name="param_1.34"}
  %bitcast.831.3 = c128[64,240,240]{2,1,0} bitcast(%param_1.34), metadata={scheduling_name="bitcast.831.3"}
  %broadcast.77.3 = c128[64,2,240,2,240]{4,3,2,1,0} broadcast(%bitcast.831.3), dimensions={0,2,4}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="broadcast.77.3"}
  %multiply.61.3 = c128[64,2,240,2,240]{4,3,2,1,0} multiply(%bitcast.712.3, %broadcast.77.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="multiply.61.3"}
  %constant_19_1 = c128[] constant((-0.125, 0)), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87}
  %broadcast.78.1 = c128[64,2,240,2,240]{4,3,2,1,0} broadcast(%constant_19_1), dimensions={}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="broadcast.78.1"}
  ROOT %multiply.62.1 = c128[64,2,240,2,240]{4,3,2,1,0} multiply(%multiply.61.3, %broadcast.78.1), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=87 scheduling_name="multiply.62.1"}
}

%fused_transpose.14 (param_0.189: c128[64,480,480], param_1.210: c128[16,480,480], param_2.131: u32[]) -> c128[16,480,480] {
  %param_1.210 = c128[16,480,480]{2,1,0} parameter(1), metadata={scheduling_name="param_1.210"}
  %transpose.249.1 = c128[480,16,480]{2,1,0} transpose(%param_1.210), dimensions={1,0,2}, metadata={op_name="W_q" scheduling_name="transpose.249.1"}
  %param_0.189 = c128[64,480,480]{2,0,1} parameter(0), metadata={scheduling_name="param_0.189"}
  %bitcast.733.5 = c128[480,64,480]{2,1,0} bitcast(%param_0.189), metadata={scheduling_name="bitcast.733.5"}
  %constant_10_2 = s32[] constant(0), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106}
  %param_2.131 = u32[] parameter(2), metadata={scheduling_name="param_2.131"}
  %convert.13.1 = s32[] convert(%param_2.131), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="convert.13.1"}
  %constant_29_1 = s32[] constant(16), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106}
  %multiply.57.1 = s32[] multiply(%convert.13.1, %constant_29_1), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="multiply.57.1"}
  %dynamic-slice.16.5 = c128[480,16,480]{2,1,0} dynamic-slice(%bitcast.733.5, %constant_10_2, %multiply.57.1, %constant_10_2), dynamic_slice_sizes={480,16,480}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="dynamic-slice.16.5"}
  %subtract.3.3 = c128[480,16,480]{2,1,0} subtract(%transpose.249.1, %dynamic-slice.16.5), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="subtract.3.3"}
  ROOT %transpose.252.1 = c128[16,480,480]{2,1,0} transpose(%subtract.3.3), dimensions={1,0,2}, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="transpose.252.1"}
}

%fused_complex (param_0.174: c128[64,480,480], param_1.209: s32[4], param_2.129: u32[], param_3.58: s32[4]) -> c128[64,240,240] {
  %param_0.174 = c128[64,480,480]{2,1,0} parameter(0), metadata={scheduling_name="param_0.174"}
  %constant_10_1 = s32[] constant(0), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106}
  %param_3.58 = s32[4]{0} parameter(3), metadata={scheduling_name="param_3.58"}
  %param_2.129 = u32[] parameter(2), metadata={scheduling_name="param_2.129"}
  %dynamic-slice.17.1 = s32[1]{0} dynamic-slice(%param_3.58, %param_2.129), dynamic_slice_sizes={1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396 scheduling_name="dynamic-slice.17.1"}
  %bitcast.751.7 = s32[] bitcast(%dynamic-slice.17.1), metadata={scheduling_name="bitcast.751.7"}
  %param_1.209 = s32[4]{0} parameter(1), metadata={scheduling_name="param_1.209"}
  %dynamic-slice.18.1 = s32[1]{0} dynamic-slice(%param_1.209, %param_2.129), dynamic_slice_sizes={1}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396 scheduling_name="dynamic-slice.18.1"}
  %bitcast.757.7 = s32[] bitcast(%dynamic-slice.18.1), metadata={scheduling_name="bitcast.757.7"}
  %dynamic-slice.19.7 = c128[64,240,240]{2,1,0} dynamic-slice(%param_0.174, %constant_10_1, %bitcast.751.7, %bitcast.757.7), dynamic_slice_sizes={64,240,240}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396 scheduling_name="dynamic-slice.19.7"}
  %real.64.3 = f64[64,240,240]{2,1,0} real(%dynamic-slice.19.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="real.64.3"}
  %imag.64.5 = f64[64,240,240]{2,1,0} imag(%dynamic-slice.19.7), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="imag.64.5"}
  %negate.64.3 = f64[64,240,240]{2,1,0} negate(%imag.64.5), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="negate.64.3"}
  ROOT %complex.64.1 = c128[64,240,240]{2,1,0} complex(%real.64.3, %negate.64.3), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="complex.64.1"}
}

%fused_complex.1 (param_0.186: c128[64,60,2,240]) -> c128[64,60,2,240] {
  %param_0.186 = c128[64,60,2,240]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.186"}
  %real.57.1 = f64[64,60,2,240]{3,2,1,0} real(%param_0.186), metadata={op_name="jit(sigma_coh)/jit(main)/real" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="real.57.1"}
  %imag.57.1 = f64[64,60,2,240]{3,2,1,0} imag(%param_0.186), metadata={op_name="jit(sigma_coh)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="imag.57.1"}
  %negate.57.1 = f64[64,60,2,240]{3,2,1,0} negate(%imag.57.1), metadata={op_name="jit(sigma_coh)/jit(main)/neg" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="negate.57.1"}
  ROOT %complex.57.1 = c128[64,60,2,240]{3,2,1,0} complex(%real.57.1, %negate.57.1), metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=31 scheduling_name="complex.57.1"}
}

%fused_complex.2 (param_0.188: c128[64,60,2,240]) -> c128[64,60,2,240] {
  %param_0.188 = c128[64,60,2,240]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.188"}
  %real.56.1 = f64[64,60,2,240]{3,2,1,0} real(%param_0.188), metadata={op_name="jit(sigma_coh)/jit(main)/real" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/projection_kernel.py" source_line=15 scheduling_name="real.56.1"}
  %imag.56.1 = f64[64,60,2,240]{3,2,1,0} imag(%param_0.188), metadata={op_name="jit(sigma_coh)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/projection_kernel.py" source_line=15 scheduling_name="imag.56.1"}
  %negate.56.1 = f64[64,60,2,240]{3,2,1,0} negate(%imag.56.1), metadata={op_name="jit(sigma_coh)/jit(main)/neg" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/projection_kernel.py" source_line=15 scheduling_name="negate.56.1"}
  ROOT %complex.56.1 = c128[64,60,2,240]{3,2,1,0} complex(%real.56.1, %negate.56.1), metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/projection_kernel.py" source_line=15 scheduling_name="complex.56.1"}
}

%add.clone (x.1: c128[], y.1: c128[]) -> c128[] {
  %y.1 = c128[] parameter(1), metadata={scheduling_name="y.1"}
  %x.1 = c128[] parameter(0), metadata={scheduling_name="x.1"}
  ROOT %add.8 = c128[] add(%x.1, %y.1), metadata={scheduling_name="add.8"}
}

%add.1.clone (x.3: c128[], y.3: c128[]) -> c128[] {
  %y.3 = c128[] parameter(1), metadata={scheduling_name="y.3"}
  %x.3 = c128[] parameter(0), metadata={scheduling_name="x.3"}
  ROOT %add.9 = c128[] add(%x.3, %y.3), metadata={scheduling_name="add.9"}
}

ENTRY %main.54_spmd (param.1.0: c128[64,2,240,60], param.6: c128[64,60,2,240], param.2.0: c128[64,60,2,240], param.5.0: c128[64,2,240,60], param.3.0: c128[16,480,480], param.4.0: c128[64,240,240]) -> c128[64,60,60] {
  %param.4.0 = c128[64,240,240]{2,1,0} parameter(5), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="V_q" scheduling_name="param.4.0"}
  %param.3.0 = c128[16,480,480]{2,1,0} parameter(4), sharding={devices=[4,1,1]<=[4]}, metadata={op_name="W_q" scheduling_name="param.3.0"}
  %param.2.0 = c128[64,60,2,240]{3,2,1,0} parameter(2), sharding={devices=[1,1,1,2,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="wfns.psi_yr" scheduling_name="param.2.0"}
  %param.1.0 = c128[64,2,240,60]{3,2,1,0} parameter(0), sharding={devices=[1,1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="wfns.psi_xn" scheduling_name="param.1.0"}
  %constant_13_0 = s32[4]{0} constant({0, 0, 240, 240}), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396}
  %constant_14_0 = s32[4]{0} constant({0, 240, 0, 240}), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396}
  %param.6 = c128[64,60,2,240]{3,2,1,0} parameter(1), sharding={devices=[1,1,1,2,2]<=[4] last_tile_dim_replicate}, metadata={op_name="wfns.psi_xr" scheduling_name="param.6"}
  %param.5.0 = c128[64,2,240,60]{3,2,1,0} parameter(3), sharding={devices=[1,1,2,1,2]<=[2,2]T(1,0) last_tile_dim_replicate}, metadata={op_name="wfns.psi_yn" scheduling_name="param.5.0"}
  %input_transpose_fusion.1 = c128[240,15360]{1,0} fusion(%param.4.0), kind=kInput, calls=%fused_transpose.9, metadata={op_name="V_q" scheduling_name="input_transpose_fusion.1"}
  %bitcast.723.0 = c128[64,240,240]{1,0,2} bitcast(%input_transpose_fusion.1), metadata={scheduling_name="bitcast.723.0"}
  %all-gather-start = (c128[64,240,240]{1,0,2}, c128[64,240,480]{1,0,2}) all-gather-start(%bitcast.723.0), channel_id=1, replica_groups=[2,2]<=[4], dimensions={2}, use_global_device_ids=true, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="all-gather-start"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":true,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %all-gather-done = c128[64,240,480]{1,0,2} all-gather-done(%all-gather-start), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="all-gather-done"}
  %input_transpose_fusion = c128[240,64,480]{2,1,0} fusion(%all-gather-done), kind=kInput, calls=%fused_transpose.8, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="input_transpose_fusion"}
  %bitcast.730.0 = c128[64,240,480]{2,0,1} bitcast(%input_transpose_fusion), metadata={scheduling_name="bitcast.730.0"}
  %all-gather-start.1 = (c128[64,240,480]{2,0,1}, c128[64,480,480]{2,0,1}) all-gather-start(%bitcast.730.0), channel_id=2, replica_groups=[2,2]<=[2,2]T(1,0), dimensions={1}, use_global_device_ids=true, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="all-gather-start.1"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":true,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %partition-id.1 = u32[] partition-id(), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="partition-id.1"}
  %all-gather-done.1 = c128[64,480,480]{2,0,1} all-gather-done(%all-gather-start.1), metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="all-gather-done.1"}
  %loop_transpose_fusion.12 = c128[16,480,480]{2,1,0} fusion(%all-gather-done.1, %param.3.0, %partition-id.1), kind=kLoop, calls=%fused_transpose.14, metadata={op_name="jit(sigma_coh)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/cohsex_sigma.py" source_line=106 scheduling_name="loop_transpose_fusion.12"}
  %all-gather-start.2 = (c128[16,480,480]{2,1,0}, c128[64,480,480]{2,1,0}) all-gather-start(%loop_transpose_fusion.12), channel_id=3, replica_groups=[1,4]<=[4], dimensions={0}, use_global_device_ids=true, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396 scheduling_name="all-gather-start.2"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %loop_complex_fusion.1 = c128[64,60,2,240]{3,2,1,0} fusion(%param.2.0), kind=kLoop, calls=%fused_complex.1, metadata={op_name="jit(sigma_coh)/jit(main)/complex" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=31 deduplicated_name="loop_complex_fusion.1" scheduling_name="loop_complex_fusion.1"}
  %bitcast.638.0 = c128[64,60,480]{2,1,0} bitcast(%loop_complex_fusion.1), metadata={scheduling_name="bitcast.638.0"}
  %bitcast.628.0 = c128[64,480,60]{2,1,0} bitcast(%param.1.0), metadata={scheduling_name="bitcast.628.0"}
  %custom-call.15.0 = (c128[64,480,480]{2,1,0}, s8[4194304]{0}) custom-call(%bitcast.628.0, %bitcast.638.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(sigma_coh)/jit(main)/ksxn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=30 scheduling_name="custom-call.15.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"28800","rhs_stride":"28800","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.3 = c128[64,480,480]{2,1,0} get-tuple-element(%custom-call.15.0), index=0, metadata={op_name="jit(sigma_coh)/jit(main)/ksxn,knty->ksxty/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/greens_function_kernel.py" source_line=30 scheduling_name="get-tuple-element.3"}
  %loop_transpose_fusion.11 = c128[3686400,4]{1,0} fusion(%get-tuple-element.3), kind=kLoop, calls=%fused_transpose.13, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="loop_transpose_fusion.11"}
  %bitcast.651.0 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.11), metadata={scheduling_name="bitcast.651.0"}
  %fft.0.0 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} fft(%bitcast.651.0), fft_type=FFT, fft_length={4}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="fft.0.0"}
  %loop_transpose_fusion.10 = c128[4,921600,4]{2,1,0} fusion(%fft.0.0), kind=kLoop, calls=%fused_transpose.12, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="loop_transpose_fusion.10"}
  %bitcast.673.0 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} bitcast(%loop_transpose_fusion.10), metadata={scheduling_name="bitcast.673.0"}
  %fft.1.0 = c128[4,4,2,240,2,240,4]{6,5,4,3,2,1,0} fft(%bitcast.673.0), fft_type=FFT, fft_length={4}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="fft.1.0"}
  %all-gather-done.2 = c128[64,480,480]{2,1,0} all-gather-done(%all-gather-start.2), metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/reshape" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=396 scheduling_name="all-gather-done.2"}
  %loop_complex_fusion = c128[64,240,240]{2,1,0} fusion(%all-gather-done.2, %constant_14_0, %partition-id.1, %constant_13_0), kind=kLoop, calls=%fused_complex, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="loop_complex_fusion"}
  %loop_transpose_fusion.7 = c128[921600,4]{1,0} fusion(%loop_complex_fusion), kind=kLoop, calls=%fused_transpose.7, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="loop_transpose_fusion.7"}
  %loop_transpose_fusion.9 = c128[4,4,230400,4]{3,2,1,0} fusion(%fft.1.0), kind=kLoop, calls=%fused_transpose.11, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="loop_transpose_fusion.9"}
  %bitcast.769.0 = c128[4,4,240,240,4]{4,3,2,1,0} bitcast(%loop_transpose_fusion.7), metadata={scheduling_name="bitcast.769.0"}
  %fft.3.0 = c128[4,4,240,240,4]{4,3,2,1,0} fft(%bitcast.769.0), fft_type=FFT, fft_length={4}, metadata={op_name="jit(sigma_coh)/jit(main)/jit(_convolve)/custom_partitioning" source_file="/global/homes/j/jackm/software/lorrax_B/src/common/fft_helpers.py" source_line=259 scheduling_name="fft.3.0"}
