HloModule jit_kernel, entry_computation_layout={(f32[8,16]{1,0}, f32[8,16]{1,0})->f32[8]{0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

%region_0.6 (Arg_0.7: f32[], Arg_1.8: f32[]) -> f32[] {
  %Arg_0.7 = f32[] parameter(0), metadata={op_name="jit(kernel)/jit(main)/reduce_sum"}
  %Arg_1.8 = f32[] parameter(1), metadata={op_name="jit(kernel)/jit(main)/reduce_sum"}
  ROOT %add.9 = f32[] add(%Arg_0.7, %Arg_1.8), metadata={op_name="jit(kernel)/jit(main)/reduce_sum" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/tmp/pf_smoke_driver.py" source_line=10}
}

ENTRY %main.11 (Arg_0.1: f32[8,16], Arg_1.2: f32[8,16]) -> f32[8] {
  %Arg_0.1 = f32[8,16]{1,0} parameter(0), metadata={op_name="x"}
  %Arg_1.2 = f32[8,16]{1,0} parameter(1), metadata={op_name="y"}
  %transpose.4 = f32[16,8]{0,1} transpose(%Arg_1.2), dimensions={1,0}, metadata={op_name="jit(kernel)/jit(main)/transpose" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/tmp/pf_smoke_driver.py" source_line=10}
  %dot.5 = f32[8,8]{1,0} dot(%Arg_0.1, %transpose.4), lhs_contracting_dims={1}, rhs_contracting_dims={0}, metadata={op_name="jit(kernel)/jit(main)/dot_general" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/tmp/pf_smoke_driver.py" source_line=10}
  %constant.3 = f32[] constant(0)
  ROOT %reduce.10 = f32[8]{0} reduce(%dot.5, %constant.3), dimensions={1}, to_apply=%region_0.6, metadata={op_name="jit(kernel)/jit(main)/reduce_sum" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/tmp/pf_smoke_driver.py" source_line=10}
}

