HloModule jit_get_v_per_G_and_phase, is_scheduled=true, entry_computation_layout={(f64[9,3]{1,0})->(f64[9,2419]{1,0}, c128[9,1,24,24,80]{4,3,2,1,0})}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true,true}, frontend_attributes={fingerprint_before_lhs="384b0a6643ef6d356d1c8d9c62fe7b43"}

%region_0.127 (Arg_0.128: f64[], Arg_1.129: f64[]) -> f64[] {
  %Arg_1.129 = f64[] parameter(1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/reduce_sum" scheduling_name="Arg_1.129"}
  %Arg_0.128 = f64[] parameter(0), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/reduce_sum" scheduling_name="Arg_0.128"}
  ROOT %add.17 = f64[] add(%Arg_0.128, %Arg_1.129), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=441 scheduling_name="add.17"}
}

%fused_gather (param_0.9: s32[2419,1], param_1.170: f64[24,24,80,3], param_2.94: f64[3], param_3.64: f64[9,3], param_4.41: f64[3], param_5.45: f64[3]) -> f64[2419,1,9] {
  %param_1.170 = f64[24,24,80,3]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.170"}
  %broadcast.139.11 = f64[9,24,24,80,3]{4,3,2,1,0} broadcast(%param_1.170), dimensions={1,2,3,4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=439 scheduling_name="broadcast.139.11"}
  %param_3.64 = f64[9,3]{1,0} parameter(3), metadata={scheduling_name="param_3.64"}
  %slice.15.7 = f64[9,1]{1,0} slice(%param_3.64), slice={[0:9], [0:1]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=434 scheduling_name="slice.15.7"}
  %constant_89 = f64[] constant(0.33333333333333331)
  %broadcast.140.14 = f64[9,1]{1,0} broadcast(%constant_89), dimensions={}, metadata={scheduling_name="broadcast.140.14"}
  %multiply.66.7 = f64[9,1]{1,0} multiply(%slice.15.7, %broadcast.140.14), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=434 scheduling_name="multiply.66.7"}
  %bitcast.470.12 = f64[9]{0} bitcast(%multiply.66.7), metadata={scheduling_name="bitcast.470.12"}
  %broadcast.141.7 = f64[9,3]{1,0} broadcast(%bitcast.470.12), dimensions={0}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.141.7"}
  %param_5.45 = f64[3]{0} parameter(5), metadata={scheduling_name="param_5.45"}
  %broadcast.142.5 = f64[9,3]{1,0} broadcast(%param_5.45), dimensions={1}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.142.5"}
  %multiply.67.5 = f64[9,3]{1,0} multiply(%broadcast.141.7, %broadcast.142.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="multiply.67.5"}
  %slice.16.7 = f64[9,1]{1,0} slice(%param_3.64), slice={[0:9], [1:2]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=435 scheduling_name="slice.16.7"}
  %multiply.68.7 = f64[9,1]{1,0} multiply(%slice.16.7, %broadcast.140.14), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=435 scheduling_name="multiply.68.7"}
  %bitcast.483.12 = f64[9]{0} bitcast(%multiply.68.7), metadata={scheduling_name="bitcast.483.12"}
  %broadcast.144.7 = f64[9,3]{1,0} broadcast(%bitcast.483.12), dimensions={0}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.144.7"}
  %param_4.41 = f64[3]{0} parameter(4), metadata={scheduling_name="param_4.41"}
  %broadcast.145.5 = f64[9,3]{1,0} broadcast(%param_4.41), dimensions={1}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.145.5"}
  %multiply.69.5 = f64[9,3]{1,0} multiply(%broadcast.144.7, %broadcast.145.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="multiply.69.5"}
  %add.18.3 = f64[9,3]{1,0} add(%multiply.67.5, %multiply.69.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="add.18.3"}
  %slice.17.4 = f64[9,1]{1,0} slice(%param_3.64), slice={[0:9], [2:3]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=436 scheduling_name="slice.17.4"}
  %bitcast.493.10 = f64[9]{0} bitcast(%slice.17.4), metadata={scheduling_name="bitcast.493.10"}
  %broadcast.146.7 = f64[9,3]{1,0} broadcast(%bitcast.493.10), dimensions={0}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.146.7"}
  %param_2.94 = f64[3]{0} parameter(2), metadata={scheduling_name="param_2.94"}
  %broadcast.147.5 = f64[9,3]{1,0} broadcast(%param_2.94), dimensions={1}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="broadcast.147.5"}
  %multiply.70.5 = f64[9,3]{1,0} multiply(%broadcast.146.7, %broadcast.147.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="multiply.70.5"}
  %add.19.3 = f64[9,3]{1,0} add(%add.18.3, %multiply.70.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/a,ab->b/dot_general" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=438 scheduling_name="add.19.3"}
  %broadcast.148.11 = f64[9,24,24,80,3]{4,3,2,1,0} broadcast(%add.19.3), dimensions={0,4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=439 scheduling_name="broadcast.148.11"}
  %add.20.11 = f64[9,24,24,80,3]{4,3,2,1,0} add(%broadcast.139.11, %broadcast.148.11), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=439 scheduling_name="add.20.11"}
  %multiply.71.3 = f64[9,24,24,80,3]{4,3,2,1,0} multiply(%add.20.11, %add.20.11), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=441 scheduling_name="multiply.71.3"}
  %constant_27_2 = f64[] constant(0)
  %reduce.131.3 = f64[9,24,24,80]{3,2,1,0} reduce(%multiply.71.3, %constant_27_2), dimensions={4}, to_apply=%region_0.127, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=441 scheduling_name="reduce.131.3"}
  %constant_3_1 = f64[] constant(30)
  %broadcast.149.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_3_1), dimensions={}, metadata={scheduling_name="broadcast.149.1"}
  %compare.8.1 = pred[9,24,24,80]{3,2,1,0} compare(%reduce.131.3, %broadcast.149.1), direction=GT, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/gt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=453 scheduling_name="compare.8.1"}
  %broadcast.150.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_27_2), dimensions={}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="broadcast.150.1"}
  %constant_15_1 = f64[] constant(1e-12)
  %broadcast.151.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_15_1), dimensions={}, metadata={scheduling_name="broadcast.151.1"}
  %compare.9.1 = pred[9,24,24,80]{3,2,1,0} compare(%reduce.131.3, %broadcast.151.1), direction=LT, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/lt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=442 scheduling_name="compare.9.1"}
  %constant_7_1 = f64[] constant(25.132741228718345)
  %broadcast.153.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_7_1), dimensions={}, metadata={scheduling_name="broadcast.153.1"}
  %constant_9_1 = f64[] constant(1)
  %broadcast.154.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_9_1), dimensions={}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="broadcast.154.1"}
  %select.15.3 = f64[9,24,24,80]{3,2,1,0} select(%compare.9.1, %broadcast.154.1, %reduce.131.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="select.15.3"}
  %divide.2.3 = f64[9,24,24,80]{3,2,1,0} divide(%broadcast.153.1, %select.15.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=449 scheduling_name="divide.2.3"}
  %broadcast.155.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_9_1), dimensions={}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="broadcast.155.1"}
  %slice.18.3 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.11), slice={[0:9], [0:24], [0:24], [0:80], [0:1]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="slice.18.3"}
  %multiply.72.5 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.18.3, %slice.18.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/integer_pow" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="multiply.72.5"}
  %slice.19.3 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.11), slice={[0:9], [0:24], [0:24], [0:80], [1:2]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="slice.19.3"}
  %multiply.73.5 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.19.3, %slice.19.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/integer_pow" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="multiply.73.5"}
  %add.21.5 = f64[9,24,24,80,1]{4,3,2,1,0} add(%multiply.72.5, %multiply.73.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="add.21.5"}
  %sqrt.3.3 = f64[9,24,24,80,1]{4,3,2,1,0} sqrt(%add.21.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/sqrt" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=445 scheduling_name="sqrt.3.3"}
  %constant_13_1 = f64[] constant(-11.33835674775462)
  %broadcast.156.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_13_1), dimensions={}, metadata={scheduling_name="broadcast.156.1"}
  %multiply.74.3 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%sqrt.3.3, %broadcast.156.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="multiply.74.3"}
  %exponential.7.1 = f64[9,24,24,80,1]{4,3,2,1,0} exponential(%multiply.74.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="exponential.7.1"}
  %slice.20.3 = f64[9,24,24,80,1]{4,3,2,1,0} slice(%add.20.11), slice={[0:9], [0:24], [0:24], [0:80], [2:3]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=446 scheduling_name="slice.20.3"}
  %constant_11_1 = f64[] constant(11.33835674775462)
  %broadcast.157.1 = f64[9,24,24,80,1]{4,3,2,1,0} broadcast(%constant_11_1), dimensions={}, metadata={scheduling_name="broadcast.157.1"}
  %multiply.76.1 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%slice.20.3, %broadcast.157.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="multiply.76.1"}
  %cosine.5.1 = f64[9,24,24,80,1]{4,3,2,1,0} cosine(%multiply.76.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/cos" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="cosine.5.1"}
  %multiply.77.1 = f64[9,24,24,80,1]{4,3,2,1,0} multiply(%exponential.7.1, %cosine.5.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="multiply.77.1"}
  %subtract.3.1 = f64[9,24,24,80,1]{4,3,2,1,0} subtract(%broadcast.155.1, %multiply.77.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/sub" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=447 scheduling_name="subtract.3.1"}
  %bitcast.556.3 = f64[9,24,24,80]{3,2,1,0} bitcast(%subtract.3.1), metadata={scheduling_name="bitcast.556.3"}
  %multiply.78.3 = f64[9,24,24,80]{3,2,1,0} multiply(%divide.2.3, %bitcast.556.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=449 scheduling_name="multiply.78.3"}
  %constant_5_1 = f64[] constant(0.0014240933398978817)
  %broadcast.158.1 = f64[9,24,24,80]{3,2,1,0} broadcast(%constant_5_1), dimensions={}, metadata={scheduling_name="broadcast.158.1"}
  %multiply.79.1 = f64[9,24,24,80]{3,2,1,0} multiply(%multiply.78.3, %broadcast.158.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=450 scheduling_name="multiply.79.1"}
  %select.16.1 = f64[9,24,24,80]{3,2,1,0} select(%compare.9.1, %broadcast.150.1, %multiply.79.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="select.16.1"}
  %select.17.1 = f64[9,24,24,80]{3,2,1,0} select(%compare.8.1, %broadcast.150.1, %select.16.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=443 scheduling_name="select.17.1"}
  %bitcast.565.1 = f64[46080,9]{0,1} bitcast(%select.17.1), metadata={scheduling_name="bitcast.565.1"}
  %param_0.9 = s32[2419,1]{1,0} parameter(0), metadata={scheduling_name="param_0.9"}
  ROOT %gather.2 = f64[2419,1,9]{0,2,1} gather(%bitcast.565.1, %param_0.9), offset_dims={1,2}, collapsed_slice_dims={}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,9}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/gather" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=482 scheduling_name="gather.2"}
}

%fused_complex (param_0.153: f64[1,1,9,24,24], param_1.171: f64[80], param_2.96: f64[9,3]) -> c128[9,1,24,24,80] {
  %param_0.153 = f64[1,1,9,24,24]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.153"}
  %bitcast.591.21 = f64[9,24,24]{2,1,0} bitcast(%param_0.153), metadata={scheduling_name="bitcast.591.21"}
  %broadcast.166.21 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%bitcast.591.21), dimensions={0,2,3}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.166.21"}
  %param_2.96 = f64[9,3]{1,0} parameter(2), metadata={scheduling_name="param_2.96"}
  %slice.17.6 = f64[9,1]{1,0} slice(%param_2.96), slice={[0:9], [2:3]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=436 scheduling_name="slice.17.6"}
  %bitcast.493.12 = f64[9]{0} bitcast(%slice.17.6), metadata={scheduling_name="bitcast.493.12"}
  %broadcast.167.5 = f64[1,1,1,9,80]{4,3,2,1,0} broadcast(%bitcast.493.12), dimensions={3}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=460 scheduling_name="broadcast.167.5"}
  %param_1.171 = f64[80]{0} parameter(1), metadata={scheduling_name="param_1.171"}
  %broadcast.168.3 = f64[1,1,1,9,80]{4,3,2,1,0} broadcast(%param_1.171), dimensions={4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=460 scheduling_name="broadcast.168.3"}
  %multiply.82.3 = f64[1,1,1,9,80]{4,3,2,1,0} multiply(%broadcast.167.5, %broadcast.168.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=460 scheduling_name="multiply.82.3"}
  %bitcast.600.21 = f64[9,80]{1,0} bitcast(%multiply.82.3), metadata={scheduling_name="bitcast.600.21"}
  %broadcast.169.21 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%bitcast.600.21), dimensions={0,4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.169.21"}
  %add.23.19 = f64[9,1,24,24,80]{4,3,2,1,0} add(%broadcast.166.21, %broadcast.169.21), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="add.23.19"}
  %convert.2.19 = c128[9,1,24,24,80]{4,3,2,1,0} convert(%add.23.19), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="convert.2.19"}
  %constant_18_1 = c128[] constant((0, -6.2831853071795862))
  %broadcast.170.19 = c128[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_18_1), dimensions={}, metadata={scheduling_name="broadcast.170.19"}
  %multiply.83.19 = c128[9,1,24,24,80]{4,3,2,1,0} multiply(%convert.2.19, %broadcast.170.19), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.83.19"}
  %real.2.11 = f64[9,1,24,24,80]{4,3,2,1,0} real(%multiply.83.19), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="real.2.11"}
  %exponential.8.3 = f64[9,1,24,24,80]{4,3,2,1,0} exponential(%real.2.11), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="exponential.8.3"}
  %constant_31_1 = f64[] constant(inf)
  %broadcast.172.1 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_31_1), dimensions={}, metadata={scheduling_name="broadcast.172.1"}
  %compare.10.1 = pred[9,1,24,24,80]{4,3,2,1,0} compare(%exponential.8.3, %broadcast.172.1), direction=EQ, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="compare.10.1"}
  %constant_29_1 = f64[] constant(0.5)
  %broadcast.173.3 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_29_1), dimensions={}, metadata={scheduling_name="broadcast.173.3"}
  %multiply.85.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%real.2.11, %broadcast.173.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.85.5"}
  %exponential.9.3 = f64[9,1,24,24,80]{4,3,2,1,0} exponential(%multiply.85.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="exponential.9.3"}
  %imag.2.5 = f64[9,1,24,24,80]{4,3,2,1,0} imag(%multiply.83.19), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="imag.2.5"}
  %cosine.6.1 = f64[9,1,24,24,80]{4,3,2,1,0} cosine(%imag.2.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="cosine.6.1"}
  %multiply.86.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.9.3, %cosine.6.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.86.5"}
  %multiply.87.5 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%multiply.86.5, %exponential.9.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.87.5"}
  %multiply.89.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.8.3, %cosine.6.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.89.3"}
  %select.18.3 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.10.1, %multiply.87.5, %multiply.89.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="select.18.3"}
  %constant_27_1 = f64[] constant(0)
  %broadcast.174.6 = f64[9,1,24,24,80]{4,3,2,1,0} broadcast(%constant_27_1), dimensions={}, metadata={scheduling_name="broadcast.174.6"}
  %compare.11.3 = pred[9,1,24,24,80]{4,3,2,1,0} compare(%imag.2.5, %broadcast.174.6), direction=EQ, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="compare.11.3"}
  %sine.2.1 = f64[9,1,24,24,80]{4,3,2,1,0} sine(%imag.2.5), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="sine.2.1"}
  %multiply.90.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.9.3, %sine.2.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.90.3"}
  %multiply.91.3 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%multiply.90.3, %exponential.9.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.91.3"}
  %multiply.95.1 = f64[9,1,24,24,80]{4,3,2,1,0} multiply(%exponential.8.3, %sine.2.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="multiply.95.1"}
  %select.19.1 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.10.1, %multiply.91.3, %multiply.95.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="select.19.1"}
  %select.20.3 = f64[9,1,24,24,80]{4,3,2,1,0} select(%compare.11.3, %broadcast.174.6, %select.19.1), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="select.20.3"}
  ROOT %complex.2.1 = c128[9,1,24,24,80]{4,3,2,1,0} complex(%select.18.3, %select.20.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="complex.2.1"}
}

%fused_add (param_0.122: f64[24], param_1.172: f64[9,3]) -> f64[1,1,9,24,24] {
  %param_1.172 = f64[9,3]{1,0} parameter(1), metadata={scheduling_name="param_1.172"}
  %slice.15.3 = f64[9,1]{1,0} slice(%param_1.172), slice={[0:9], [0:1]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=434 scheduling_name="slice.15.3"}
  %constant_88 = f64[] constant(0.33333333333333331)
  %broadcast.140.4 = f64[9,1]{1,0} broadcast(%constant_88), dimensions={}, metadata={scheduling_name="broadcast.140.4"}
  %multiply.66.3 = f64[9,1]{1,0} multiply(%slice.15.3, %broadcast.140.4), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=434 scheduling_name="multiply.66.3"}
  %bitcast.470.6 = f64[9]{0} bitcast(%multiply.66.3), metadata={scheduling_name="bitcast.470.6"}
  %broadcast.159.5 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%bitcast.470.6), dimensions={3}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.159.5"}
  %param_0.122 = f64[24]{0} parameter(0), metadata={scheduling_name="param_0.122"}
  %broadcast.160.6 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%param_0.122), dimensions={4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.160.6"}
  %multiply.80.3 = f64[1,1,1,9,24]{4,3,2,1,0} multiply(%broadcast.159.5, %broadcast.160.6), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="multiply.80.3"}
  %bitcast.577.3 = f64[9,24]{1,0} bitcast(%multiply.80.3), metadata={scheduling_name="bitcast.577.3"}
  %broadcast.161.3 = f64[1,1,9,24,24]{4,3,2,1,0} broadcast(%bitcast.577.3), dimensions={2,3}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.161.3"}
  %slice.16.3 = f64[9,1]{1,0} slice(%param_1.172), slice={[0:9], [1:2]}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/slice" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=435 scheduling_name="slice.16.3"}
  %multiply.68.3 = f64[9,1]{1,0} multiply(%slice.16.3, %broadcast.140.4), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/div" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=435 scheduling_name="multiply.68.3"}
  %bitcast.483.6 = f64[9]{0} bitcast(%multiply.68.3), metadata={scheduling_name="bitcast.483.6"}
  %broadcast.162.5 = f64[1,1,1,9,24]{4,3,2,1,0} broadcast(%bitcast.483.6), dimensions={3}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=459 scheduling_name="broadcast.162.5"}
  %multiply.81.3 = f64[1,1,1,9,24]{4,3,2,1,0} multiply(%broadcast.162.5, %broadcast.160.6), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=459 scheduling_name="multiply.81.3"}
  %bitcast.587.3 = f64[9,24]{1,0} bitcast(%multiply.81.3), metadata={scheduling_name="bitcast.587.3"}
  %broadcast.165.3 = f64[1,1,9,24,24]{4,3,2,1,0} broadcast(%bitcast.587.3), dimensions={2,4}, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="broadcast.165.3"}
  ROOT %add.22.1 = f64[1,1,9,24,24]{4,3,2,1,0} add(%broadcast.161.3, %broadcast.165.3), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="add.22.1"}
}

ENTRY %main.177 (Arg_0.1.0: f64[9,3]) -> (f64[9,2419], c128[9,1,24,24,80]) {
  %Arg_0.1.0 = f64[9,3]{1,0} parameter(0), metadata={op_name="qvec_wrapped" scheduling_name="Arg_0.1.0"}
  %constant_19_0 = f64[24]{0} constant({...}), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458}
  %constant_30_0 = f64[80]{0} constant({...}), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=460}
  %constant_2_0 = s32[2419,1]{1,0} constant({...})
  %constant_32_0 = f64[3]{0} constant({1.0507622167739268, 0.60665637184174681, -0})
  %constant_36_0 = f64[3]{0} constant({0, 1.2133158112027018, 0})
  %constant_37_0 = f64[3]{0} constant({0, -0, 0.27707653970333357})
  %constant_8_0 = f64[24,24,80,3]{3,2,1,0} constant({...}), metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=439}
  %loop_add_fusion = f64[1,1,9,24,24]{4,3,2,1,0} fusion(%constant_19_0, %Arg_0.1.0), kind=kLoop, calls=%fused_add, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=458 scheduling_name="loop_add_fusion"}
  %loop_complex_fusion = c128[9,1,24,24,80]{4,3,2,1,0} fusion(%loop_add_fusion, %constant_30_0, %Arg_0.1.0), kind=kLoop, calls=%fused_complex, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=457 scheduling_name="loop_complex_fusion"}
  %loop_gather_fusion = f64[2419,1,9]{0,2,1} fusion(%constant_2_0, %constant_8_0, %constant_37_0, %Arg_0.1.0, %constant_36_0, /*index=5*/%constant_32_0), kind=kLoop, calls=%fused_gather, metadata={op_name="jit(get_v_per_G_and_phase)/jit(main)/gather" source_file="/global/homes/j/jackm/software/lorrax_B/src/gw/coulomb_kernel.py" source_line=482 scheduling_name="loop_gather_fusion"}
  %bitcast.570.0 = f64[9,2419]{1,0} bitcast(%loop_gather_fusion), metadata={scheduling_name="bitcast.570.0"}
  ROOT %tuple.176.0 = (f64[9,2419]{1,0}, c128[9,1,24,24,80]{4,3,2,1,0}) tuple(%bitcast.570.0, %loop_complex_fusion), metadata={scheduling_name="tuple.176.0"}
}

