HloModule jit__project_tau_onto_omega, is_scheduled=true, entry_computation_layout={(c128[1000,30,30]{2,1,0}, c128[1000,30,30]{2,1,0}, f64[20]{0}, c128[], c128[], /*index=5*/f64[], f64[], s32[])->c128[20,1000,30,30]{3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="186097dd78c44f086a16f936d6e6b6f0"}

%fused_multiply (param_0.5: c128[20,1,1,1], param_1.3: c128[1000,30,30]) -> c128[20,1000,30,30] {
  %param_0.5 = c128[20,1,1,1]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.5"}
  %bitcast.323.3 = c128[20]{0} bitcast(%param_0.5), metadata={scheduling_name="bitcast.323.3"}
  %broadcast.59.3 = c128[20,1000,30,30]{3,2,1,0} broadcast(%bitcast.323.3), dimensions={0}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="broadcast.59.3"}
  %param_1.3 = c128[1000,30,30]{2,1,0} parameter(1), metadata={scheduling_name="param_1.3"}
  %broadcast.63.1 = c128[20,1000,30,30]{3,2,1,0} broadcast(%param_1.3), dimensions={1,2,3}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="broadcast.63.1"}
  ROOT %multiply.66.1 = c128[20,1000,30,30]{3,2,1,0} multiply(%broadcast.59.3, %broadcast.63.1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="multiply.66.1"}
}

%fused_add (param_0.6: c128[1000,30,30], param_1.5: c128[1000,30,30]) -> c128[1000,30,30] {
  %param_0.6 = c128[1000,30,30]{2,1,0} parameter(0), metadata={scheduling_name="param_0.6"}
  %param_1.5 = c128[1000,30,30]{2,1,0} parameter(1), metadata={scheduling_name="param_1.5"}
  %constant_14 = c128[] constant((0, 1))
  %broadcast.61.1 = c128[1000,30,30]{2,1,0} broadcast(%constant_14), dimensions={}, metadata={scheduling_name="broadcast.61.1"}
  %multiply.64.1 = c128[1000,30,30]{2,1,0} multiply(%param_1.5, %broadcast.61.1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315 scheduling_name="multiply.64.1"}
  ROOT %add.11.1 = c128[1000,30,30]{2,1,0} add(%param_0.6, %multiply.64.1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315 scheduling_name="add.11.1"}
}

%fused_add.1 (param_0.11: f64[20,1,1,1], param_1.13: f64[20,1,1,1]) -> c128[20,1,1,1] {
  %param_1.13 = f64[20,1,1,1]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.13"}
  %convert.29.1 = c128[20,1,1,1]{3,2,1,0} convert(%param_1.13), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="convert.29.1"}
  %param_0.11 = f64[20,1,1,1]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.11"}
  %convert.30.1 = c128[20,1,1,1]{3,2,1,0} convert(%param_0.11), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="convert.30.1"}
  %constant_18 = c128[] constant((0, 1))
  %broadcast.58.3 = c128[20,1,1,1]{3,2,1,0} broadcast(%constant_18), dimensions={}, metadata={scheduling_name="broadcast.58.3"}
  %multiply.63.3 = c128[20,1,1,1]{3,2,1,0} multiply(%convert.30.1, %broadcast.58.3), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="multiply.63.3"}
  ROOT %add.10.1 = c128[20,1,1,1]{3,2,1,0} add(%convert.29.1, %multiply.63.3), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="add.10.1"}
}

%region_0.53_spmd (param.10: (c128[1000,30,30], c128[1000,30,30], f64[20,1,1,1], f64[20,1,1,1])) -> (c128[20,1000,30,30]) {
  %param.10 = (c128[1000,30,30]{2,1,0}, c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, f64[20,1,1,1]{3,2,1,0}) parameter(0), metadata={scheduling_name="param.10"}
  %get-tuple-element.4.0 = c128[1000,30,30]{2,1,0} get-tuple-element(%param.10), index=1, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315 scheduling_name="get-tuple-element.4.0"}
  %get-tuple-element.3.0 = c128[1000,30,30]{2,1,0} get-tuple-element(%param.10), index=0, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315 scheduling_name="get-tuple-element.3.0"}
  %get-tuple-element.2.0 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%param.10), index=2, metadata={scheduling_name="get-tuple-element.2.0"}
  %get-tuple-element.1.0 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%param.10), index=3, metadata={scheduling_name="get-tuple-element.1.0"}
  %loop_add_fusion.1 = c128[20,1,1,1]{3,2,1,0} fusion(%get-tuple-element.2.0, %get-tuple-element.1.0), kind=kLoop, calls=%fused_add.1, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="loop_add_fusion.1"}
  %loop_add_fusion = c128[1000,30,30]{2,1,0} fusion(%get-tuple-element.3.0, %get-tuple-element.4.0), kind=kLoop, calls=%fused_add, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315 scheduling_name="loop_add_fusion"}
  %loop_multiply_fusion = c128[20,1000,30,30]{3,2,1,0} fusion(%loop_add_fusion.1, %loop_add_fusion), kind=kLoop, calls=%fused_multiply, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316 scheduling_name="loop_multiply_fusion"}
  ROOT %tuple.7 = (c128[20,1000,30,30]{3,2,1,0}) tuple(%loop_multiply_fusion), metadata={scheduling_name="tuple.7"}
}

%fused_add.2 (param_0.20: c128[1000,30,30], param_1.22: c128[1000,30,30], param_2.11: f64[20,1,1,1], param_3.6: f64[20,1,1,1]) -> c128[20,1000,30,30] {
  %param_2.11 = f64[20,1,1,1]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.11"}
  %bitcast.339.3 = f64[20]{0} bitcast(%param_2.11), metadata={scheduling_name="bitcast.339.3"}
  %convert.31.3 = c128[20]{0} convert(%bitcast.339.3), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="convert.31.3"}
  %broadcast.64.3 = c128[20,1000,30,30]{3,2,1,0} broadcast(%convert.31.3), dimensions={0}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="broadcast.64.3"}
  %param_1.22 = c128[1000,30,30]{2,1,0} parameter(1), metadata={scheduling_name="param_1.22"}
  %broadcast.65.3 = c128[20,1000,30,30]{3,2,1,0} broadcast(%param_1.22), dimensions={1,2,3}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="broadcast.65.3"}
  %multiply.67.3 = c128[20,1000,30,30]{3,2,1,0} multiply(%broadcast.64.3, %broadcast.65.3), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="multiply.67.3"}
  %param_3.6 = f64[20,1,1,1]{3,2,1,0} parameter(3), metadata={scheduling_name="param_3.6"}
  %bitcast.349.3 = f64[20]{0} bitcast(%param_3.6), metadata={scheduling_name="bitcast.349.3"}
  %convert.32.3 = c128[20]{0} convert(%bitcast.349.3), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="convert.32.3"}
  %broadcast.66.1 = c128[20,1000,30,30]{3,2,1,0} broadcast(%convert.32.3), dimensions={0}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="broadcast.66.1"}
  %param_0.20 = c128[1000,30,30]{2,1,0} parameter(0), metadata={scheduling_name="param_0.20"}
  %broadcast.67.1 = c128[20,1000,30,30]{3,2,1,0} broadcast(%param_0.20), dimensions={1,2,3}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="broadcast.67.1"}
  %multiply.69.1 = c128[20,1000,30,30]{3,2,1,0} multiply(%broadcast.66.1, %broadcast.67.1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="multiply.69.1"}
  ROOT %add.12.1 = c128[20,1000,30,30]{3,2,1,0} add(%multiply.67.3, %multiply.69.1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="add.12.1"}
}

%region_1.78_spmd (param.1.0: (c128[1000,30,30], f64[20,1,1,1], c128[1000,30,30], f64[20,1,1,1])) -> (c128[20,1000,30,30]) {
  %param.1.0 = (c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}) parameter(0), metadata={scheduling_name="param.1.0"}
  %get-tuple-element.8.0 = c128[1000,30,30]{2,1,0} get-tuple-element(%param.1.0), index=2, metadata={scheduling_name="get-tuple-element.8.0"}
  %get-tuple-element.7.0 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%param.1.0), index=3, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="get-tuple-element.7.0"}
  %get-tuple-element.6.0 = c128[1000,30,30]{2,1,0} get-tuple-element(%param.1.0), index=0, metadata={scheduling_name="get-tuple-element.6.0"}
  %get-tuple-element.5.0 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%param.1.0), index=1, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="get-tuple-element.5.0"}
  %loop_add_fusion.2 = c128[20,1000,30,30]{3,2,1,0} fusion(%get-tuple-element.8.0, %get-tuple-element.6.0, %get-tuple-element.5.0, %get-tuple-element.7.0), kind=kLoop, calls=%fused_add.2, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319 scheduling_name="loop_add_fusion.2"}
  ROOT %tuple.8 = (c128[20,1000,30,30]{3,2,1,0}) tuple(%loop_add_fusion.2), metadata={scheduling_name="tuple.8"}
}

%fused_multiply.1 (param_0.24: c128[20,1000,30,30], param_1.25: f64[]) -> c128[20,1000,30,30] {
  %param_1.25 = f64[] parameter(1), metadata={scheduling_name="param_1.25"}
  %convert.33.1 = c128[] convert(%param_1.25), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352 scheduling_name="convert.33.1"}
  %broadcast.68.1 = c128[20,1000,30,30]{3,2,1,0} broadcast(%convert.33.1), dimensions={}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352 scheduling_name="broadcast.68.1"}
  %param_0.24 = c128[20,1000,30,30]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.24"}
  ROOT %multiply.82.1 = c128[20,1000,30,30]{3,2,1,0} multiply(%broadcast.68.1, %param_0.24), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352 scheduling_name="multiply.82.1"}
}

%fused_imag_real (param_0.68: c128[], param_1.85: f64[20], param_2.59: f64[], param_3.42: c128[]) -> (f64[20], f64[20]) {
  %param_3.42 = c128[] parameter(3), metadata={scheduling_name="param_3.42"}
  %broadcast.69.5 = c128[20]{0} broadcast(%param_3.42), dimensions={}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=346 scheduling_name="broadcast.69.5"}
  %param_2.59 = f64[] parameter(2), metadata={scheduling_name="param_2.59"}
  %convert.34.7 = c128[] convert(%param_2.59), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="convert.34.7"}
  %constant_4_1 = c128[] constant((0, 1))
  %multiply.70.7 = c128[] multiply(%convert.34.7, %constant_4_1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.70.7"}
  %broadcast.70.17 = c128[20]{0} broadcast(%multiply.70.7), dimensions={}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="broadcast.70.17"}
  %param_1.85 = f64[20]{0} parameter(1), metadata={scheduling_name="param_1.85"}
  %convert.35.15 = c128[20]{0} convert(%param_1.85), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="convert.35.15"}
  %multiply.71.17 = c128[20]{0} multiply(%broadcast.70.17, %convert.35.15), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.71.17"}
  %param_0.68 = c128[] parameter(0), metadata={scheduling_name="param_0.68"}
  %broadcast.72.15 = c128[20]{0} broadcast(%param_0.68), dimensions={}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="broadcast.72.15"}
  %multiply.72.15 = c128[20]{0} multiply(%multiply.71.17, %broadcast.72.15), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.72.15"}
  %real.6.7 = f64[20]{0} real(%multiply.72.15), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="real.6.7"}
  %exponential.6.5 = f64[20]{0} exponential(%real.6.7), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="exponential.6.5"}
  %constant_5_1 = f64[] constant(inf)
  %broadcast.75.5 = f64[20]{0} broadcast(%constant_5_1), dimensions={}, metadata={scheduling_name="broadcast.75.5"}
  %compare.6.5 = pred[20]{0} compare(%exponential.6.5, %broadcast.75.5), direction=EQ, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="compare.6.5"}
  %constant_6_1 = f64[] constant(0.5)
  %broadcast.77.9 = f64[20]{0} broadcast(%constant_6_1), dimensions={}, metadata={scheduling_name="broadcast.77.9"}
  %multiply.73.9 = f64[20]{0} multiply(%real.6.7, %broadcast.77.9), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.73.9"}
  %exponential.7.7 = f64[20]{0} exponential(%multiply.73.9), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="exponential.7.7"}
  %imag.6.5 = f64[20]{0} imag(%multiply.72.15), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="imag.6.5"}
  %cosine.3.5 = f64[20]{0} cosine(%imag.6.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="cosine.3.5"}
  %multiply.74.9 = f64[20]{0} multiply(%exponential.7.7, %cosine.3.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.74.9"}
  %multiply.75.9 = f64[20]{0} multiply(%multiply.74.9, %exponential.7.7), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.75.9"}
  %multiply.76.7 = f64[20]{0} multiply(%exponential.6.5, %cosine.3.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.76.7"}
  %select.9.7 = f64[20]{0} select(%compare.6.5, %multiply.75.9, %multiply.76.7), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="select.9.7"}
  %constant_7_1 = f64[] constant(0)
  %broadcast.78.5 = f64[20]{0} broadcast(%constant_7_1), dimensions={}, metadata={scheduling_name="broadcast.78.5"}
  %compare.7.7 = pred[20]{0} compare(%imag.6.5, %broadcast.78.5), direction=EQ, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="compare.7.7"}
  %sine.3.5 = f64[20]{0} sine(%imag.6.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="sine.3.5"}
  %multiply.78.7 = f64[20]{0} multiply(%exponential.7.7, %sine.3.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.78.7"}
  %multiply.79.7 = f64[20]{0} multiply(%multiply.78.7, %exponential.7.7), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.79.7"}
  %multiply.80.5 = f64[20]{0} multiply(%exponential.6.5, %sine.3.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="multiply.80.5"}
  %select.10.5 = f64[20]{0} select(%compare.6.5, %multiply.79.7, %multiply.80.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="select.10.5"}
  %select.11.7 = f64[20]{0} select(%compare.7.7, %broadcast.78.5, %select.10.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="select.11.7"}
  %complex.3.5 = c128[20]{0} complex(%select.9.7, %select.11.7), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345 scheduling_name="complex.3.5"}
  %multiply.81.5 = c128[20]{0} multiply(%broadcast.69.5, %complex.3.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=346 scheduling_name="multiply.81.5"}
  %imag.7.1 = f64[20]{0} imag(%multiply.81.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348 scheduling_name="imag.7.1"}
  %real.7.1.clone.1 = f64[20]{0} real(%multiply.81.5), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=347 scheduling_name="real.7.1.clone.1"}
  ROOT %tuple.6 = (f64[20]{0}, f64[20]{0}) tuple(%imag.7.1, %real.7.1.clone.1), metadata={scheduling_name="tuple.6"}
}

%fused_clamp (param_0.67: s32[]) -> s32[] {
  %constant_2_1 = s32[] constant(0)
  %param_0.67 = s32[] parameter(0), metadata={scheduling_name="param_0.67"}
  %constant_3_1 = s32[] constant(1)
  ROOT %clamp.3.1 = s32[] clamp(%constant_2_1, %param_0.67, %constant_3_1), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/clamp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="clamp.3.1"}
}

ENTRY %main.107_spmd (param.4.0: c128[1000,30,30], param.5.0: c128[1000,30,30], param.8.0: f64[20], param.9.0: c128[], param.6.0: c128[], param.7.0: f64[], param.2.0: f64[], param.3.0: s32[]) -> c128[20,1000,30,30] {
  %param.9.0 = c128[] parameter(3), sharding={replicated}, metadata={op_name="t_node" scheduling_name="param.9.0"}
  %param.7.0 = f64[] parameter(5), sharding={replicated}, metadata={op_name="omega_sign" scheduling_name="param.7.0"}
  %param.6.0 = c128[] parameter(4), sharding={replicated}, metadata={op_name="alpha_eff" scheduling_name="param.6.0"}
  %param.3.0 = s32[] parameter(7), sharding={replicated}, metadata={op_name="project_code" scheduling_name="param.3.0"}
  %param.2.0 = f64[] parameter(6), sharding={replicated}, metadata={op_name="pref" scheduling_name="param.2.0"}
  %param.5.0 = c128[1000,30,30]{2,1,0} parameter(1), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="sigma_tau_kij_im" scheduling_name="param.5.0"}
  %param.4.0 = c128[1000,30,30]{2,1,0} parameter(0), sharding={devices=[1,2,2]<=[4]}, metadata={op_name="sigma_tau_kij_re" scheduling_name="param.4.0"}
  %param.8.0 = f64[20]{0} parameter(2), sharding={replicated}, metadata={op_name="omega_vec" scheduling_name="param.8.0"}
  %loop_clamp_fusion = s32[] fusion(%param.3.0), kind=kLoop, calls=%fused_clamp, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/clamp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="loop_clamp_fusion"}
  %loop_imag_real_fusion = (f64[20]{0}, f64[20]{0}) fusion(%param.9.0, %param.8.0, %param.7.0, %param.6.0), kind=kLoop, calls=%fused_imag_real, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348 scheduling_name="loop_imag_real_fusion"}
  %get-tuple-element.11 = f64[20]{0} get-tuple-element(%loop_imag_real_fusion), index=1, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348 scheduling_name="get-tuple-element.11"}
  %get-tuple-element.10 = f64[20]{0} get-tuple-element(%loop_imag_real_fusion), index=0, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348 scheduling_name="get-tuple-element.10"}
  %bitcast.452.0 = f64[20,1,1,1]{3,2,1,0} bitcast(%get-tuple-element.10), metadata={scheduling_name="bitcast.452.0"}
  %bitcast.448.0 = f64[20,1,1,1]{3,2,1,0} bitcast(%get-tuple-element.11), metadata={scheduling_name="bitcast.448.0"}
  %tuple.5.0 = (c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}) tuple(%param.5.0, %bitcast.448.0, %param.4.0, %bitcast.452.0), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="tuple.5.0"}
  %tuple.4.0 = (c128[1000,30,30]{2,1,0}, c128[1000,30,30]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, f64[20,1,1,1]{3,2,1,0}) tuple(%param.4.0, %param.5.0, %bitcast.452.0, %bitcast.448.0), metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="tuple.4.0"}
  %conditional.1 = (c128[20,1000,30,30]{3,2,1,0}) conditional(%loop_clamp_fusion, %tuple.4.0, %tuple.5.0), branch_computations={%region_0.53_spmd, %region_1.78_spmd}, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="conditional.1"}
  %get-tuple-element.9.0 = c128[20,1000,30,30]{3,2,1,0} get-tuple-element(%conditional.1), index=0, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321 scheduling_name="get-tuple-element.9.0"}
  ROOT %loop_multiply_fusion.1 = c128[20,1000,30,30]{3,2,1,0} fusion(%get-tuple-element.9.0, %param.2.0), kind=kLoop, calls=%fused_multiply.1, metadata={op_name="jit(_project_tau_onto_omega)/jit(main)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352 scheduling_name="loop_multiply_fusion.1"}
}

