HloModule jit_convert_element_type, is_scheduled=true, entry_computation_layout={(s64[])->s64[]}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="e56e025b15db63ec7960bedd34af7844"}

ENTRY %main.2 (Arg_0.1.0: s64[]) -> s64[] {
  %Arg_0.1.0 = s64[] parameter(0), metadata={op_name="args[0]" scheduling_name="Arg_0.1.0"}
  ROOT %copy.1 = s64[] copy(%Arg_0.1.0)
}

