HloModule jit__threefry_seed, is_scheduled=true, entry_computation_layout={(s64[])->u32[2]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="a9e8454d84bf277ccfe159284e064a63"}

%fused_concatenate (param_0.3: s64[]) -> u32[2] {
  %param_0.3 = s64[] parameter(0), metadata={scheduling_name="param_0.3"}
  %constant_3_1 = s64[] constant(32)
  %shift-right-logical.2.1 = s64[] shift-right-logical(%param_0.3, %constant_3_1), metadata={op_name="jit(_threefry_seed)/jit(main)/shift_right_logical" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="shift-right-logical.2.1"}
  %convert.4.1 = u32[] convert(%shift-right-logical.2.1), metadata={op_name="jit(_threefry_seed)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="convert.4.1"}
  %bitcast.41.1 = u32[1]{0} bitcast(%convert.4.1), metadata={scheduling_name="bitcast.41.1"}
  %constant_2_1 = s64[] constant(4294967295)
  %and.2.1 = s64[] and(%param_0.3, %constant_2_1), metadata={op_name="jit(_threefry_seed)/jit(main)/and" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="and.2.1"}
  %convert.6.1 = u32[] convert(%and.2.1), metadata={op_name="jit(_threefry_seed)/jit(main)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="convert.6.1"}
  %bitcast.48.1 = u32[1]{0} bitcast(%convert.6.1), metadata={scheduling_name="bitcast.48.1"}
  ROOT %concatenate.2.1 = u32[2]{0} concatenate(%bitcast.41.1, %bitcast.48.1), dimensions={0}, metadata={op_name="jit(_threefry_seed)/jit(main)/concatenate" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="concatenate.2.1"}
}

ENTRY %main.11 (Arg_0.1.0: s64[]) -> u32[2] {
  %Arg_0.1.0 = s64[] parameter(0), metadata={op_name="seed" scheduling_name="Arg_0.1.0"}
  ROOT %input_concatenate_fusion = u32[2]{0} fusion(%Arg_0.1.0), kind=kInput, calls=%fused_concatenate, metadata={op_name="jit(_threefry_seed)/jit(main)/concatenate" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_io.py" source_line=667 scheduling_name="input_concatenate_fusion"}
}

