HloModule jit__per_rank, is_scheduled=true, entry_computation_layout={(f64[20,2,5,1963,2]{4,3,2,1,0}, c128[9,2,2]{2,1,0}, c128[9,1963]{1,0}, pred[9]{0}, s32[9]{0})->f64[20,2,9,1963,2]{4,3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="706f3c6ecbbf005ae90a30857fee5b29"}

%fused_concatenate (param_0.35: c128[9,39260,2]) -> f64[20,2,9,1963,2] {
  %param_0.35 = c128[9,39260,2]{2,1,0} parameter(0), metadata={scheduling_name="param_0.35"}
  %real.11.1 = f64[9,39260,2]{2,1,0} real(%param_0.35), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="real.11.1"}
  %bitcast.283.3 = f64[9,20,1963,2]{3,2,1,0} bitcast(%real.11.1), metadata={scheduling_name="bitcast.283.3"}
  %transpose.23.3 = f64[20,2,9,1963]{3,2,1,0} transpose(%bitcast.283.3), dimensions={1,3,0,2}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="transpose.23.3"}
  %bitcast.286.1 = f64[20,2,9,1963,1]{4,3,2,1,0} bitcast(%transpose.23.3), metadata={scheduling_name="bitcast.286.1"}
  %imag.11.1 = f64[9,39260,2]{2,1,0} imag(%param_0.35), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="imag.11.1"}
  %bitcast.291.3 = f64[9,20,1963,2]{3,2,1,0} bitcast(%imag.11.1), metadata={scheduling_name="bitcast.291.3"}
  %transpose.24.3 = f64[20,2,9,1963]{3,2,1,0} transpose(%bitcast.291.3), dimensions={1,3,0,2}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="transpose.24.3"}
  %bitcast.294.1 = f64[20,2,9,1963,1]{4,3,2,1,0} bitcast(%transpose.24.3), metadata={scheduling_name="bitcast.294.1"}
  ROOT %concatenate.4.1 = f64[20,2,9,1963,2]{4,3,2,1,0} concatenate(%bitcast.286.1, %bitcast.294.1), dimensions={4}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/concatenate" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="concatenate.4.1"}
}

%fused_multiply (param_0.54: c128[9,1963], param_1.72: f64[20,2,5,1963,2], param_2.57: pred[9,1], param_3.32: pred[9], param_4.13: s32[9]) -> c128[9,20,1963,2] {
  %param_3.32 = pred[9]{0} parameter(3), metadata={scheduling_name="param_3.32"}
  %broadcast.64.1 = pred[9,20,1963,2]{3,2,1,0} broadcast(%param_3.32), dimensions={0}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_where)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=694 scheduling_name="broadcast.64.1"}
  %param_2.57 = pred[9,1]{1,0} parameter(2), metadata={scheduling_name="param_2.57"}
  %bitcast.238.3 = pred[9]{0} bitcast(%param_2.57), metadata={scheduling_name="bitcast.238.3"}
  %broadcast.70.3 = pred[1,9,20,1963,2]{4,3,2,1,0} broadcast(%bitcast.238.3), dimensions={1}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="broadcast.70.3"}
  %param_1.72 = f64[20,2,5,1963,2]{4,3,2,1,0} parameter(1), metadata={scheduling_name="param_1.72"}
  %convert.19.12 = c128[20,2,5,1963,2]{4,3,2,1,0} convert(%param_1.72), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=684 scheduling_name="convert.19.12"}
  %slice.10.5 = c128[20,2,5,1963,1]{4,3,2,1,0} slice(%convert.19.12), slice={[0:20], [0:2], [0:5], [0:1963], [0:1]}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=684 scheduling_name="slice.10.5"}
  %slice.11.7 = c128[20,2,5,1963,1]{4,3,2,1,0} slice(%convert.19.12), slice={[0:20], [0:2], [0:5], [0:1963], [1:2]}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=684 scheduling_name="slice.11.7"}
  %constant_17_1 = c128[] constant((0, 1))
  %broadcast.71.5 = c128[20,2,5,1963,1]{4,3,2,1,0} broadcast(%constant_17_1), dimensions={}, metadata={scheduling_name="broadcast.71.5"}
  %multiply.9.5 = c128[20,2,5,1963,1]{4,3,2,1,0} multiply(%slice.11.7, %broadcast.71.5), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=684 scheduling_name="multiply.9.5"}
  %add.11.3 = c128[20,2,5,1963,1]{4,3,2,1,0} add(%slice.10.5, %multiply.9.5), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=684 scheduling_name="add.11.3"}
  %bitcast.253.11 = c128[5,20,2,1963]{3,0,2,1} bitcast(%add.11.3), metadata={scheduling_name="bitcast.253.11"}
  %param_4.13 = s32[9]{0} parameter(4), metadata={scheduling_name="param_4.13"}
  %constant_13_2 = s32[] constant(0)
  %broadcast.65.5 = s32[9]{0} broadcast(%constant_13_2), dimensions={}, metadata={scheduling_name="broadcast.65.5"}
  %compare.15.5 = pred[9]{0} compare(%param_4.13, %broadcast.65.5), direction=LT, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="compare.15.5"}
  %constant_14_2 = s32[] constant(5)
  %broadcast.67.5 = s32[9]{0} broadcast(%constant_14_2), dimensions={}, metadata={scheduling_name="broadcast.67.5"}
  %add.10.5 = s32[9]{0} add(%param_4.13, %broadcast.67.5), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="add.10.5"}
  %select.18.3 = s32[9]{0} select(%compare.15.5, %add.10.5, %param_4.13), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="select.18.3"}
  %bitcast.226.7 = s32[9,1]{1,0} bitcast(%select.18.3), metadata={scheduling_name="bitcast.226.7"}
  %convert.18.7 = s64[9,1]{1,0} convert(%bitcast.226.7), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="convert.18.7"}
  %gather.3.11 = c128[9,1,20,2,1963]{3,4,2,0,1} gather(%bitcast.253.11, %convert.18.7), offset_dims={1,2,3,4}, collapsed_slice_dims={}, start_index_map={0}, index_vector_dim=1, slice_sizes={1,20,2,1963}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/gather" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="gather.3.11"}
  %bitcast.258.9 = c128[1,9,20,1963,2]{4,3,2,1,0} bitcast(%gather.3.11), metadata={scheduling_name="bitcast.258.9"}
  %constant_18_1 = c128[] constant((nan, 0))
  %broadcast.72.9 = c128[1,9,20,1963,2]{4,3,2,1,0} broadcast(%constant_18_1), dimensions={}, metadata={scheduling_name="broadcast.72.9"}
  %select.19.9 = c128[1,9,20,1963,2]{4,3,2,1,0} select(%broadcast.70.3, %bitcast.258.9, %broadcast.72.9), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="select.19.9"}
  %bitcast.263.7 = c128[9,20,1963,2]{3,2,1,0} bitcast(%select.19.9), metadata={scheduling_name="bitcast.263.7"}
  %real.10.3 = f64[9,20,1963,2]{3,2,1,0} real(%bitcast.263.7), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=695 scheduling_name="real.10.3"}
  %imag.10.5 = f64[9,20,1963,2]{3,2,1,0} imag(%bitcast.263.7), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=695 scheduling_name="imag.10.5"}
  %negate.4.3 = f64[9,20,1963,2]{3,2,1,0} negate(%imag.10.5), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/neg" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=695 scheduling_name="negate.4.3"}
  %complex.4.1 = c128[9,20,1963,2]{3,2,1,0} complex(%real.10.3, %negate.4.3), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=695 scheduling_name="complex.4.1"}
  %select.21.3 = c128[9,20,1963,2]{3,2,1,0} select(%broadcast.64.1, %complex.4.1, %bitcast.263.7), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=694 scheduling_name="select.21.3"}
  %param_0.54 = c128[9,1963]{1,0} parameter(0), metadata={scheduling_name="param_0.54"}
  %broadcast.73.1 = c128[9,20,1963,2]{3,2,1,0} broadcast(%param_0.54), dimensions={0,2}, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=698 scheduling_name="broadcast.73.1"}
  ROOT %multiply.10.1 = c128[9,20,1963,2]{3,2,1,0} multiply(%select.21.3, %broadcast.73.1), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=698 scheduling_name="multiply.10.1"}
}

%fused_and (param_0.79: s32[9]) -> pred[9,1] {
  %param_0.79 = s32[9]{0} parameter(0), metadata={scheduling_name="param_0.79"}
  %constant_13_1 = s32[] constant(0)
  %broadcast.65.7 = s32[9]{0} broadcast(%constant_13_1), dimensions={}, metadata={scheduling_name="broadcast.65.7"}
  %compare.15.7 = pred[9]{0} compare(%param_0.79, %broadcast.65.7), direction=LT, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="compare.15.7"}
  %constant_14_1 = s32[] constant(5)
  %broadcast.67.7 = s32[9]{0} broadcast(%constant_14_1), dimensions={}, metadata={scheduling_name="broadcast.67.7"}
  %add.10.7 = s32[9]{0} add(%param_0.79, %broadcast.67.7), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="add.10.7"}
  %select.18.5 = s32[9]{0} select(%compare.15.7, %add.10.7, %param_0.79), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="select.18.5"}
  %bitcast.226.9 = s32[9,1]{1,0} bitcast(%select.18.5), metadata={scheduling_name="bitcast.226.9"}
  %convert.18.9 = s64[9,1]{1,0} convert(%bitcast.226.9), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="convert.18.9"}
  %constant_15_1 = s64[] constant(0)
  %broadcast.68.3 = s64[9,1]{1,0} broadcast(%constant_15_1), dimensions={}, metadata={scheduling_name="broadcast.68.3"}
  %compare.16.3 = pred[9,1]{1,0} compare(%convert.18.9, %broadcast.68.3), direction=GE, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/ge" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="compare.16.3"}
  %constant_16_1 = s64[] constant(4)
  %broadcast.69.3 = s64[9,1]{1,0} broadcast(%constant_16_1), dimensions={}, metadata={scheduling_name="broadcast.69.3"}
  %compare.17.3 = pred[9,1]{1,0} compare(%convert.18.9, %broadcast.69.3), direction=LE, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/le" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="compare.17.3"}
  ROOT %and.5.1 = pred[9,1]{1,0} and(%compare.16.3, %compare.17.3), metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="and.5.1"}
}

ENTRY %main.97_spmd (param.2.0: f64[20,2,5,1963,2], param.4.0: c128[9,2,2], param.3.0: c128[9,1963], param.5: pred[9], param.1.0: s32[9]) -> f64[20,2,9,1963,2] {
  %param.1.0 = s32[9]{0} parameter(4), sharding={replicated}, metadata={op_name="position_in_reads" scheduling_name="param.1.0"}
  %param.4.0 = c128[9,2,2]{2,1,0} parameter(1), sharding={replicated}, metadata={op_name="U_per_k" scheduling_name="param.4.0"}
  %param.3.0 = c128[9,1963]{1,0} parameter(2), sharding={replicated}, metadata={op_name="phase_per_k" scheduling_name="param.3.0"}
  %param.2.0 = f64[20,2,5,1963,2]{4,3,2,1,0} parameter(0), sharding={devices=[4,1,1,1,1]<=[4]}, metadata={op_name="cnk_at_ibz" scheduling_name="param.2.0"}
  %param.5 = pred[9]{0} parameter(3), sharding={replicated}, metadata={op_name="tr_mask_per_k" scheduling_name="param.5"}
  %loop_and_fusion = pred[9,1]{1,0} fusion(%param.1.0), kind=kLoop, calls=%fused_and, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/jit(_take)/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=688 scheduling_name="loop_and_fusion"}
  %loop_multiply_fusion = c128[9,20,1963,2]{3,2,1,0} fusion(%param.3.0, %param.2.0, %loop_and_fusion, %param.5, %param.1.0), kind=kLoop, calls=%fused_multiply, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=698 scheduling_name="loop_multiply_fusion"}
  %bitcast.277.0 = c128[9,39260,2]{2,1,0} bitcast(%loop_multiply_fusion), metadata={scheduling_name="bitcast.277.0"}
  %custom-call.1.0 = (c128[9,39260,2]{2,1,0}, s8[4194304]{0}) custom-call(%bitcast.277.0, %param.4.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/kac,bckg->bakg/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=701 scheduling_name="custom-call.1.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["2"],"rhs_contracting_dimensions":["2"],"lhs_batch_dimensions":["0"],"rhs_batch_dimensions":["0"]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"78520","rhs_stride":"4","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.1 = c128[9,39260,2]{2,1,0} get-tuple-element(%custom-call.1.0), index=0, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/kac,bckg->bakg/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=701 scheduling_name="get-tuple-element.1"}
  ROOT %input_concatenate_fusion = f64[20,2,9,1963,2]{4,3,2,1,0} fusion(%get-tuple-element.1), kind=kInput, calls=%fused_concatenate, metadata={op_name="jit(_per_rank)/jit(main)/jit(shmap_body)/concatenate" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/phdf5_wfn_reader.py" source_line=704 scheduling_name="input_concatenate_fusion"}
}

