HloModule jit__expand_band_diagonal_to_kij_jit, entry_computation_layout={(c128[80]{0})->c128[9,80,80]{2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.17 (Arg_0.1: c128[80]) -> c128[9,80,80] {
  %iota.2 = s64[80]{0} iota(), iota_dimension=0, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %broadcast.3 = s64[80,80]{1,0} broadcast(%iota.2), dimensions={0}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %iota.4 = s64[80]{0} iota(), iota_dimension=0, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %broadcast.5 = s64[80,80]{1,0} broadcast(%iota.4), dimensions={1}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %compare.6 = pred[80,80]{1,0} compare(%broadcast.3, %broadcast.5), direction=EQ, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/eq" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %convert.7 = c128[80,80]{1,0} convert(%compare.6), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=579}
  %reshape.8 = c128[1,80,80]{2,1,0} reshape(%convert.7), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %Arg_0.1 = c128[80]{0} parameter(0), metadata={op_name="diag"}
  %reshape.9 = c128[1,80,1]{2,1,0} reshape(%Arg_0.1), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %broadcast.10 = c128[1,80,1]{2,1,0} broadcast(%reshape.9), dimensions={0,1,2}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %reshape.11 = c128[1,80]{1,0} reshape(%broadcast.10), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %broadcast.12 = c128[1,80,80]{2,1,0} broadcast(%reshape.11), dimensions={0,1}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %multiply.13 = c128[1,80,80]{2,1,0} multiply(%reshape.8, %broadcast.12), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/mul" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=580}
  %broadcast.14 = c128[1,80,80]{2,1,0} broadcast(%multiply.13), dimensions={0,1,2}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=581}
  %reshape.15 = c128[80,80]{1,0} reshape(%broadcast.14), metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=581}
  ROOT %broadcast.16 = c128[9,80,80]{2,1,0} broadcast(%reshape.15), dimensions={1,2}, metadata={op_name="jit(_expand_band_diagonal_to_kij_jit)/jit(main)/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/gw/head_correction.py" source_line=581}
}

