HloModule jit__batched_chol, is_scheduled=true, entry_computation_layout={(c128[9,1,1,320,320]{4,3,2,1,0})->c128[9,1,1,320,320]{4,3,2,1,0}}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4, frontend_attributes={fingerprint_before_lhs="dcbefcc5b41442e57bfbfc7d82d0d043"}

%fused_transpose (param_0.82: c128[1,1,320,320], param_1.74: c128[320,320], param_2.118: s32[], param_3.76: s32[], param_4.48: s64[2], param_5.27: s64[]) -> c128[320,320] {
  %param_2.118 = s32[] parameter(2), metadata={scheduling_name="param_2.118"}
  %convert.60.8 = s64[] convert(%param_2.118), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.60.8"}
  %param_4.48 = s64[2]{0} parameter(4), metadata={scheduling_name="param_4.48"}
  %param_5.27 = s64[] parameter(5), metadata={scheduling_name="param_5.27"}
  %dynamic-slice.62.31 = s64[1]{0} dynamic-slice(%param_4.48, %param_5.27), dynamic_slice_sizes={1}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="dynamic-slice.62.31"}
  %bitcast.706.31 = s64[] bitcast(%dynamic-slice.62.31), metadata={scheduling_name="bitcast.706.31"}
  %compare.189.7 = pred[] compare(%convert.60.8, %bitcast.706.31), direction=GT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/gt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="compare.189.7"}
  %param_3.76 = s32[] parameter(3), metadata={scheduling_name="param_3.76"}
  %convert.61.12 = s64[] convert(%param_3.76), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.61.12"}
  %compare.190.7 = pred[] compare(%convert.61.12, %bitcast.706.31), direction=GT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/gt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="compare.190.7"}
  %and.77.5 = pred[] and(%compare.189.7, %compare.190.7), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="and.77.5"}
  %compare.191.3 = pred[] compare(%param_2.118, %param_3.76), direction=GE, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/ge" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=208 scheduling_name="compare.191.3"}
  %and.78.3 = pred[] and(%and.77.5, %compare.191.3), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=206 scheduling_name="and.78.3"}
  %broadcast.221.1 = pred[1,1,320,320]{3,2,1,0} broadcast(%and.78.3), dimensions={}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="broadcast.221.1"}
  %param_0.82 = c128[1,1,320,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.82"}
  %bitcast.821.5 = c128[320,320]{1,0} bitcast(%param_0.82), metadata={scheduling_name="bitcast.821.5"}
  %param_1.74 = c128[320,320]{0,1} parameter(1), metadata={scheduling_name="param_1.74"}
  %bitcast.908.5 = c128[320,320]{1,0} bitcast(%param_1.74), metadata={scheduling_name="bitcast.908.5"}
  %subtract.10.5 = c128[320,320]{1,0} subtract(%bitcast.821.5, %bitcast.908.5), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/sub" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=211 scheduling_name="subtract.10.5"}
  %bitcast.911.3 = c128[1,1,320,320]{3,2,1,0} bitcast(%subtract.10.5), metadata={scheduling_name="bitcast.911.3"}
  %select.143.3 = c128[1,1,320,320]{3,2,1,0} select(%broadcast.221.1, %bitcast.911.3, %param_0.82), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="select.143.3"}
  %bitcast.914.1 = c128[320,320]{1,0} bitcast(%select.143.3), metadata={scheduling_name="bitcast.914.1"}
  ROOT %transpose.50.1 = c128[320,320]{1,0} transpose(%bitcast.914.1), dimensions={1,0}, metadata={scheduling_name="transpose.50.1"}
}

%and.reduce_sub_computation.1 (lhs.1: pred[], rhs.1: pred[]) -> pred[] {
  %rhs.1 = pred[] parameter(1), metadata={scheduling_name="rhs.1"}
  %lhs.1 = pred[] parameter(0), metadata={scheduling_name="lhs.1"}
  ROOT %and.76 = pred[] and(%lhs.1, %rhs.1), metadata={scheduling_name="and.76"}
}

%fused_dynamic_update_slice (param_0.10: c128[2,320,320], param_1.131: c128[1,1,320,320], param_2.127: s32[], param_3.89: s64[2], param_4.61: s64[], param_5.42: s32[], param_6.39: s32[3]) -> c128[2,320,320] {
  %param_0.10 = c128[2,320,320]{2,1,0} parameter(0), metadata={scheduling_name="param_0.10"}
  %param_5.42 = s32[] parameter(5), metadata={scheduling_name="param_5.42"}
  %convert.61.10 = s64[] convert(%param_5.42), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.61.10"}
  %param_3.89 = s64[2]{0} parameter(3), metadata={scheduling_name="param_3.89"}
  %param_4.61 = s64[] parameter(4), metadata={scheduling_name="param_4.61"}
  %dynamic-slice.62.27 = s64[1]{0} dynamic-slice(%param_3.89, %param_4.61), dynamic_slice_sizes={1}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="dynamic-slice.62.27"}
  %bitcast.706.27 = s64[] bitcast(%dynamic-slice.62.27), metadata={scheduling_name="bitcast.706.27"}
  %compare.192.9 = pred[] compare(%convert.61.10, %bitcast.706.27), direction=EQ, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/eq" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=152 scheduling_name="compare.192.9"}
  %param_2.127 = s32[] parameter(2), metadata={scheduling_name="param_2.127"}
  %convert.60.6 = s64[] convert(%param_2.127), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.60.6"}
  %compare.196.5 = pred[] compare(%convert.60.6, %bitcast.706.27), direction=GE, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/ge" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=187 scheduling_name="compare.196.5"}
  %and.82.3 = pred[] and(%compare.192.9, %compare.196.5), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=187 scheduling_name="and.82.3"}
  %broadcast.231.1 = pred[1,1,320,320]{3,2,1,0} broadcast(%and.82.3), dimensions={}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=189 scheduling_name="broadcast.231.1"}
  %constant_323_3 = s32[] constant(0)
  %broadcast.232.5 = s32[3]{0} broadcast(%constant_323_3), dimensions={}, metadata={scheduling_name="broadcast.232.5"}
  %compare.197.7 = pred[] compare(%param_2.127, %constant_323_3), direction=LT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="compare.197.7"}
  %constant_350_2 = s32[] constant(2)
  %add.103.7 = s32[] add(%param_2.127, %constant_350_2), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="add.103.7"}
  %select.139.7 = s32[] select(%compare.197.7, %add.103.7, %param_2.127), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="select.139.7"}
  %bitcast.848.5 = s32[1]{0} bitcast(%select.139.7), metadata={scheduling_name="bitcast.848.5"}
  %constant_324_1 = s32[1]{0} constant({0}), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/broadcast_in_dim" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=175}
  %concatenate.24.5 = s32[3]{0} concatenate(%bitcast.848.5, %constant_324_1, %constant_324_1), dimensions={0}, metadata={scheduling_name="concatenate.24.5"}
  %compare.198.5 = pred[3]{0} compare(%broadcast.232.5, %concatenate.24.5), direction=LE, metadata={scheduling_name="compare.198.5"}
  %param_6.39 = s32[3]{0} parameter(6), metadata={scheduling_name="param_6.39"}
  %compare.199.3 = pred[3]{0} compare(%param_6.39, %concatenate.24.5), direction=GE, metadata={scheduling_name="compare.199.3"}
  %and.83.3 = pred[3]{0} and(%compare.198.5, %compare.199.3), metadata={scheduling_name="and.83.3"}
  %constant_330_1 = pred[] constant(true)
  %reduce.15.1 = pred[] reduce(%and.83.3, %constant_330_1), dimensions={0}, to_apply=%and.reduce_sub_computation.1, metadata={scheduling_name="reduce.15.1"}
  %broadcast.233.1 = pred[1,1,320,320]{3,2,1,0} broadcast(%reduce.15.1), dimensions={}, metadata={scheduling_name="broadcast.233.1"}
  %param_1.131 = c128[1,1,320,320]{3,2,1,0} parameter(1), metadata={scheduling_name="param_1.131"}
  %constant_338_1 = c128[] constant((0, 0))
  %broadcast.234.1 = c128[1,1,320,320]{3,2,1,0} broadcast(%constant_338_1), dimensions={}, metadata={scheduling_name="broadcast.234.1"}
  %select.140.3 = c128[1,1,320,320]{3,2,1,0} select(%broadcast.233.1, %param_1.131, %broadcast.234.1), metadata={scheduling_name="select.140.3"}
  %select.141.3 = c128[1,1,320,320]{3,2,1,0} select(%broadcast.231.1, %select.140.3, %broadcast.234.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=189 scheduling_name="select.141.3"}
  %bitcast.872.1 = c128[1,320,320]{2,1,0} bitcast(%select.141.3), metadata={scheduling_name="bitcast.872.1"}
  ROOT %dynamic-update-slice.21.1 = c128[2,320,320]{2,1,0} dynamic-update-slice(%param_0.10, %bitcast.872.1, %select.139.7, %constant_323_3, %constant_323_3), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=189 scheduling_name="dynamic-update-slice.21.1"}
}

%fused_transpose.1 (param_0.81: c128[1,1,320,320], param_1.73: c128[320,320], param_2.121: s64[2], param_3.81: s64[], param_4.53: s32[], param_5.31: s32[]) -> c128[1,1,320,320] {
  %param_5.31 = s32[] parameter(5), metadata={scheduling_name="param_5.31"}
  %convert.61.14 = s64[] convert(%param_5.31), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.61.14"}
  %param_2.121 = s64[2]{0} parameter(2), metadata={scheduling_name="param_2.121"}
  %param_3.81 = s64[] parameter(3), metadata={scheduling_name="param_3.81"}
  %dynamic-slice.62.35 = s64[1]{0} dynamic-slice(%param_2.121, %param_3.81), dynamic_slice_sizes={1}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="dynamic-slice.62.35"}
  %bitcast.706.35 = s64[] bitcast(%dynamic-slice.62.35), metadata={scheduling_name="bitcast.706.35"}
  %compare.192.11 = pred[] compare(%convert.61.14, %bitcast.706.35), direction=EQ, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/eq" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=152 scheduling_name="compare.192.11"}
  %param_4.53 = s32[] parameter(4), metadata={scheduling_name="param_4.53"}
  %convert.60.10 = s64[] convert(%param_4.53), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.60.10"}
  %compare.189.9 = pred[] compare(%convert.60.10, %bitcast.706.35), direction=GT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/gt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="compare.189.9"}
  %and.79.3 = pred[] and(%compare.192.11, %compare.189.9), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=172 scheduling_name="and.79.3"}
  %broadcast.222.1 = pred[1,1,320,320]{3,2,1,0} broadcast(%and.79.3), dimensions={}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="broadcast.222.1"}
  %param_1.73 = c128[320,320]{0,1} parameter(1), metadata={scheduling_name="param_1.73"}
  %bitcast.815.3 = c128[320,320]{1,0} bitcast(%param_1.73), metadata={scheduling_name="bitcast.815.3"}
  %transpose.49.3 = c128[320,320]{1,0} transpose(%bitcast.815.3), dimensions={1,0}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_solve_triangular)/triangular_solve" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="transpose.49.3"}
  %bitcast.818.1 = c128[1,1,320,320]{3,2,1,0} bitcast(%transpose.49.3), metadata={scheduling_name="bitcast.818.1"}
  %param_0.81 = c128[1,1,320,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.81"}
  ROOT %select.138.1 = c128[1,1,320,320]{3,2,1,0} select(%broadcast.222.1, %bitcast.818.1, %param_0.81), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="select.138.1"}
}

%fused_transpose.2 (param_0.18: c128[1,1,320,320]) -> c128[320,320] {
  %param_0.18 = c128[1,1,320,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.18"}
  %bitcast.808.1 = c128[320,320]{1,0} bitcast(%param_0.18), metadata={scheduling_name="bitcast.808.1"}
  ROOT %transpose.48.1 = c128[320,320]{1,0} transpose(%bitcast.808.1), dimensions={1,0}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="transpose.48.1"}
}

%fused_select_transpose (param_0.129: c128[320,320], param_1.135: s32[], param_2.130: s64[2], param_3.90: s64[], param_4.62: s32[], param_5.43: s32[], param_6.44: c128[1,1,320,320]) -> (c128[320,320], c128[1,1,320,320]) {
  %param_5.43 = s32[] parameter(5), metadata={scheduling_name="param_5.43"}
  %convert.60.14 = s64[] convert(%param_5.43), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.60.14"}
  %param_2.130 = s64[2]{0} parameter(2), metadata={scheduling_name="param_2.130"}
  %param_3.90 = s64[] parameter(3), metadata={scheduling_name="param_3.90"}
  %dynamic-slice.62.43 = s64[1]{0} dynamic-slice(%param_2.130, %param_3.90), dynamic_slice_sizes={1}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="dynamic-slice.62.43"}
  %bitcast.706.43 = s64[] bitcast(%dynamic-slice.62.43), metadata={scheduling_name="bitcast.706.43"}
  %compare.193.7 = pred[] compare(%convert.60.14, %bitcast.706.43), direction=EQ, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/eq" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=151 scheduling_name="compare.193.7"}
  %param_4.62 = s32[] parameter(4), metadata={scheduling_name="param_4.62"}
  %convert.61.18 = s64[] convert(%param_4.62), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/convert_element_type" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=207 scheduling_name="convert.61.18"}
  %compare.192.15 = pred[] compare(%convert.61.18, %bitcast.706.43), direction=EQ, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/eq" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=152 scheduling_name="compare.192.15"}
  %and.80.5 = pred[] and(%compare.193.7, %compare.192.15), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/and" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=151 scheduling_name="and.80.5"}
  %broadcast.223.1 = pred[320,320]{1,0} broadcast(%and.80.5), dimensions={}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=166 scheduling_name="broadcast.223.1"}
  %iota.17.3 = s32[320,320]{1,0} iota(), iota_dimension=1, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="iota.17.3"}
  %iota.18.3 = s32[320,320]{1,0} iota(), iota_dimension=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="iota.18.3"}
  %compare.194.3 = pred[320,320]{1,0} compare(%iota.17.3, %iota.18.3), direction=GE, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/ge" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="compare.194.3"}
  %param_1.135 = s32[] parameter(1), metadata={scheduling_name="param_1.135"}
  %constant_323_2 = s32[] constant(0)
  %compare.195.2 = pred[] compare(%param_1.135, %constant_323_2), direction=EQ, metadata={scheduling_name="compare.195.2"}
  %broadcast.225.1 = pred[320,320]{1,0} broadcast(%compare.195.2), dimensions={}, metadata={scheduling_name="broadcast.225.1"}
  %param_0.129 = c128[320,320]{0,1} parameter(0), metadata={scheduling_name="param_0.129"}
  %bitcast.770.7 = c128[320,320]{1,0} bitcast(%param_0.129), metadata={scheduling_name="bitcast.770.7"}
  %constant_402_1 = c128[] constant((nan, nan))
  %broadcast.226.7 = c128[320,320]{1,0} broadcast(%constant_402_1), dimensions={}, metadata={scheduling_name="broadcast.226.7"}
  %select.133.7 = c128[320,320]{1,0} select(%broadcast.225.1, %bitcast.770.7, %broadcast.226.7), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/cholesky" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="select.133.7"}
  %constant_338_2 = c128[] constant((0, 0))
  %broadcast.227.6 = c128[320,320]{1,0} broadcast(%constant_338_2), dimensions={}, metadata={scheduling_name="broadcast.227.6"}
  %select.134.5 = c128[320,320]{1,0} select(%compare.194.3, %select.133.7, %broadcast.227.6), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="select.134.5"}
  %select.136.1 = c128[320,320]{1,0} select(%broadcast.223.1, %select.134.5, %broadcast.227.6), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=166 scheduling_name="select.136.1"}
  %broadcast.229.1.clone.1 = pred[1,1,320,320]{3,2,1,0} broadcast(%and.80.5), dimensions={}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="broadcast.229.1.clone.1"}
  %bitcast.801.1.clone.1 = c128[1,1,320,320]{3,2,1,0} bitcast(%select.134.5), metadata={scheduling_name="bitcast.801.1.clone.1"}
  %param_6.44 = c128[1,1,320,320]{3,2,1,0} parameter(6), metadata={scheduling_name="param_6.44"}
  %bitcast.746.11.clone.1 = c128[320,320]{1,0} bitcast(%param_6.44), metadata={scheduling_name="bitcast.746.11.clone.1"}
  %transpose.47.3.clone.1 = c128[320,320]{1,0} transpose(%bitcast.746.11.clone.1), dimensions={1,0}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/squeeze" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=159 scheduling_name="transpose.47.3.clone.1"}
  %bitcast.805.1.clone.1 = c128[1,1,320,320]{3,2,1,0} bitcast(%transpose.47.3.clone.1), metadata={scheduling_name="bitcast.805.1.clone.1"}
  %select.137.1.clone.1 = c128[1,1,320,320]{3,2,1,0} select(%broadcast.229.1.clone.1, %bitcast.801.1.clone.1, %bitcast.805.1.clone.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="select.137.1.clone.1"}
  ROOT %tuple.58 = (c128[320,320]{1,0}, c128[1,1,320,320]{3,2,1,0}) tuple(%select.136.1, %select.137.1.clone.1), metadata={scheduling_name="tuple.58"}
}

%fused_transpose.3 (param_0.125: c128[1,1,320,320]) -> c128[320,320] {
  %param_0.125 = c128[1,1,320,320]{3,2,1,0} parameter(0), metadata={scheduling_name="param_0.125"}
  %bitcast.746.13 = c128[320,320]{1,0} bitcast(%param_0.125), metadata={scheduling_name="bitcast.746.13"}
  %transpose.47.5 = c128[320,320]{1,0} transpose(%bitcast.746.13), dimensions={1,0}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/squeeze" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=159 scheduling_name="transpose.47.5"}
  %real.18.3 = f64[320,320]{1,0} real(%bitcast.746.13), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="real.18.3"}
  %imag.18.5 = f64[320,320]{1,0} imag(%bitcast.746.13), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="imag.18.5"}
  %negate.28.3 = f64[320,320]{1,0} negate(%imag.18.5), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/neg" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="negate.28.3"}
  %complex.18.1 = c128[320,320]{1,0} complex(%real.18.3, %negate.28.3), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="complex.18.1"}
  %add.102.1 = c128[320,320]{1,0} add(%transpose.47.5, %complex.18.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="add.102.1"}
  %constant_337_1 = c128[] constant((0.5, 0))
  %broadcast.224.1 = c128[320,320]{1,0} broadcast(%constant_337_1), dimensions={}, metadata={scheduling_name="broadcast.224.1"}
  ROOT %multiply.4.1 = c128[320,320]{1,0} multiply(%add.102.1, %broadcast.224.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="multiply.4.1"}
}

%fused_complex_dynamic_slice (param_0.124: c128[2,320,320], param_1.132: s32[], param_2.137: s32[]) -> (c128[1,320,320], c128[1,320,320]) {
  %param_0.124 = c128[2,320,320]{1,2,0} parameter(0), metadata={scheduling_name="param_0.124"}
  %bitcast.879.8 = c128[2,320,320]{2,1,0} bitcast(%param_0.124), metadata={scheduling_name="bitcast.879.8"}
  %param_1.132 = s32[] parameter(1), metadata={scheduling_name="param_1.132"}
  %constant_323_4 = s32[] constant(0)
  %compare.200.1 = pred[] compare(%param_1.132, %constant_323_4), direction=LT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=199 scheduling_name="compare.200.1"}
  %constant_350_1 = s32[] constant(2)
  %add.104.1 = s32[] add(%param_1.132, %constant_350_1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=199 scheduling_name="add.104.1"}
  %select.142.1 = s32[] select(%compare.200.1, %add.104.1, %param_1.132), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=199 scheduling_name="select.142.1"}
  %dynamic-slice.64.7 = c128[1,320,320]{2,1,0} dynamic-slice(%bitcast.879.8, %select.142.1, %constant_323_4, %constant_323_4), dynamic_slice_sizes={1,320,320}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=199 scheduling_name="dynamic-slice.64.7"}
  %real.20.3 = f64[1,320,320]{2,1,0} real(%dynamic-slice.64.7), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="real.20.3"}
  %imag.20.3 = f64[1,320,320]{2,1,0} imag(%dynamic-slice.64.7), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="imag.20.3"}
  %negate.30.1 = f64[1,320,320]{2,1,0} negate(%imag.20.3), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/neg" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="negate.30.1"}
  %complex.20.1 = c128[1,320,320]{2,1,0} complex(%real.20.3, %negate.30.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="complex.20.1"}
  %param_2.137 = s32[] parameter(2), metadata={scheduling_name="param_2.137"}
  %compare.197.1.clone.1 = pred[] compare(%param_2.137, %constant_323_4), direction=LT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="compare.197.1.clone.1"}
  %add.103.1.clone.1 = s32[] add(%param_2.137, %constant_350_1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="add.103.1.clone.1"}
  %select.139.3.clone.1 = s32[] select(%compare.197.1.clone.1, %add.103.1.clone.1, %param_2.137), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=190 scheduling_name="select.139.3.clone.1"}
  %dynamic-slice.63.1.clone.1 = c128[1,320,320]{2,1,0} dynamic-slice(%bitcast.879.8, %select.139.3.clone.1, %constant_323_4, %constant_323_4), dynamic_slice_sizes={1,320,320}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/dynamic_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=203 scheduling_name="dynamic-slice.63.1.clone.1"}
  ROOT %tuple.57 = (c128[1,320,320]{2,1,0}, c128[1,320,320]{2,1,0}) tuple(%complex.20.1, %dynamic-slice.63.1.clone.1), metadata={scheduling_name="tuple.57"}
}

%fused_complex (param_0.77: c128[320,320]) -> c128[320,320] {
  %param_0.77 = c128[320,320]{0,1} parameter(0), metadata={scheduling_name="param_0.77"}
  %bitcast.786.8 = c128[320,320]{1,0} bitcast(%param_0.77), metadata={scheduling_name="bitcast.786.8"}
  %real.19.3 = f64[320,320]{1,0} real(%bitcast.786.8), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/real" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="real.19.3"}
  %imag.19.5 = f64[320,320]{1,0} imag(%bitcast.786.8), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/imag" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="imag.19.5"}
  %negate.29.3 = f64[320,320]{1,0} negate(%imag.19.5), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/neg" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="negate.29.3"}
  ROOT %complex.19.1 = c128[320,320]{1,0} complex(%real.19.3, %negate.29.3), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="complex.19.1"}
}

%fused_add (param_0.122: s64[]) -> s64[] {
  %param_0.122 = s64[] parameter(0), metadata={scheduling_name="param_0.122"}
  %constant_316_1 = s64[] constant(1)
  ROOT %add.101.1 = s64[] add(%param_0.122, %constant_316_1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="add.101.1"}
}

%fused_broadcast () -> c128[2,320,320] {
  %constant_338_3 = c128[] constant((0, 0))
  ROOT %broadcast.230.1 = c128[2,320,320]{2,1,0} broadcast(%constant_338_3), dimensions={}, metadata={scheduling_name="broadcast.230.1"}
}

%region_3.119 (Arg_0.120: c128[], Arg_1.121: c128[]) -> c128[] {
  %Arg_1.121 = c128[] parameter(1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" scheduling_name="Arg_1.121"}
  %Arg_0.120 = c128[] parameter(0), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" scheduling_name="Arg_0.120"}
  ROOT %add.99 = c128[] add(%Arg_0.120, %Arg_1.121), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=167 scheduling_name="add.99"}
}

%region_10.279 (Arg_0.280: c128[], Arg_1.281: c128[]) -> c128[] {
  %Arg_1.281 = c128[] parameter(1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" scheduling_name="Arg_1.281"}
  %Arg_0.280 = c128[] parameter(0), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" scheduling_name="Arg_0.280"}
  ROOT %add.100 = c128[] add(%Arg_0.280, %Arg_1.281), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=194 scheduling_name="add.100"}
}

%region_1.494_spmd (param.10.0: (s64[], c128[1,1,320,320], s64[2], s32[], s32[])) -> (s64[], c128[1,1,320,320], s64[2], s32[], s32[]) {
  %param.10.0 = (s64[], c128[1,1,320,320]{3,2,1,0}, s64[2]{0}, s32[], s32[]) parameter(0), metadata={scheduling_name="param.10.0"}
  %constant_352_0 = s32[3]{0} constant({1, 0, 0})
  %get-tuple-element.207 = c128[1,1,320,320]{3,2,1,0} get-tuple-element(%param.10.0), index=1, metadata={scheduling_name="get-tuple-element.207"}
  %input_transpose_fusion.3 = c128[320,320]{1,0} fusion(%get-tuple-element.207), kind=kInput, calls=%fused_transpose.3, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/div" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="input_transpose_fusion.3"}
  %bitcast.762.0 = c128[320,320]{0,1} bitcast(%input_transpose_fusion.3), metadata={scheduling_name="bitcast.762.0"}
  %custom-call.4.0 = (c128[320,320]{0,1}, c128[544]{0}, s32[]) custom-call(%bitcast.762.0), custom_call_target="__cusolver$cholesky", operand_layout_constraints={c128[320,320]{0,1}}, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(cholesky)/cholesky" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=160 scheduling_name="custom-call.4.0"}, backend_config={"lower":true}
  %get-tuple-element.198 = s64[] get-tuple-element(%param.10.0), index=0, metadata={scheduling_name="get-tuple-element.198"}
  %get-tuple-element.214 = s32[] get-tuple-element(%param.10.0), index=3, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=202 scheduling_name="get-tuple-element.214"}
  %get-tuple-element.215 = s32[] get-tuple-element(%param.10.0), index=4, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=198 scheduling_name="get-tuple-element.215"}
  %get-tuple-element.213 = s64[2]{0} get-tuple-element(%param.10.0), index=2, metadata={scheduling_name="get-tuple-element.213"}
  %get-tuple-element.168.0 = c128[320,320]{0,1} get-tuple-element(%custom-call.4.0), index=0, metadata={scheduling_name="get-tuple-element.168.0"}
  %get-tuple-element.169.0 = s32[] get-tuple-element(%custom-call.4.0), index=2, metadata={scheduling_name="get-tuple-element.169.0"}
  %input_select_transpose_fusion = (c128[320,320]{1,0}, c128[1,1,320,320]{3,2,1,0}) fusion(%get-tuple-element.168.0, %get-tuple-element.169.0, %get-tuple-element.213, %get-tuple-element.198, %get-tuple-element.215, /*index=5*/%get-tuple-element.214, %get-tuple-element.207), kind=kInput, calls=%fused_select_transpose, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=166 scheduling_name="input_select_transpose_fusion"}
  %get-tuple-element.179 = c128[320,320]{1,0} get-tuple-element(%input_select_transpose_fusion), index=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=166 scheduling_name="get-tuple-element.179"}
  %bitcast.783.0 = c128[320,320]{0,1} bitcast(%get-tuple-element.179), metadata={scheduling_name="bitcast.783.0"}
  %all-reduce-start = c128[320,320]{0,1} all-reduce-start(%bitcast.783.0), channel_id=1, replica_groups={{0,1,2,3}}, use_global_device_ids=true, to_apply=%region_3.119, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=167 scheduling_name="all-reduce-start"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":false,"no_parallel_custom_call":true,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %get-tuple-element.180 = c128[1,1,320,320]{3,2,1,0} get-tuple-element(%input_select_transpose_fusion), index=1, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=166 scheduling_name="get-tuple-element.180"}
  %input_transpose_fusion.2 = c128[320,320]{1,0} fusion(%get-tuple-element.180), kind=kInput, calls=%fused_transpose.2, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/transpose" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="input_transpose_fusion.2"}
  %all-reduce-done = c128[320,320]{0,1} all-reduce-done(%all-reduce-start), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=167 scheduling_name="all-reduce-done"}
  %loop_complex_fusion = c128[320,320]{1,0} fusion(%all-reduce-done), kind=kLoop, calls=%fused_complex, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="loop_complex_fusion"}
  %bitcast.812.0 = c128[320,320]{0,1} bitcast(%input_transpose_fusion.2), metadata={scheduling_name="bitcast.812.0"}
  %bitcast.795.0 = c128[320,320]{0,1} bitcast(%loop_complex_fusion), metadata={scheduling_name="bitcast.795.0"}
  %triangular-solve.4.0 = (c128[320,320]{0,1}, s8[0]{0}) custom-call(%bitcast.795.0, %bitcast.812.0), custom_call_target="__cublas$triangularSolve", metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_solve_triangular)/triangular_solve" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="triangular-solve.4.0"}, backend_config={"left_side":true,"lower":true,"unit_diagonal":false,"transpose_a":"NO_TRANSPOSE"}
  %loop_broadcast_fusion = c128[2,320,320]{2,1,0} fusion(), kind=kLoop, calls=%fused_broadcast, metadata={scheduling_name="loop_broadcast_fusion"}
  %get-tuple-element.176.0 = c128[320,320]{0,1} get-tuple-element(%triangular-solve.4.0), index=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_solve_triangular)/triangular_solve" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=143 scheduling_name="get-tuple-element.176.0"}
  %input_transpose_fusion.1 = c128[1,1,320,320]{3,2,1,0} fusion(%get-tuple-element.180, %get-tuple-element.176.0, %get-tuple-element.213, %get-tuple-element.198, %get-tuple-element.214, /*index=5*/%get-tuple-element.215), kind=kInput, calls=%fused_transpose.1, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=161 scheduling_name="input_transpose_fusion.1"}
  %loop_dynamic_update_slice_fusion = c128[2,320,320]{2,1,0} fusion(%loop_broadcast_fusion, %input_transpose_fusion.1, %get-tuple-element.214, %get-tuple-element.213, %get-tuple-element.198, /*index=5*/%get-tuple-element.215, %constant_352_0), kind=kLoop, calls=%fused_dynamic_update_slice, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/jit(_where)/select_n" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=189 scheduling_name="loop_dynamic_update_slice_fusion"}
  %bitcast.876.0 = c128[2,320,320]{1,2,0} bitcast(%loop_dynamic_update_slice_fusion), metadata={scheduling_name="bitcast.876.0"}
  %all-reduce-start.1 = c128[2,320,320]{1,2,0} all-reduce-start(%bitcast.876.0), channel_id=2, replica_groups={{0,1,2,3}}, use_global_device_ids=true, to_apply=%region_10.279, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=194 scheduling_name="all-reduce-start.1"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"collective_backend_config":{"is_sync":true,"no_parallel_custom_call":false,"is_pipelined":false,"reification_cost":[]},"force_earliest_schedule":false}
  %all-reduce-done.1 = c128[2,320,320]{1,2,0} all-reduce-done(%all-reduce-start.1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/psum2" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=194 scheduling_name="all-reduce-done.1"}
  %loop_complex_dynamic_slice_fusion = (c128[1,320,320]{2,1,0}, c128[1,320,320]{2,1,0}) fusion(%all-reduce-done.1, %get-tuple-element.215, %get-tuple-element.214), kind=kLoop, calls=%fused_complex_dynamic_slice, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="loop_complex_dynamic_slice_fusion"}
  %get-tuple-element.178 = c128[1,320,320]{2,1,0} get-tuple-element(%loop_complex_dynamic_slice_fusion), index=1, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="get-tuple-element.178"}
  %bitcast.883.0 = c128[320,320]{0,1} bitcast(%get-tuple-element.178), metadata={scheduling_name="bitcast.883.0"}
  %get-tuple-element.177 = c128[1,320,320]{2,1,0} get-tuple-element(%loop_complex_dynamic_slice_fusion), index=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/complex" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="get-tuple-element.177"}
  %bitcast.905.0 = c128[320,320]{0,1} bitcast(%get-tuple-element.177), metadata={scheduling_name="bitcast.905.0"}
  %custom-call.6.0 = (c128[320,320]{0,1}, s8[3276800]{0}) custom-call(%bitcast.883.0, %bitcast.905.0), custom_call_target="__cublas$gemm", metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="custom-call.6.0"}, backend_config={"operation_queue_id":"0","wait_on_operation_queues":[],"gemm_backend_config":{"alpha_real":1,"alpha_imag":0,"beta":0,"dot_dimension_numbers":{"lhs_contracting_dimensions":["1"],"rhs_contracting_dimensions":["1"],"lhs_batch_dimensions":[],"rhs_batch_dimensions":[]},"precision_config":{"operand_precision":["DEFAULT","DEFAULT"],"algorithm":"ALG_UNSET"},"epilogue":"DEFAULT","damax_output":false,"lhs_stride":"102400","rhs_stride":"102400","grad_x":false,"grad_y":false},"force_earliest_schedule":false}
  %get-tuple-element.175.0 = c128[320,320]{0,1} get-tuple-element(%custom-call.6.0), index=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/while/body/while/body/dot_general" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=204 scheduling_name="get-tuple-element.175.0"}
  %input_transpose_fusion = c128[320,320]{1,0} fusion(%input_transpose_fusion.1, %get-tuple-element.175.0, %get-tuple-element.214, %get-tuple-element.215, %get-tuple-element.213, /*index=5*/%get-tuple-element.198), kind=kInput, calls=%fused_transpose, metadata={scheduling_name="input_transpose_fusion"}
  %loop_add_fusion = s64[] fusion(%get-tuple-element.198), kind=kLoop, calls=%fused_add, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 deduplicated_name="loop_add_fusion" scheduling_name="loop_add_fusion"}
  %bitcast.918.0 = c128[1,1,320,320]{3,2,1,0} bitcast(%input_transpose_fusion), metadata={scheduling_name="bitcast.918.0"}
  ROOT %tuple.62 = (s64[], c128[1,1,320,320]{3,2,1,0}, s64[2]{0}, s32[], s32[]) tuple(%loop_add_fusion, %bitcast.918.0, %get-tuple-element.213, %get-tuple-element.214, %get-tuple-element.215), metadata={scheduling_name="tuple.62"}
}

%fused_compare.1 (param_0.1: s64[]) -> pred[] {
  %param_0.1 = s64[] parameter(0), metadata={scheduling_name="param_0.1"}
  %constant_312_1 = s64[] constant(2)
  ROOT %compare.188.1 = pred[] compare(%param_0.1, %constant_312_1), direction=LT, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/cond/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="compare.188.1"}
}

%region_16.507_spmd (param.9.0: (s64[], c128[1,1,320,320], s64[2], s32[], s32[])) -> pred[] {
  %param.9.0 = (s64[], c128[1,1,320,320]{3,2,1,0}, s64[2]{0}, s32[], s32[]) parameter(0), metadata={scheduling_name="param.9.0"}
  %get-tuple-element.157.0 = s64[] get-tuple-element(%param.9.0), index=0, metadata={scheduling_name="get-tuple-element.157.0"}
  ROOT %loop_compare_fusion.1 = pred[] fusion(%get-tuple-element.157.0), kind=kLoop, calls=%fused_compare.1, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/while/cond/lt" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="loop_compare_fusion.1"}
}

%fused_dynamic_update_slice.1 (param_0.131: c128[9,1,1,320,320], param_1.138: s64[], param_2.135: c128[1,1,320,320]) -> c128[9,1,1,320,320] {
  %param_0.131 = c128[9,1,1,320,320]{4,3,2,1,0} parameter(0), metadata={scheduling_name="param_0.131"}
  %param_2.135 = c128[1,1,320,320]{3,2,1,0} parameter(2), metadata={scheduling_name="param_2.135"}
  %bitcast.950.1 = c128[1,1,1,320,320]{4,3,2,1,0} bitcast(%param_2.135), metadata={scheduling_name="bitcast.950.1"}
  %param_1.138 = s64[] parameter(1), metadata={scheduling_name="param_1.138"}
  %constant_366_2 = s64[] constant(0)
  ROOT %dynamic-update-slice.22.1 = c128[9,1,1,320,320]{4,3,2,1,0} dynamic-update-slice(%param_0.131, %bitcast.950.1, %param_1.138, %constant_366_2, %constant_366_2, /*index=5*/%constant_366_2, %constant_366_2), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/dynamic_update_slice" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=253 scheduling_name="dynamic-update-slice.22.1"}
}

%fused_add.1 (param_0.137: s64[]) -> s64[] {
  %param_0.137 = s64[] parameter(0), metadata={scheduling_name="param_0.137"}
  %constant_365_1 = s64[] constant(1)
  ROOT %add.105.1 = s64[] add(%param_0.137, %constant_365_1), metadata={op_name="jit(_batched_chol)/jit(main)/while/body/add" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=253 scheduling_name="add.105.1"}
}

%wrapped_iota_computation () -> s64[2] {
  ROOT %iota.19.1 = s64[2]{0} iota(), iota_dimension=0, metadata={op_name="jit(_batched_chol)/jit(main)/while/body/jit(shmap_body)/iota" source_file="/global/u2/j/jackm/software/lorrax_A/src/common/cholesky_2d.py" source_line=221 scheduling_name="iota.19.1"}
}

%fused_convert (param_0_0: u32[]) -> (s32[], s32[]) {
  %param_0_0 = u32[] parameter(0), metadata={scheduling_name="param_0_0"}
