HloModule jit__accumulate_tau_into_window, entry_computation_layout={(c128[20,9,80,80]{3,2,1,0}, c128[9,80,80]{2,1,0}, c128[9,80,80]{2,1,0}, f64[20]{0}, c128[], /*index=5*/c128[], f64[], f64[], s32[])->c128[20,9,80,80]{3,2,1,0}}, allow_spmd_sharding_propagation_to_parameters={true,false,false,true,true,true,true,true,true}, allow_spmd_sharding_propagation_to_output={true}, num_partitions=4

%region_0.10 (arg_tuple.11: (c128[9,80,80], c128[9,80,80], f64[20,1,1,1], f64[20,1,1,1])) -> c128[20,9,80,80] {
  %arg_tuple.11 = (c128[9,80,80]{2,1,0}, c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, f64[20,1,1,1]{3,2,1,0}) parameter(0)
  %get-tuple-element.15 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=3
  %convert.26 = c128[20,1,1,1]{3,2,1,0} convert(%get-tuple-element.15), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %get-tuple-element.14 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%arg_tuple.11), index=2
  %convert.24 = c128[20,1,1,1]{3,2,1,0} convert(%get-tuple-element.14), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %constant.16 = c128[] constant((0, 1))
  %broadcast.17 = c128[20,1,1,1]{3,2,1,0} broadcast(%constant.16), dimensions={}
  %multiply.25 = c128[20,1,1,1]{3,2,1,0} multiply(%convert.24, %broadcast.17), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %add.27 = c128[20,1,1,1]{3,2,1,0} add(%convert.26, %multiply.25), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %broadcast.28 = c128[20,1,1,1]{3,2,1,0} broadcast(%add.27), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %reshape.29 = c128[20]{0} reshape(%broadcast.28), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %broadcast.30 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.29), dimensions={0}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %get-tuple-element.12 = c128[9,80,80]{2,1,0} get-tuple-element(%arg_tuple.11), index=0
  %reshape.20 = c128[1,9,80,80]{3,2,1,0} reshape(%get-tuple-element.12), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315}
  %get-tuple-element.13 = c128[9,80,80]{2,1,0} get-tuple-element(%arg_tuple.11), index=1
  %reshape.21 = c128[1,9,80,80]{3,2,1,0} reshape(%get-tuple-element.13), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315}
  %constant.18 = c128[] constant((0, 1))
  %broadcast.19 = c128[1,9,80,80]{3,2,1,0} broadcast(%constant.18), dimensions={}
  %multiply.22 = c128[1,9,80,80]{3,2,1,0} multiply(%reshape.21, %broadcast.19), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315}
  %add.23 = c128[1,9,80,80]{3,2,1,0} add(%reshape.20, %multiply.22), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=315}
  %broadcast.31 = c128[1,9,80,80]{3,2,1,0} broadcast(%add.23), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %reshape.32 = c128[9,80,80]{2,1,0} reshape(%broadcast.31), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  %broadcast.33 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.32), dimensions={1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
  ROOT %multiply.34 = c128[20,9,80,80]{3,2,1,0} multiply(%broadcast.30, %broadcast.33), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_0_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=316}
}

%region_1.35 (arg_tuple.36: (c128[9,80,80], f64[20,1,1,1], c128[9,80,80], f64[20,1,1,1])) -> c128[20,9,80,80] {
  %arg_tuple.36 = (c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}) parameter(0)
  %get-tuple-element.38 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%arg_tuple.36), index=1
  %convert.42 = c128[20,1,1,1]{3,2,1,0} convert(%get-tuple-element.38), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.43 = c128[20,1,1,1]{3,2,1,0} broadcast(%convert.42), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %reshape.44 = c128[20]{0} reshape(%broadcast.43), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.45 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.44), dimensions={0}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %get-tuple-element.37 = c128[9,80,80]{2,1,0} get-tuple-element(%arg_tuple.36), index=0
  %reshape.41 = c128[1,9,80,80]{3,2,1,0} reshape(%get-tuple-element.37), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.46 = c128[1,9,80,80]{3,2,1,0} broadcast(%reshape.41), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %reshape.47 = c128[9,80,80]{2,1,0} reshape(%broadcast.46), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.48 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.47), dimensions={1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %multiply.49 = c128[20,9,80,80]{3,2,1,0} multiply(%broadcast.45, %broadcast.48), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %get-tuple-element.40 = f64[20,1,1,1]{3,2,1,0} get-tuple-element(%arg_tuple.36), index=3
  %convert.51 = c128[20,1,1,1]{3,2,1,0} convert(%get-tuple-element.40), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.52 = c128[20,1,1,1]{3,2,1,0} broadcast(%convert.51), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %reshape.53 = c128[20]{0} reshape(%broadcast.52), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.54 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.53), dimensions={0}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %get-tuple-element.39 = c128[9,80,80]{2,1,0} get-tuple-element(%arg_tuple.36), index=2
  %reshape.50 = c128[1,9,80,80]{3,2,1,0} reshape(%get-tuple-element.39), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.55 = c128[1,9,80,80]{3,2,1,0} broadcast(%reshape.50), dimensions={0,1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %reshape.56 = c128[9,80,80]{2,1,0} reshape(%broadcast.55), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %broadcast.57 = c128[20,9,80,80]{3,2,1,0} broadcast(%reshape.56), dimensions={1,2,3}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  %multiply.58 = c128[20,9,80,80]{3,2,1,0} multiply(%broadcast.54, %broadcast.57), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
  ROOT %add.59 = c128[20,9,80,80]{3,2,1,0} add(%multiply.49, %multiply.58), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=319}
}

%_project_tau_onto_omega.60 (Arg_0.61: c128[9,80,80], Arg_1.62: c128[9,80,80], Arg_2.63: f64[20], Arg_3.64: c128[], Arg_4.65: c128[], Arg_5.66: f64[], Arg_6.67: f64[], Arg_7.68: s32[]) -> c128[20,9,80,80] {
  %Arg_6.67 = f64[] parameter(6), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %convert.114 = c128[] convert(%Arg_6.67), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352}
  %broadcast.115 = c128[20,9,80,80]{3,2,1,0} broadcast(%convert.114), dimensions={}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352}
  %constant.76 = s32[] constant(0)
  %Arg_7.68 = s32[] parameter(7), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %constant.75 = s32[] constant(1)
  %clamp.110 = s32[] clamp(%constant.76, %Arg_7.68, %constant.75), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/clamp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321}
  %Arg_0.61 = c128[9,80,80]{2,1,0} parameter(0), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %Arg_1.62 = c128[9,80,80]{2,1,0} parameter(1), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %Arg_4.65 = c128[] parameter(4), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %broadcast.104 = c128[20]{0} broadcast(%Arg_4.65), dimensions={}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=346}
  %Arg_5.66 = f64[] parameter(5), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %convert.78 = c128[] convert(%Arg_5.66), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %constant.77 = c128[] constant((0, 1))
  %multiply.79 = c128[] multiply(%convert.78, %constant.77), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %broadcast.81 = c128[20]{0} broadcast(%multiply.79), dimensions={}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %Arg_2.63 = f64[20]{0} parameter(2), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %convert.80 = c128[20]{0} convert(%Arg_2.63), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.82 = c128[20]{0} multiply(%broadcast.81, %convert.80), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %Arg_3.64 = c128[] parameter(3), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/pjit"}
  %broadcast.83 = c128[20]{0} broadcast(%Arg_3.64), dimensions={}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.84 = c128[20]{0} multiply(%multiply.82, %broadcast.83), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %real.85 = f64[20]{0} real(%multiply.84), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %exponential.86 = f64[20]{0} exponential(%real.85), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %constant.73 = f64[] constant(inf)
  %broadcast.74 = f64[20]{0} broadcast(%constant.73), dimensions={}
  %compare.87 = pred[20]{0} compare(%exponential.86, %broadcast.74), direction=EQ, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %constant.71 = f64[] constant(0.5)
  %broadcast.72 = f64[20]{0} broadcast(%constant.71), dimensions={}
  %multiply.88 = f64[20]{0} multiply(%real.85, %broadcast.72), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %exponential.89 = f64[20]{0} exponential(%multiply.88), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %imag.90 = f64[20]{0} imag(%multiply.84), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %cosine.91 = f64[20]{0} cosine(%imag.90), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.92 = f64[20]{0} multiply(%exponential.89, %cosine.91), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.93 = f64[20]{0} multiply(%multiply.92, %exponential.89), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.94 = f64[20]{0} multiply(%exponential.86, %cosine.91), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %select.95 = f64[20]{0} select(%compare.87, %multiply.93, %multiply.94), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %constant.69 = f64[] constant(0)
  %broadcast.70 = f64[20]{0} broadcast(%constant.69), dimensions={}
  %compare.96 = pred[20]{0} compare(%imag.90, %broadcast.70), direction=EQ, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %sine.97 = f64[20]{0} sine(%imag.90), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.98 = f64[20]{0} multiply(%exponential.89, %sine.97), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.99 = f64[20]{0} multiply(%multiply.98, %exponential.89), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.100 = f64[20]{0} multiply(%exponential.86, %sine.97), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %select.101 = f64[20]{0} select(%compare.87, %multiply.99, %multiply.100), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %select.102 = f64[20]{0} select(%compare.96, %broadcast.70, %select.101), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %complex.103 = c128[20]{0} complex(%select.95, %select.102), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/exp" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=345}
  %multiply.105 = c128[20]{0} multiply(%broadcast.104, %complex.103), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=346}
  %imag.108 = f64[20]{0} imag(%multiply.105), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348}
  %reshape.109 = f64[20,1,1,1]{3,2,1,0} reshape(%imag.108), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=348}
  %real.106 = f64[20]{0} real(%multiply.105), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=347}
  %reshape.107 = f64[20,1,1,1]{3,2,1,0} reshape(%real.106), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=347}
  %tuple.111 = (c128[9,80,80]{2,1,0}, c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, f64[20,1,1,1]{3,2,1,0}) tuple(%Arg_0.61, %Arg_1.62, %reshape.109, %reshape.107), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321}
  %tuple.112 = (c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}, c128[9,80,80]{2,1,0}, f64[20,1,1,1]{3,2,1,0}) tuple(%Arg_1.62, %reshape.107, %Arg_0.61, %reshape.109), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321}
  %conditional.113 = c128[20,9,80,80]{3,2,1,0} conditional(%clamp.110, %tuple.111, %tuple.112), branch_computations={%region_0.10, %region_1.35}, metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/cond" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=321}
  ROOT %multiply.116 = c128[20,9,80,80]{3,2,1,0} multiply(%broadcast.115, %conditional.113), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/jit(_project_tau_onto_omega)/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=352}
}

ENTRY %main.119 (Arg_0.1: c128[20,9,80,80], Arg_1.2: c128[9,80,80], Arg_2.3: c128[9,80,80], Arg_3.4: f64[20], Arg_4.5: c128[], Arg_5.6: c128[], Arg_6.7: f64[], Arg_7.8: f64[], Arg_8.9: s32[]) -> c128[20,9,80,80] {
  %Arg_0.1 = c128[20,9,80,80]{3,2,1,0} parameter(0), metadata={op_name="acc_win"}
  %Arg_1.2 = c128[9,80,80]{2,1,0} parameter(1), sharding={replicated}, metadata={op_name="sigma_tau_kij_re"}
  %Arg_2.3 = c128[9,80,80]{2,1,0} parameter(2), sharding={replicated}, metadata={op_name="sigma_tau_kij_im"}
  %Arg_3.4 = f64[20]{0} parameter(3), metadata={op_name="omega_vec"}
  %Arg_4.5 = c128[] parameter(4), metadata={op_name="t_node"}
  %Arg_5.6 = c128[] parameter(5), metadata={op_name="alpha_eff"}
  %Arg_6.7 = f64[] parameter(6), metadata={op_name="omega_sign"}
  %Arg_7.8 = f64[] parameter(7), metadata={op_name="pref"}
  %Arg_8.9 = s32[] parameter(8), metadata={op_name="project_code"}
  %call.117 = c128[20,9,80,80]{3,2,1,0} call(%Arg_1.2, %Arg_2.3, %Arg_3.4, %Arg_4.5, %Arg_5.6, /*index=5*/%Arg_6.7, %Arg_7.8, %Arg_8.9), to_apply=%_project_tau_onto_omega.60
  ROOT %add.118 = c128[20,9,80,80]{3,2,1,0} add(%Arg_0.1, %call.117), metadata={op_name="jit(_accumulate_tau_into_window)/jit(main)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/gw/ppm_sigma.py" source_line=368}
}

