HloModule jit_multiply, is_scheduled=true, entry_computation_layout={(c128[68,1]{1,0}, f64[68,2100]{1,0})->c128[68,2100]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}, frontend_attributes={fingerprint_before_lhs="302bc7b2d44cceabf2c0698ecd3ce6ea"}

%fused_multiply (param_0.5: c128[68,1], param_1.3: f64[68,2100]) -> c128[68,2100] {
  %param_0.5 = c128[68,1]{1,0} parameter(0), metadata={scheduling_name="param_0.5"}
  %bitcast.23.3 = c128[68]{0} bitcast(%param_0.5), metadata={scheduling_name="bitcast.23.3"}
  %broadcast.2.3 = c128[68,2100]{1,0} broadcast(%bitcast.23.3), dimensions={0}, metadata={op_name="jit(multiply)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329 scheduling_name="broadcast.2.3"}
  %param_1.3 = f64[68,2100]{1,0} parameter(1), metadata={scheduling_name="param_1.3"}
  %convert.2.1 = c128[68,2100]{1,0} convert(%param_1.3), metadata={op_name="jit(multiply)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329 scheduling_name="convert.2.1"}
  ROOT %multiply.2.1 = c128[68,2100]{1,0} multiply(%broadcast.2.3, %convert.2.1), metadata={op_name="jit(multiply)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329 scheduling_name="multiply.2.1"}
}

ENTRY %main.8 (Arg_0.1.0: c128[68,1], Arg_1.2.0: f64[68,2100]) -> c128[68,2100] {
  %Arg_1.2.0 = f64[68,2100]{1,0} parameter(1), metadata={op_name="y" scheduling_name="Arg_1.2.0"}
  %Arg_0.1.0 = c128[68,1]{1,0} parameter(0), metadata={op_name="x" scheduling_name="Arg_0.1.0"}
  ROOT %loop_multiply_fusion = c128[68,2100]{1,0} fusion(%Arg_0.1.0, %Arg_1.2.0), kind=kLoop, calls=%fused_multiply, metadata={op_name="jit(multiply)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329 scheduling_name="loop_multiply_fusion"}
}

