HloModule jit_multiply, entry_computation_layout={(c128[68,2120]{1,0}, f64[68,2120]{1,0})->c128[68,2120]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.5 (Arg_0.1: c128[68,2120], Arg_1.2: f64[68,2120]) -> c128[68,2120] {
  %Arg_0.1 = c128[68,2120]{1,0} parameter(0), metadata={op_name="x"}
  %Arg_1.2 = f64[68,2120]{1,0} parameter(1), metadata={op_name="y"}
  %convert.3 = c128[68,2120]{1,0} convert(%Arg_1.2), metadata={op_name="jit(multiply)/jit(main)/convert_element_type" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329}
  ROOT %multiply.4 = c128[68,2120]{1,0} multiply(%Arg_0.1, %convert.3), metadata={op_name="jit(multiply)/jit(main)/mul" source_file="/pscratch/sd/j/jackm/lorrax_sandbox/sources/lorrax/src/psp/vnl_ops.py" source_line=329}
}

