HloModule jit_convert_element_type, entry_computation_layout={(s32[2120]{0})->s32[2120]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.2 (Arg_0.1: s32[2120]) -> s32[2120] {
  ROOT %Arg_0.1 = s32[2120]{0} parameter(0), metadata={op_name="args[0]"}
}

