HloModule jit__full_run, entry_computation_layout={(c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, c128[64,4,2,480]{3,2,1,0}, f64[64,4]{1,0}, /*index=5*/f64[64,4]{1,0}, c128[480,480,4,4,4]{4,3,2,1,0}, c128[480,480]{1,0})->(f64[5]{0}, c128[5,1024]{1,0}, s32[])}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={false,false,false}, num_partitions=4

%scalar_add_computation.1 (scalar_lhs.1: c128[], scalar_rhs.1: c128[]) -> c128[] {
  %scalar_lhs.1 = c128[] parameter(0)
  %scalar_rhs.1 = c128[] parameter(1)
  ROOT %add.756 = c128[] add(%scalar_lhs.1, %scalar_rhs.1)
}

%region_14.1676 (arg_tuple.1677: (s32[], c128[1024,1], s32[], s32[], c128[200,1024,1])) -> (s32[], c128[1024,1], s32[], s32[], c128[200,1024,1]) {
  %constant.1685 = s32[] constant(0)
  %arg_tuple.1677 = (s32[], c128[1024,1]{1,0}, s32[], s32[], c128[200,1024,1]{2,1,0}) parameter(0), sharding={{replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[1,2,1,2]<=[4] last_tile_dim_replicate}}
  %get-tuple-element.1678 = s32[] get-tuple-element(%arg_tuple.1677), index=0, sharding={replicated}
  %constant.1686 = s32[] constant(1), sharding={replicated}
  %add.1687 = s32[] add(%get-tuple-element.1678, %constant.1686), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=512}
  %get-tuple-element.1679 = c128[1024,1]{1,0} get-tuple-element(%arg_tuple.1677), index=1, sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}
  %get-tuple-element.1682 = c128[200,1024,1]{2,1,0} get-tuple-element(%arg_tuple.1677), index=4, sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}
  %constant.1061 = s32[] constant(0), sharding={replicated}
  %compare.1689 = pred[] compare(%get-tuple-element.1678, %constant.1061), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=506}
  %constant.1684 = s32[] constant(200), sharding={replicated}
  %add.1690 = s32[] add(%get-tuple-element.1678, %constant.1684), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=506}
  %select.1691 = s32[] select(%compare.1689, %add.1690, %get-tuple-element.1678), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=506}
  %constant.1062 = s32[] constant(0)
  %dynamic-slice.1692 = c128[1,1024,1]{2,1,0} dynamic-slice(%get-tuple-element.1682, %select.1691, %constant.1062, %constant.1062), dynamic_slice_sizes={1,1024,1}, sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=506}
  %get-tuple-element.1681 = s32[] get-tuple-element(%arg_tuple.1677), index=3, sharding={replicated}
  %compare.1688 = pred[] compare(%get-tuple-element.1678, %get-tuple-element.1681), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=505}
  %real.29 = f64[1,1024,1]{2,1,0} real(%dynamic-slice.1692), sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %imag.28 = f64[1,1024,1]{2,1,0} imag(%dynamic-slice.1692), sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %negate.61 = f64[1,1024,1]{2,1,0} negate(%imag.28), sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %complex.32 = c128[1,1024,1]{2,1,0} complex(%real.29, %negate.61), sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %reshape.493 = c128[1024,1]{1,0} reshape(%complex.32), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %multiply.162 = c128[1024,1]{1,0} multiply(%reshape.493, %get-tuple-element.1679), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}
  %constant.875 = c128[] constant((0, 0))
  %reduce.15 = c128[] reduce(%multiply.162, %constant.875), dimensions={0,1}, to_apply=%scalar_add_computation.1, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=508}
  %constant.901 = c128[] constant((0, 0)), sharding={replicated}
  %select.302 = c128[] select(%compare.1688, %reduce.15, %constant.901), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=507}
  %broadcast.1023 = c128[1,1024,1]{2,1,0} broadcast(%select.302), dimensions={}, sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=510}
  %multiply.163 = c128[1,1024,1]{2,1,0} multiply(%dynamic-slice.1692, %broadcast.1023), sharding={devices=[1,2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=510}
  %reshape.101 = c128[1024,1]{1,0} reshape(%multiply.163), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/dot_general" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=510}
  %subtract.1702 = c128[1024,1]{1,0} subtract(%get-tuple-element.1679, %reshape.101), sharding={devices=[2,1,2]<=[4] last_tile_dim_replicate}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/body/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=510}
  %get-tuple-element.1680 = s32[] get-tuple-element(%arg_tuple.1677), index=2, sharding={replicated}
  ROOT %tuple.1703 = (s32[], c128[1024,1]{1,0}, s32[], s32[], c128[200,1024,1]{2,1,0}) tuple(%add.1687, %subtract.1702, %get-tuple-element.1680, %get-tuple-element.1681, %get-tuple-element.1682), sharding={{replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[1,2,1,2]<=[4] last_tile_dim_replicate}}
}

%region_15.1704 (arg_tuple.1705: (s32[], c128[1024,1], s32[], s32[], c128[200,1024,1])) -> pred[] {
  %arg_tuple.1705 = (s32[], c128[1024,1]{1,0}, s32[], s32[], c128[200,1024,1]{2,1,0}) parameter(0), sharding={{replicated}, {devices=[2,1,2]<=[4] last_tile_dim_replicate}, {replicated}, {replicated}, {devices=[1,2,1,2]<=[4] last_tile_dim_replicate}}
  %get-tuple-element.1706 = s32[] get-tuple-element(%arg_tuple.1705), index=0, sharding={replicated}
  %get-tuple-element.1708 = s32[] get-tuple-element(%arg_tuple.1705), index=2, sharding={replicated}
  ROOT %compare.1711 = pred[] compare(%get-tuple-element.1706, %get-tuple-element.1708), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=512}
}

%region_18.1747 (Arg_.0: (f64[5])) -> (f64[5], pred[]) {
  %Arg_.0 = (f64[5]{0}) parameter(0), sharding={{replicated}}
  %get-tuple-element.63 = f64[5]{0} get-tuple-element(%Arg_.0), index=0, sharding={replicated}
  %constant.1749 = pred[] constant(false), sharding={replicated}
  ROOT %tuple.1750 = (f64[5]{0}, pred[]) tuple(%get-tuple-element.63, %constant.1749), sharding={{replicated}, {replicated}}
}

%region_23.1896 (Arg_0.1897: f64[], Arg_1.1898: f64[]) -> f64[] {
  %Arg_0.1897 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/reduce_max"}
  %Arg_1.1898 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/reduce_max"}
  ROOT %maximum.1899 = f64[] maximum(%Arg_0.1897, %Arg_1.1898), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/reduce_max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=549}
}

%region_22.1879 (Arg_0.1880: f64[], Arg_1.1881: f64[]) -> pred[] {
  %constant.1882 = f64[] constant(nan)
  %constant.1883 = f64[] constant(0)
  %Arg_0.1880 = f64[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/sort"}
  %compare.1886 = pred[] compare(%Arg_0.1880, %Arg_0.1880), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %constant.1063 = f64[] constant(nan)
  %constant.1065 = f64[] constant(0)
  %compare.1884 = pred[] compare(%Arg_0.1880, %constant.1065), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %constant.1066 = f64[] constant(0)
  %select.1885 = f64[] select(%compare.1884, %constant.1066, %Arg_0.1880), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %select.1887 = f64[] select(%compare.1886, %constant.1063, %select.1885), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %Arg_1.1881 = f64[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/sort"}
  %compare.1890 = pred[] compare(%Arg_1.1881, %Arg_1.1881), direction=NE, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/ne" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %constant.1064 = f64[] constant(nan)
  %constant.1067 = f64[] constant(0)
  %compare.1888 = pred[] compare(%Arg_1.1881, %constant.1067), direction=EQ, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %constant.1068 = f64[] constant(0)
  %select.1889 = f64[] select(%compare.1888, %constant.1068, %Arg_1.1881), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %select.1891 = f64[] select(%compare.1890, %constant.1064, %select.1889), metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  ROOT %compare.1892 = pred[] compare(%select.1887, %select.1891), direction=LT, type=TOTALORDER, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/lt_to" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
}

%region_20.1803.clone.clone.clone (arg_tuple.18: (s64[], c128[200,200], c128[200,1,1], c128[200,1,1])) -> (s64[], c128[200,200], c128[200,1,1], c128[200,1,1]) {
  %arg_tuple.18 = (s64[], c128[200,200]{1,0}, c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}) parameter(0), sharding={{replicated}, {replicated}, {replicated}, {replicated}}
  %get-tuple-element.362 = s64[] get-tuple-element(%arg_tuple.18), index=0, sharding={replicated}
  %constant.988 = s64[] constant(1), sharding={replicated}
  %add.767 = s64[] add(%get-tuple-element.362, %constant.988), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=323}
  %get-tuple-element.360 = c128[200,200]{1,0} get-tuple-element(%arg_tuple.18), index=1, sharding={replicated}
  %get-tuple-element.359 = c128[200,1,1]{2,1,0} get-tuple-element(%arg_tuple.18), index=2, sharding={replicated}
  %get-tuple-element.361 = s64[] get-tuple-element(%arg_tuple.18), index=0, sharding={replicated}
  %constant.1119 = s64[] constant(0), sharding={replicated}
  %compare.183 = pred[] compare(%get-tuple-element.361, %constant.1119), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1131 = s64[] constant(200), sharding={replicated}
  %add.769 = s64[] add(%get-tuple-element.361, %constant.1131), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %select.311 = s64[] select(%compare.183, %add.769, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1120 = s64[] constant(0), sharding={replicated}
  %dynamic-slice.59 = c128[1,1,1]{2,1,0} dynamic-slice(%get-tuple-element.359, %select.311, %constant.1120, %constant.1120), dynamic_slice_sizes={1,1,1}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %reshape.449 = c128[1,1]{1,0} reshape(%dynamic-slice.59), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/squeeze" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1121 = s64[] constant(0), sharding={replicated}
  %compare.184 = pred[] compare(%get-tuple-element.361, %constant.1121), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1132 = s64[] constant(200), sharding={replicated}
  %add.770 = s64[] add(%get-tuple-element.361, %constant.1132), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %select.312 = s64[] select(%compare.184, %add.770, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1122 = s64[] constant(0), sharding={replicated}
  %compare.185 = pred[] compare(%get-tuple-element.361, %constant.1122), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %constant.1133 = s64[] constant(200), sharding={replicated}
  %add.771 = s64[] add(%get-tuple-element.361, %constant.1133), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %select.313 = s64[] select(%compare.185, %add.771, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %dynamic-update-slice.30 = c128[200,200]{1,0} dynamic-update-slice(%get-tuple-element.360, %reshape.449, %select.312, %select.313), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_update_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=315}
  %get-tuple-element.358 = c128[200,1,1]{2,1,0} get-tuple-element(%arg_tuple.18), index=3, sharding={replicated}
  %constant.1123 = s64[] constant(0), sharding={replicated}
  %compare.186 = pred[] compare(%get-tuple-element.361, %constant.1123), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1134 = s64[] constant(200), sharding={replicated}
  %add.772 = s64[] add(%get-tuple-element.361, %constant.1134), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %select.314 = s64[] select(%compare.186, %add.772, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1124 = s64[] constant(0), sharding={replicated}
  %dynamic-slice.60 = c128[1,1,1]{2,1,0} dynamic-slice(%get-tuple-element.358, %select.314, %constant.1124, %constant.1124), dynamic_slice_sizes={1,1,1}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %reshape.450 = c128[1,1]{1,0} reshape(%dynamic-slice.60), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/squeeze" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1139 = s64[] constant(1), sharding={replicated}
  %add.774 = s64[] add(%get-tuple-element.361, %constant.1139), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1125 = s64[] constant(0), sharding={replicated}
  %compare.187 = pred[] compare(%add.774, %constant.1125), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.996 = s64[] constant(201), sharding={replicated}
  %add.780 = s64[] add(%get-tuple-element.361, %constant.996), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %select.315 = s64[] select(%compare.187, %add.780, %add.774), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1126 = s64[] constant(0), sharding={replicated}
  %compare.188 = pred[] compare(%get-tuple-element.361, %constant.1126), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1136 = s64[] constant(200), sharding={replicated}
  %add.775 = s64[] add(%get-tuple-element.361, %constant.1136), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %select.316 = s64[] select(%compare.188, %add.775, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %dynamic-update-slice.31 = c128[200,200]{1,0} dynamic-update-slice(%dynamic-update-slice.30, %reshape.450, %select.315, %select.316), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_update_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=318}
  %constant.1127 = s64[] constant(0), sharding={replicated}
  %compare.189 = pred[] compare(%get-tuple-element.361, %constant.1127), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %constant.1137 = s64[] constant(200), sharding={replicated}
  %add.776 = s64[] add(%get-tuple-element.361, %constant.1137), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %select.317 = s64[] select(%compare.189, %add.776, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %constant.1128 = s64[] constant(0), sharding={replicated}
  %dynamic-slice.61 = c128[1,1,1]{2,1,0} dynamic-slice(%get-tuple-element.358, %select.317, %constant.1128, %constant.1128), dynamic_slice_sizes={1,1,1}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %real.31 = f64[1,1,1]{2,1,0} real(%dynamic-slice.61), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %imag.30 = f64[1,1,1]{2,1,0} imag(%dynamic-slice.61), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %negate.51 = f64[1,1,1]{2,1,0} negate(%imag.30), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %complex.26 = c128[1,1,1]{2,1,0} complex(%real.31, %negate.51), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %reshape.469 = c128[1,1]{1,0} reshape(%complex.26), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %constant.1129 = s64[] constant(0), sharding={replicated}
  %compare.190 = pred[] compare(%get-tuple-element.361, %constant.1129), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %constant.1135 = s64[] constant(200), sharding={replicated}
  %add.777 = s64[] add(%get-tuple-element.361, %constant.1135), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %select.318 = s64[] select(%compare.190, %add.777, %get-tuple-element.361), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %constant.1138 = s64[] constant(1), sharding={replicated}
  %add.779 = s64[] add(%get-tuple-element.361, %constant.1138), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=320}
  %constant.1130 = s64[] constant(0), sharding={replicated}
  %compare.191 = pred[] compare(%add.779, %constant.1130), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %constant.998 = s64[] constant(201), sharding={replicated}
  %add.781 = s64[] add(%get-tuple-element.361, %constant.998), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %select.319 = s64[] select(%compare.191, %add.781, %add.779), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  %dynamic-update-slice.32 = c128[200,200]{1,0} dynamic-update-slice(%dynamic-update-slice.31, %reshape.469, %select.318, %select.319), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/body/dynamic_update_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=319}
  ROOT %tuple.83 = (s64[], c128[200,200]{1,0}, c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}) tuple(%add.767, %dynamic-update-slice.32, %get-tuple-element.359, %get-tuple-element.358), sharding={{replicated}, {replicated}, {replicated}, {replicated}}
  %constant.990 = s64[] constant(1)
  %constant.992 = s64[] constant(0)
  %constant.994 = s64[] constant(200)
}

%region_21.1816.clone.clone (arg_tuple.17: (s64[], c128[200,200], c128[200,1,1], c128[200,1,1])) -> pred[] {
  %arg_tuple.17 = (s64[], c128[200,200]{1,0}, c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}) parameter(0), sharding={{replicated}, {replicated}, {replicated}, {replicated}}
  %get-tuple-element.357 = s64[] get-tuple-element(%arg_tuple.17), index=0, sharding={replicated}
  %constant.986 = s64[] constant(199), sharding={replicated}
  ROOT %compare.182 = pred[] compare(%get-tuple-element.357, %constant.986), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=323}
}

%region_19.1900 (arg_tuple.1901: (c128[200,1,1], c128[200,1,1], s32[], f64[5])) -> (f64[5], pred[]) {
  %constant.1918 = s64[] constant(0), sharding={replicated}
  %constant.1916 = c128[] constant((0, 0)), sharding={replicated}
  %broadcast.1917 = c128[200,200]{1,0} broadcast(%constant.1916), dimensions={}, sharding={replicated}
  %arg_tuple.1901 = (c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}, s32[], f64[5]{0}) parameter(0), sharding={{replicated}, {replicated}, {replicated}, {replicated}}
  %get-tuple-element.355 = c128[200,1,1]{2,1,0} get-tuple-element(%arg_tuple.1901), index=0, sharding={replicated}
  %get-tuple-element.356 = c128[200,1,1]{2,1,0} get-tuple-element(%arg_tuple.1901), index=1, sharding={replicated}
  %tuple.82 = (s64[], c128[200,200]{1,0}, c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}) tuple(%constant.1918, %broadcast.1917, %get-tuple-element.355, %get-tuple-element.356), sharding={{replicated}, {replicated}, {replicated}, {replicated}}
  %while.18 = (s64[], c128[200,200]{1,0}, c128[200,1,1]{2,1,0}, c128[200,1,1]{2,1,0}) while(%tuple.82), condition=%region_21.1816.clone.clone, body=%region_20.1803.clone.clone.clone, sharding={{replicated}, {replicated}, {replicated}, {replicated}}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=323}
  %get-tuple-element.1923 = c128[200,200]{1,0} get-tuple-element(%while.18), index=1, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/while" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=323}
  %slice.1924 = c128[1,1,1]{2,1,0} slice(%get-tuple-element.355), slice={[199:200], [0:1], [0:1]}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=326}
  %reshape.1925 = c128[1,1]{1,0} reshape(%slice.1924), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/squeeze" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=326}
  %constant.1915 = s64[] constant(199), sharding={replicated}
  %dynamic-update-slice.1926 = c128[200,200]{1,0} dynamic-update-slice(%get-tuple-element.1923, %reshape.1925, %constant.1915, %constant.1915), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/dynamic_update_slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=326}
  %real.1927 = f64[200,200]{1,0} real(%dynamic-update-slice.1926), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %imag.1928 = f64[200,200]{1,0} imag(%dynamic-update-slice.1926), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %negate.1929 = f64[200,200]{1,0} negate(%imag.1928), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %complex.1930 = c128[200,200]{1,0} complex(%real.1927, %negate.1929), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %transpose.1931 = c128[200,200]{0,1} transpose(%complex.1930), dimensions={1,0}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/transpose" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %add.1932 = c128[200,200]{1,0} add(%dynamic-update-slice.1926, %transpose.1931), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %constant.1913 = c128[] constant((0.5, 0)), sharding={replicated}
  %broadcast.1914 = c128[200,200]{1,0} broadcast(%constant.1913), dimensions={}, sharding={replicated}
  %multiply.1933 = c128[200,200]{1,0} multiply(%add.1932, %broadcast.1914), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=327}
  %iota.12 = s64[200,200]{1,0} iota(), iota_dimension=0, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %iota.13 = s64[200,200]{1,0} iota(), iota_dimension=1, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %compare.54 = pred[200,200]{1,0} compare(%iota.12, %iota.13), direction=EQ, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/eq" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %iota.1934 = s64[200]{0} iota(), iota_dimension=0, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/iota" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=542}
  %get-tuple-element.1904 = s32[] get-tuple-element(%arg_tuple.1901), index=2, sharding={replicated}
  %constant.1912 = s32[] constant(1), sharding={replicated}
  %add.1935 = s32[] add(%get-tuple-element.1904, %constant.1912), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=543}
  %convert.1936 = s64[] convert(%add.1935), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=544}
  %broadcast.1937 = s64[200]{0} broadcast(%convert.1936), dimensions={}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/ge" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=544}
  %compare.1938 = pred[200]{0} compare(%iota.1934, %broadcast.1937), direction=GE, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/ge" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=544}
  %constant.1910 = f64[] constant(1000000), sharding={replicated}
  %broadcast.1911 = f64[200]{0} broadcast(%constant.1910), dimensions={}, sharding={replicated}
  %constant.673 = f64[] constant(0), sharding={replicated}
  %broadcast.828 = f64[200]{0} broadcast(%constant.673), dimensions={}, sharding={replicated}
  %select.238 = f64[200]{0} select(%compare.1938, %broadcast.1911, %broadcast.828), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/mul" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=544}
  %broadcast.474 = f64[200,200]{1,0} broadcast(%select.238), dimensions={1}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %constant.370 = f64[] constant(0), sharding={replicated}
  %broadcast.478 = f64[200,200]{1,0} broadcast(%constant.370), dimensions={}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/jit(_where)/broadcast_in_dim" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %select.127 = f64[200,200]{1,0} select(%compare.54, %broadcast.474, %broadcast.478), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(_diag)/jit(_where)/select_n" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %convert.1942 = c128[200,200]{1,0} convert(%select.127), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/convert_element_type" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %add.1943 = c128[200,200]{1,0} add(%multiply.1933, %convert.1942), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=545}
  %real.24 = f64[200,200]{1,0} real(%add.1943), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/real" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %imag.23 = f64[200,200]{1,0} imag(%add.1943), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/imag" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %negate.46 = f64[200,200]{1,0} negate(%imag.23), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/neg" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %complex.27 = c128[200,200]{1,0} complex(%real.24, %negate.46), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %transpose.75 = c128[200,200]{0,1} transpose(%complex.27), dimensions={1,0}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/complex" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %add.416 = c128[200,200]{1,0} add(%add.1943, %transpose.75), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %constant.674 = c128[] constant((0.5, 0)), sharding={replicated}
  %broadcast.830 = c128[200,200]{1,0} broadcast(%constant.674), dimensions={}, sharding={replicated}
  %multiply.123 = c128[200,200]{1,0} multiply(%add.416, %broadcast.830), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %custom-call.16 = (c128[200,200]{0,1}, f64[200]{0}, s32[]) custom-call(%multiply.123), custom_call_target="cusolver_syevd_ffi", operand_layout_constraints={c128[200,200]{0,1}}, output_to_operand_aliasing={{0}: (0, {})}, api_version=API_VERSION_TYPED_FFI, sharding={{replicated}, {replicated}, {replicated}}, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}, backend_config={algorithm = 0 : ui8, lower = true}
  %get-tuple-element.27 = s32[] get-tuple-element(%custom-call.16), index=2, sharding={replicated}, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %constant.372 = s32[] constant(0), sharding={replicated}
  %compare.55 = pred[] compare(%get-tuple-element.27, %constant.372), direction=EQ, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %broadcast.484 = pred[200]{0} broadcast(%compare.55), dimensions={}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %get-tuple-element.28 = f64[200]{0} get-tuple-element(%custom-call.16), index=1, sharding={replicated}, frontend_attributes={num_batch_dims="0"}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %constant.373 = f64[] constant(nan), sharding={replicated}
  %broadcast.486 = f64[200]{0} broadcast(%constant.373), dimensions={}, sharding={replicated}
  %select.128 = f64[200]{0} select(%broadcast.484, %get-tuple-element.28, %broadcast.486), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(eigvalsh)/jit(eigh)/eigh" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=546}
  %sort.0 = f64[200]{0} sort(%select.128), dimensions={0}, is_stable=true, to_apply=%region_22.1879, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/jit(sort)/sort" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %slice.1946 = f64[5]{0} slice(%sort.0), slice={[0:5]}, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/slice" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=547}
  %get-tuple-element.1905 = f64[5]{0} get-tuple-element(%arg_tuple.1901), index=3, sharding={replicated}
  %subtract.1949 = f64[5]{0} subtract(%slice.1946, %get-tuple-element.1905), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/sub" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=549}
  %abs.1950 = f64[5]{0} abs(%subtract.1949), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/abs" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=549}
  %abs.1947 = f64[5]{0} abs(%slice.1946), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/abs" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=548}
  %constant.1908 = f64[] constant(1e-08), sharding={replicated}
  %broadcast.1909 = f64[5]{0} broadcast(%constant.1908), dimensions={}, sharding={replicated}
  %maximum.1948 = f64[5]{0} maximum(%abs.1947, %broadcast.1909), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=548}
  %divide.1951 = f64[5]{0} divide(%abs.1950, %maximum.1948), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/div" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=549}
  %constant.1907 = f64[] constant(-inf)
  %reduce.1952 = f64[] reduce(%divide.1951, %constant.1907), dimensions={0}, to_apply=%region_23.1896, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/reduce_max" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=549}
  %constant.1906 = f64[] constant(0.0001), sharding={replicated}
  %compare.1953 = pred[] compare(%reduce.1952, %constant.1906), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/cond/branch_1_fun/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/solvers/lanczos.py" source_line=550}
  ROOT %tuple.1954 = (f64[5]{0}, pred[]) tuple(%slice.1946, %compare.1953), sharding={{replicated}, {replicated}}
}

%region_7.1323 (Arg_0.1324: c128[], Arg_1.1325: c128[]) -> c128[] {
  %Arg_0.1324 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/psum2"}
  %Arg_1.1325 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/psum2"}
  ROOT %add.1326 = c128[] add(%Arg_0.1324, %Arg_1.1325), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=290}
}

%region_8.1327 (Arg_0.1328: c128[], Arg_1.1329: c128[]) -> c128[] {
  %Arg_0.1328 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/reduce_scatter"}
  %Arg_1.1329 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/reduce_scatter"}
  ROOT %add.1330 = c128[] add(%Arg_0.1328, %Arg_1.1329), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=298}
}

%scalar_add_computation (scalar_lhs: c128[], scalar_rhs: c128[]) -> c128[] {
  %scalar_lhs = c128[] parameter(0)
  %scalar_rhs = c128[] parameter(1)
  ROOT %add.592 = c128[] add(%scalar_lhs, %scalar_rhs)
}

%region_5.1287 (Arg_0.1288: c128[], Arg_1.1289: c128[]) -> c128[] {
  %Arg_0.1288 = c128[] parameter(0), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum"}
  %Arg_1.1289 = c128[] parameter(1), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum"}
  ROOT %add.1290 = c128[] add(%Arg_0.1288, %Arg_1.1289), metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
}

%region_4.1302.clone (arg_tuple.7: (s64[], c128[1,2,240,64], c128[1,240,64])) -> (s64[], c128[1,2,240,64], c128[1,240,64]) {
  %arg_tuple.7 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), sharding={{replicated}, {manual}, {manual}}
  %get-tuple-element.194 = s64[] get-tuple-element(%arg_tuple.7), index=0, sharding={replicated}
  %constant.785 = s64[] constant(1), sharding={replicated}
  %add.680 = s64[] add(%get-tuple-element.194, %constant.785), sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285}
  %get-tuple-element.195 = c128[1,2,240,64]{3,2,1,0} get-tuple-element(%arg_tuple.7), index=1, sharding={manual}
  %collective-permute.6 = c128[1,2,240,64]{3,2,1,0} collective-permute(%get-tuple-element.195), channel_id=2, source_target_pairs={{0,2},{2,0},{1,3},{3,1}}, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/ppermute" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=282}
  %get-tuple-element.196 = c128[1,240,64]{2,1,0} get-tuple-element(%arg_tuple.7), index=2, sharding={manual}
  %constant.787 = c128[] constant((0, 0)), sharding={manual}
  %reduce.10 = c128[1,240,64]{2,1,0} reduce(%get-tuple-element.195, %constant.787), dimensions={1}, to_apply=%region_5.1287, sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/reduce_sum" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
  %add.682 = c128[1,240,64]{2,1,0} add(%get-tuple-element.196, %reduce.10), sharding={manual}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/body/add" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=281}
  ROOT %tuple.54 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) tuple(%add.680, %collective-permute.6, %add.682), sharding={{replicated}, {manual}, {manual}}
}

%region_6.1315.clone (arg_tuple.6: (s64[], c128[1,2,240,64], c128[1,240,64])) -> pred[] {
  %arg_tuple.6 = (s64[], c128[1,2,240,64]{3,2,1,0}, c128[1,240,64]{2,1,0}) parameter(0), sharding={{replicated}, {manual}, {manual}}
  %get-tuple-element.193 = s64[] get-tuple-element(%arg_tuple.6), index=0, sharding={replicated}
  %constant.784 = s64[] constant(2), sharding={replicated}
  ROOT %compare.124 = pred[] compare(%get-tuple-element.193, %constant.784), direction=LT, sharding={replicated}, metadata={op_name="jit(_full_run)/jit(main)/while/body/jit(_matvec_impl)/jit(shmap_body)/while/cond/lt" source_file="/global/homes/j/jackm/software/lorrax_C/src/bse/bse_ring_comm.py" source_line=285}
}

%and.reduce_sub_computation (lhs: pred[], rhs: pred[]) -> pred[] {
  %lhs = pred[] parameter(0)
  %rhs = pred[] parameter(1)
  ROOT %and.11 = pred[] and(%lhs, %rhs)
}

%and.reduce_sub_computation.1 (lhs.1: pred[], rhs.1: pred[]) -> pred[] {
  %lhs.1 = pred[] parameter(0)
  %rhs.1 = pred[] parameter(1)
  ROOT %and.13 = pred[] and(%lhs.1, %rhs.1)
}

